[
  {
    "category": "Aquatic and Marine Mammals",
    "creatures": [
      {
        "name": "Bahamut",
        "origin": "Arabic",
        "appearance": "A colossal whale-like creature of unimaginable size, its body shimmering with cosmic hues and strange glyphs etched into its skin.",
        "attacks": [
          {
            "name": "Cosmic Tail Slam",
            "damage": "6d10 bludgeoning",
            "effect": "On a hit, the target must succeed on a DC 20 Strength saving throw or be knocked prone and pushed 20 feet."
          },
          {
            "name": "Astral Bellow",
            "damage": "5d8 thunder",
            "effect": "All creatures within 60 feet must make a DC 18 Constitution saving throw or be stunned until the end of Bahamut’s next turn."
          }
        ]
      },
      {
        "name": "Bake-kujira",
        "origin": "Japanese",
        "appearance": "A spectral whale skeleton draped in tattered phantom flesh, glowing with eerie ghost-lights.",
        "attacks": [
          {
            "name": "Ethereal Bite",
            "damage": "3d8 necrotic",
            "effect": "Target must succeed on a DC 15 Constitution saving throw or lose 1 hit die (or take additional 2d8 necrotic if it has no hit dice)."
          },
          {
            "name": "Wail of the Damned",
            "damage": "4d6 psychic",
            "effect": "All creatures within 30 feet must make a DC 16 Wisdom saving throw or become frightened until the end of their next turn."
          }
        ]
      },
      {
        "name": "Cetus",
        "origin": "Greek",
        "appearance": "A massive hybrid of boar-headed whale, sleek dolphin-like body, and a fan-shaped, split tail. Its hide is rough and barnacle-encrusted.",
        "attacks": [
          {
            "name": "Savage Tusks",
            "damage": "4d8 piercing",
            "effect": "On a hit, target must succeed on a DC 16 Strength saving throw or be knocked back 10 feet."
          },
          {
            "name": "Whirlpool Crash",
            "damage": "4d6 bludgeoning",
            "effect": "Creates a swirling vortex of water (20-foot radius). Creatures in the area must make a DC 17 Strength saving throw or be pulled 10 feet closer and knocked prone."
          }
        ]
      },
      {
        "name": "Devil Whale",
        "origin": "English",
        "appearance": "An enormous whale with dark, craggy skin resembling stone, huge glowing eyes, and a mouth lined with jagged teeth.",
        "attacks": [
          {
            "name": "Shipbreaker Maw",
            "damage": "6d8 piercing",
            "effect": "On a hit against a wooden structure or ship, deals double damage. Against creatures, on a failed DC 18 Dexterity save, swallowed target is considered grappled (escape DC 18) and takes 3d8 acid damage per turn."
          },
          {
            "name": "Tidal Fluke",
            "damage": "4d6 bludgeoning",
            "effect": "All creatures within 15 feet must make a DC 16 Dexterity saving throw or be slammed by a wave, taking full damage and being knocked prone."
          }
        ]
      },
      {
        "name": "Encantado",
        "origin": "Brazilian",
        "appearance": "A sleek pink dolphin capable of turning into a charming human with a mysterious smile and a straw hat.",
        "attacks": [
          {
            "name": "Siren's Song",
            "damage": "None",
            "effect": "Each humanoid within 30 feet who can hear it must make a DC 15 Wisdom saving throw or become charmed for 1 minute."
          },
          {
            "name": "Enchanted Bite (Dolphin Form)",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must succeed on a DC 13 Charisma saving throw or become confused (as the Confusion spell) for 1 round."
          }
        ]
      },
      {
        "name": "Glashtyn",
        "origin": "Celtic",
        "appearance": "A dark, sleek horse-like goblin with a damp mane and luminous eyes, its skin perpetually dripping seawater.",
        "attacks": [
          {
            "name": "Drowning Charge",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, if near water, the target must succeed on a DC 14 Strength save or be dragged underwater, beginning to suffocate."
          },
          {
            "name": "Brackish Kick",
            "damage": "2d10 bludgeoning",
            "effect": "On a hit, target must succeed on a DC 13 Dexterity saving throw or be knocked prone."
          }
        ]
      },
      {
        "name": "Gveleshapi",
        "origin": "Georgian",
        "appearance": "A serpent-whale hybrid with a serpentine neck, massive whale body, and emerald-green scales that shimmer in aquatic light.",
        "attacks": [
          {
            "name": "Flood Breath",
            "damage": "4d8 cold",
            "effect": "A 30-foot cone of frigid water forces creatures to make a DC 16 Constitution saving throw or be blinded by swirling currents and take full damage. Half damage and no blindness on a success."
          },
          {
            "name": "Scale Whip",
            "damage": "3d10 slashing",
            "effect": "Gveleshapi lashes out with its serpentine tail. On a hit, target must succeed on a DC 16 Strength saving throw or be restrained as the tail coils around them."
          }
        ]
      },
      {
        "name": "Makara",
        "origin": "Hindu mythology",
        "appearance": "A chimeric beast with the head of an elephant and the body of a large fish, adorned with colorful, ornate scales.",
        "attacks": [
          {
            "name": "Trunk Bash",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, the target must succeed on a DC 15 Strength saving throw or be knocked prone."
          },
          {
            "name": "Aqua Rampage",
            "damage": "3d6 bludgeoning + 2d6 cold",
            "effect": "A surge of water erupts around the Makara. Creatures in a 20-foot radius must make a DC 15 Dexterity save or be pushed 10 feet away and take the full damage."
          }
        ]
      },
      {
        "name": "Mug-wamp",
        "origin": "Canadian",
        "appearance": "A colossal sturgeon-like creature with ridged scales, two massive pectoral fins, and sharp protruding bone shards.",
        "attacks": [
          {
            "name": "Spine Bash",
            "damage": "4d6 piercing",
            "effect": "On a hit, the target must make a DC 14 Constitution save or suffer a bleeding wound (1d6 damage at the start of each of its turns until healed)."
          },
          {
            "name": "Tremor Splash",
            "damage": "3d8 bludgeoning",
            "effect": "Mug-wamp slams the water, causing a small localized quake. Creatures within 15 feet must make a DC 14 Dexterity saving throw or be knocked prone."
          }
        ]
      },
      {
        "name": "Sea Goat",
        "origin": "Greek",
        "appearance": "A hybrid with the front half of a sturdy mountain goat and the rear half of a shimmering fish.",
        "attacks": [
          {
            "name": "Horn Charge",
            "damage": "3d8 piercing",
            "effect": "On a hit, the target must succeed on a DC 13 Strength saving throw or be pushed 10 feet back."
          },
          {
            "name": "Tidal Leap",
            "damage": "2d6 bludgeoning",
            "effect": "The Sea Goat leaps from the water, crashing down upon a target. On a hit, the target must make a DC 13 Dexterity save or be knocked prone."
          }
        ]
      },
      {
        "name": "Selkie",
        "origin": "Scottish",
        "appearance": "A graceful seal that can shed its skin to become a beautiful human. Often wearing a cloak of seal fur.",
        "attacks": [
          {
            "name": "Skin Shatter",
            "damage": "2d6 piercing",
            "effect": "Only usable in seal form; Selkie bites fiercely. On a hit, target must make a DC 12 Constitution saving throw or lose 5 feet of movement due to pain."
          },
          {
            "name": "Beguiling Charm",
            "damage": "None",
            "effect": "In human form, Selkie can force a DC 14 Charisma saving throw or charm one humanoid for 1 hour, causing it to act as an ally."
          }
        ]
      },
      {
        "name": "Water Bull",
        "origin": "Scottish",
        "appearance": "A large amphibious bull with slick, dark fur, glowing red eyes, and curled horns that drip with brackish water.",
        "attacks": [
          {
            "name": "Gore",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must make a DC 15 Strength saving throw or be knocked prone."
          },
          {
            "name": "Nightstream Charge",
            "damage": "4d6 bludgeoning",
            "effect": "The Water Bull charges through water at incredible speed. On a hit, target must succeed on a DC 14 Dexterity save or be grappled by its horns."
          }
        ]
      },
      {
        "name": "Water Horse",
        "origin": "General",
        "appearance": "A broad category of mythical water-dwelling horses, slick-coated and often with aquatic features like fins or webbed hooves.",
        "attacks": [
          {
            "name": "Drowning Bite",
            "damage": "3d6 piercing",
            "effect": "On a hit, if target is adjacent to a body of water, it must make a DC 14 Strength saving throw or be dragged underwater."
          },
          {
            "name": "Wave Stomp",
            "damage": "2d8 bludgeoning",
            "effect": "Stomps the surface of water, creating a shockwave. Creatures within 10 feet must make a DC 13 Constitution save or be stunned until the end of its next turn."
          }
        ]
      },
      {
        "name": "Ceffyl Dŵr",
        "origin": "Welsh",
        "appearance": "A spectral horse formed of swirling mist and spray, semi-transparent and constantly dripping.",
        "attacks": [
          {
            "name": "Mist Kick",
            "damage": "2d8 cold",
            "effect": "On a hit, target must succeed on a DC 13 Wisdom saving throw or become frightened for 1 round."
          },
          {
            "name": "Veil of Vapor",
            "damage": "None",
            "effect": "The horse fills a 15-foot radius with dense mist. Creatures in the area have disadvantage on attack rolls until the start of the Ceffyl Dŵr's next turn."
          }
        ]
      },
      {
        "name": "Each-uisge",
        "origin": "Scottish",
        "appearance": "A malevolent, shape-shifting water horse with a dark, slimy coat and feral, predatory eyes.",
        "attacks": [
          {
            "name": "Grasping Mane",
            "damage": "3d6 slashing",
            "effect": "Its mane wraps around a target. On a hit, target is grappled (escape DC 15) and takes 2d6 slashing damage at the start of each of its turns until freed."
          },
          {
            "name": "Drown and Drag",
            "damage": "4d8 necrotic (from drowning)",
            "effect": "If the target is grappled, Each-uisge dives underwater. The target must hold its breath or begin suffocating, taking damage each round."
          }
        ]
      },
      {
        "name": "Enbarr",
        "origin": "Irish",
        "appearance": "A divine steed of shimmering silver fur, capable of racing across both land and sea as if both were solid ground.",
        "attacks": [
          {
            "name": "Trample",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target must succeed on a DC 14 Strength saving throw or be knocked prone."
          },
          {
            "name": "Surfstride",
            "damage": "None",
            "effect": "Enbarr causes the ground or water to ripple. Creatures in a 20-foot line must make a DC 14 Dexterity save or fall prone as balance is disrupted."
          }
        ]
      },
      {
        "name": "Hippocampus",
        "origin": "Greek",
        "appearance": "A horse with the rear of a fish, iridescent scales, and a crest of fin-like spines along its neck.",
        "attacks": [
          {
            "name": "Fin Lash",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must succeed on a DC 12 Strength saving throw or be pulled 5 feet closer."
          },
          {
            "name": "Brine Breath",
            "damage": "3d6 cold",
            "effect": "A 15-foot cone of supercooled mist. Creatures must make a DC 13 Constitution save or have their movement halved until the end of their next turn."
          }
        ]
      },
      {
        "name": "Ichthyocentaurs",
        "origin": "Greek",
        "appearance": "Upper body of a human, lower front of a horse, and fish-like tail. Often depicted with shells, coral crowns, and tridents.",
        "attacks": [
          {
            "name": "Trident Thrust",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must succeed on DC 14 Strength save or drop one held item."
          },
          {
            "name": "Wavecaller",
            "damage": "3d6 bludgeoning",
            "effect": "Summons a surge of water in a 10-foot radius. Creatures must make a DC 14 Dexterity save or be knocked prone."
          }
        ]
      },
      {
        "name": "Kelpie",
        "origin": "Scottish",
        "appearance": "A dark green, dripping horse-creature with kelp-like mane and glowing, eerie eyes.",
        "attacks": [
          {
            "name": "Constricting Bridle",
            "damage": "2d8 slashing",
            "effect": "On a hit, target is grappled (escape DC 14). While grappled, the Kelpie can move freely, forcing the victim along."
          },
          {
            "name": "Bog Rush",
            "damage": "3d6 bludgeoning",
            "effect": "Kelpie surges through swampy terrain, causing it to become difficult terrain. Targets in the path must make DC 13 Dexterity save or be restrained by thick mud."
          }
        ]
      },
      {
        "name": "Morvarc'h",
        "origin": "Breton",
        "appearance": "A legendary black horse that can gallop across the waves, leaving a trail of glowing surf.",
        "attacks": [
          {
            "name": "Surf Sprint",
            "damage": "2d8 bludgeoning",
            "effect": "Morvarc'h dashes through enemies on water's surface. Each creature in a 10-foot line must make a DC 13 Dexterity save or be knocked prone."
          },
          {
            "name": "Moonlit Neigh",
            "damage": "2d6 psychic",
            "effect": "All creatures within 30 feet must succeed on a DC 14 Wisdom save or be charmed until the end of Morvarc'h’s next turn."
          }
        ]
      },
      {
        "name": "Nixie",
        "origin": "Germanic",
        "appearance": "A shapeshifting water being, sometimes appearing as a beautiful human or a sleek water horse, with lily pads and reeds in her hair.",
        "attacks": [
          {
            "name": "Ensnaring Melody",
            "damage": "None",
            "effect": "Targets within 30 feet must make a DC 14 Wisdom save or become charmed and walk closer to the Nixie."
          },
          {
            "name": "Reed Lash",
            "damage": "2d6 slashing",
            "effect": "A whip of river reeds. On a hit, target must succeed on a DC 13 Strength save or be entangled, reducing speed to 0."
          }
        ]
      },
      {
        "name": "Nuckelavee",
        "origin": "Orcadian",
        "appearance": "A horrifying skinless horse-man hybrid with exposed muscle and sinew, carrying a stench of decay.",
        "attacks": [
          {
            "name": "Pestilent Breath",
            "damage": "4d8 poison",
            "effect": "A 15-foot cone of toxic fumes. Creatures must make DC 15 Constitution save or be poisoned for 1 minute."
          },
          {
            "name": "Flesh Rake",
            "damage": "3d8 slashing",
            "effect": "On a hit, target must succeed on a DC 15 Constitution save or suffer disadvantage on attack rolls for 1 round due to pain."
          }
        ]
      },
      {
        "name": "Nuggle",
        "origin": "Scottish",
        "appearance": "A smaller water horse with a mischievous grin, slick dark fur and a perpetually dripping tail.",
        "attacks": [
          {
            "name": "Splash Kick",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must succeed on DC 12 Dexterity save or be soaked, granting disadvantage on stealth checks."
          },
          {
            "name": "Illusionary Bridle",
            "damage": "None",
            "effect": "Nuggle creates a minor illusion of treasure or safe passage. Targets must succeed on DC 13 Intelligence save or be lured into dangerous terrain."
          }
        ]
      },
      {
        "name": "Tangie",
        "origin": "Scottish",
        "appearance": "A shapeshifting sea horse entity, often seen as a lanky horse-man covered in seaweed.",
        "attacks": [
          {
            "name": "Seaweed Lash",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must succeed on DC 14 Strength save or be restrained by clinging seaweed."
          },
          {
            "name": "Drowning Illusion",
            "damage": "None",
            "effect": "Tangie projects illusions of drowning hazards. Targets within 30 feet must make a DC 14 Wisdom save or become frightened for 1 minute."
          }
        ]
      }
    ]
  },
  {
    "category": "Arthropods",
    "creatures": [
      {
        "name": "Anansi",
        "origin": "West African",
        "appearance": "A human-sized spider with intricate patterns on its abdomen, capable of standing on two legs and wielding small tools.",
        "attacks": [
          {
            "name": "Web Snare",
            "damage": "2d6 piercing",
            "effect": "Target must make a DC 13 Strength save or be restrained by sticky webs. Escaping requires a DC 13 Strength check."
          },
          {
            "name": "Trickster’s Bite",
            "damage": "2d8 poison",
            "effect": "On a hit, target makes a DC 14 Constitution save or is poisoned for 1 minute. While poisoned, target is confused (as Confusion spell) for 1 round."
          }
        ]
      },
      {
        "name": "Arachne",
        "origin": "Greek",
        "appearance": "A humanoid upper body with a spider’s abdomen and legs, elegant yet unsettling, wearing tattered remnants of woven silk.",
        "attacks": [
          {
            "name": "Venomous Fang",
            "damage": "3d6 poison",
            "effect": "On a hit, target must succeed on a DC 15 Constitution save or be poisoned for 1 minute."
          },
          {
            "name": "Silk Strand",
            "damage": "None",
            "effect": "Arachne attempts to ensnare a target within 30 feet. Target must make a DC 14 Dexterity save or become restrained. Target can attempt a DC 14 Strength check to break free."
          }
        ]
      },
      {
        "name": "Carbuncle (Chilote, Arthropod form)",
        "origin": "Chilote",
        "appearance": "A beetle-like creature with a glowing, ruby-like protrusion on its forehead, carapace shimmering greenish-red.",
        "attacks": [
          {
            "name": "Fiery Horn",
            "damage": "2d6 fire",
            "effect": "On a hit, the target’s clothes or fur may catch fire, taking 1d6 fire damage at the start of each of their turns until extinguished."
          },
          {
            "name": "Swarm Call",
            "damage": "None",
            "effect": "Carbuncle summons a swarm of tiny glowing beetles. Creatures in a 15-foot radius must make a DC 13 Wisdom save or be dazzled, granting attackers advantage against them until end of next round."
          }
        ]
      },
      {
        "name": "Gold-digging Ant",
        "origin": "Greek (Herodotus)",
        "appearance": "A large, dog-sized ant with golden-tinted chitin, powerful mandibles, and antennae that detect precious metals.",
        "attacks": [
          {
            "name": "Mandible Crush",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must make a DC 14 Strength save or drop one carried metal item as the ant tries to claim it."
          },
          {
            "name": "Burrow Ambush",
            "damage": "2d8 piercing",
            "effect": "If attacking from underground, the target must make a DC 14 Dexterity save or be knocked prone as the ant erupts from below."
          }
        ]
      },
      {
        "name": "Iktomi",
        "origin": "Lakota",
        "appearance": "A lanky humanoid figure with spider-like limbs and subtle chitin plating on the joints.",
        "attacks": [
          {
            "name": "Claw Slash",
            "damage": "2d6 slashing",
            "effect": "On a hit, the target must succeed on a DC 13 Dexterity save or be disarmed of one held item."
          },
          {
            "name": "Illusory Web",
            "damage": "None",
            "effect": "Creates illusory strands in a 15-foot area. Creatures must make a DC 14 Intelligence save or treat the area as difficult terrain and have disadvantage on attack rolls due to confusion."
          }
        ]
      },
      {
        "name": "Jorōgumo",
        "origin": "Japanese",
        "appearance": "A beautiful woman from the waist up, and a giant spider below. Silken robes blend with spider silk.",
        "attacks": [
          {
            "name": "Enthralling Gaze",
            "damage": "None",
            "effect": "One humanoid within 30 feet must succeed on a DC 15 Wisdom save or be charmed for 1 minute, defenseless against her next bite."
          },
          {
            "name": "Venomous Bite",
            "damage": "3d6 poison",
            "effect": "On a hit, DC 14 Constitution save or be poisoned for 1 minute. While poisoned, target takes 1d6 additional poison damage each turn."
          }
        ]
      },
      {
        "name": "Karkinos",
        "origin": "Greek",
        "appearance": "A giant crab with iron-hard claws and a shell covered in barnacles.",
        "attacks": [
          {
            "name": "Crushing Claw",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target must make a DC 15 Strength save or be grappled. Grappled target takes 1d8 bludgeoning damage at the start of each of Karkinos’ turns."
          },
          {
            "name": "Shell Slam",
            "damage": "2d10 bludgeoning",
            "effect": "Karkinos rears up and slams its shell down. All creatures within 10 feet must make a DC 14 Dexterity save or be knocked prone."
          }
        ]
      },
      {
        "name": "Khepri",
        "origin": "Ancient Egyptian",
        "appearance": "A giant scarab beetle with a gleaming carapace of iridescent blues and greens, holding a golden disc mimicking the sun.",
        "attacks": [
          {
            "name": "Radiant Mandibles",
            "damage": "2d8 radiant",
            "effect": "On a hit, target must make a DC 14 Constitution save or be blinded until the end of its next turn due to the beetle’s brilliance."
          },
          {
            "name": "Solar Blessing",
            "damage": "None",
            "effect": "Khepri bathes an area in sunlight. Allies within 30 feet gain advantage on their next attack roll. Enemies must make a DC 14 Wisdom save or have disadvantage on their next attack roll."
          }
        ]
      },
      {
        "name": "Mothman",
        "origin": "American cryptid",
        "appearance": "A tall, humanoid moth with large glowing red eyes and greyish feathers instead of fur.",
        "attacks": [
          {
            "name": "Glaring Eyes",
            "damage": "2d6 psychic",
            "effect": "A 30-foot cone of red eye-glow. Targets must make a DC 15 Wisdom save or be frightened for 1 minute."
          },
          {
            "name": "Wing Buffet",
            "damage": "3d6 bludgeoning",
            "effect": "Mothman strikes with powerful wings. On a hit, target must make a DC 14 Strength save or be pushed 10 feet away."
          }
        ]
      },
      {
        "name": "Myrmecoleon",
        "origin": "Christian bestiary",
        "appearance": "A strange hybrid of ant and lion, with the head and forebody of a lion and the abdomen of a giant ant.",
        "attacks": [
          {
            "name": "Predatory Pounce",
            "damage": "3d8 slashing",
            "effect": "On a hit, if the target is surprised, it takes an extra 1d8 slashing damage and must make a DC 14 Strength save or be knocked prone."
          },
          {
            "name": "Acidic Spray",
            "damage": "2d8 acid",
            "effect": "A 15-foot cone of caustic spray. Targets must make a DC 15 Dexterity save or take full damage and have their AC reduced by 1 for one round as armor sizzles."
          }
        ]
      },
      {
        "name": "Myrmidons",
        "origin": "Greek",
        "appearance": "Soldiers created from ants, humanoid in shape but with segmented exoskeleton and antenna-like helmets.",
        "attacks": [
          {
            "name": "Spear Thrust",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must make a DC 13 Strength save or drop their shield (if any) due to the force of impact."
          },
          {
            "name": "Coordinated Strike",
            "damage": "Varies",
            "effect": "If at least two Myrmidons are adjacent to the target, they deal an extra 1d6 piercing damage each due to perfect teamwork."
          }
        ]
      },
      {
        "name": "Pabilsag",
        "origin": "Babylonian",
        "appearance": "A chimera-like being: human torso, lower body of a horse, scorpion tail, often depicted with stars and astral symbols.",
        "attacks": [
          {
            "name": "Stinger Lunge",
            "damage": "3d6 poison",
            "effect": "On a hit, target must make a DC 15 Constitution save or become paralyzed for 1 minute, repeating the save at end of each turn."
          },
          {
            "name": "Astral Arrow",
            "damage": "2d8 radiant",
            "effect": "Fires a spectral arrow of starlight. On a hit, target glows faintly, granting advantage to the next attack roll made against it."
          }
        ]
      },
      {
        "name": "Scorpion Man",
        "origin": "Babylonian",
        "appearance": "A powerful humanoid warrior with the tail of a scorpion, often guarding gates or passages.",
        "attacks": [
          {
            "name": "Chitinous Spear",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must make a DC 14 Strength save or be pushed 5 feet back."
          },
          {
            "name": "Sting of Vigilance",
            "damage": "2d8 poison",
            "effect": "On a hit, target must make DC 15 Constitution save or take disadvantage on Perception checks for 1 minute, as venom clouds the senses."
          }
        ]
      },
      {
        "name": "Selket",
        "origin": "Ancient Egyptian",
        "appearance": "A goddess in scorpion form or a woman with a scorpion on her head, radiant and regal.",
        "attacks": [
          {
            "name": "Divine Sting",
            "damage": "3d8 poison + 2d6 radiant",
            "effect": "On a hit, target must succeed on DC 16 Constitution save or be poisoned and blinded for 1 round."
          },
          {
            "name": "Healing Venom",
            "damage": "None",
            "effect": "Selket can cure allies of poison or disease by touching them. Restores 2d8 hit points and removes poisoned condition."
          }
        ]
      },
      {
        "name": "Tsuchigumo",
        "origin": "Japanese",
        "appearance": "A colossal, shape-shifting spider with vivid markings and human-like face patterns on its abdomen.",
        "attacks": [
          {
            "name": "Giant Web Toss",
            "damage": "None",
            "effect": "A huge net of sticky silk covers a 20-foot area. Creatures must succeed on DC 15 Strength checks to move. Failing traps them in place."
          },
          {
            "name": "Venom Fang Fury",
            "damage": "4d6 poison",
            "effect": "On a hit, target must make DC 15 Constitution save or take an additional 1d6 poison damage at the start of each of its turns for 3 turns."
          }
        ]
      }
    ]
  },
  {
    "category": "Bats",
    "creatures": [
      {
        "name": "Balayang",
        "origin": "Australian Aboriginal",
        "appearance": "A large humanoid bat spirit with patterned wings and a gentle, wise gaze.",
        "attacks": [
          {
            "name": "Echo Pulse",
            "damage": "2d6 thunder",
            "effect": "A 30-foot cone of sonic waves. Targets must make DC 13 Constitution save or be deafened for 1 minute."
          },
          {
            "name": "Spirit Claw",
            "damage": "3d6 radiant",
            "effect": "On a hit, the target glows faintly. Until Balayang’s next turn, attacks against that target have +1 to hit."
          }
        ]
      },
      {
        "name": "Camazotz",
        "origin": "Mayan",
        "appearance": "A giant bat with razor-sharp fangs, humanoid limbs, and obsidian-tipped claws.",
        "attacks": [
          {
            "name": "Obsidian Claw",
            "damage": "4d6 slashing",
            "effect": "On a hit, target must make DC 14 Constitution save or lose 5 hit points at the start of each turn from bleeding until healed."
          },
          {
            "name": "Screech of the Underworld",
            "damage": "3d8 necrotic",
            "effect": "A 20-foot radius shriek. Targets must make DC 15 Wisdom save or be frightened and take full damage."
          }
        ]
      },
      {
        "name": "Leutogi",
        "origin": "Polynesian",
        "appearance": "A Samoan princess protected by bats, appearing as a humanoid figure wreathed in fluttering bat silhouettes.",
        "attacks": [
          {
            "name": "Bat Swarm",
            "damage": "3d4 piercing",
            "effect": "A swarm of bats engulfs a 15-foot area. Creatures inside must make DC 13 Dexterity save or be blinded by the flurry of wings."
          },
          {
            "name": "Guiding Wing",
            "damage": "None",
            "effect": "Leutogi grants an ally advantage on its next attack by directing a bat to distract the foe."
          }
        ]
      },
      {
        "name": "Minyades",
        "origin": "Greek",
        "appearance": "Three bat-like sisters with humanoid features, draped in dark veils, their eyes gleaming eerily.",
        "attacks": [
          {
            "name": "Coordinated Shriek",
            "damage": "4d6 psychic",
            "effect": "If all three Minyades shriek together, each creature in 30 feet must make a DC 15 Wisdom save or be stunned for 1 turn."
          },
          {
            "name": "Vampiric Kiss",
            "damage": "2d6 necrotic",
            "effect": "On a hit, target must succeed on DC 14 Constitution save or lose 1 Hit Die (or 2d6 additional necrotic if no Hit Dice remain). The Minyade regains hit points equal to half the necrotic damage dealt."
          }
        ]
      },
      {
        "name": "Tjinimin",
        "origin": "Australian Aboriginal",
        "appearance": "Ancestral bat figure, tall and slender with wings of shimmering darkness, carrying ceremonial markings.",
        "attacks": [
          {
            "name": "Dreamtime Wingbeat",
            "damage": "3d6 psychic",
            "effect": "A slow, rhythmic wingbeat. Targets must make DC 15 Charisma save or fall into a brief trance, losing their reaction until next turn."
          },
          {
            "name": "Bone Piercer",
            "damage": "2d8 piercing",
            "effect": "On a hit, the target’s movement is halved until they spend an action to remove the lodged bone shard."
          }
        ]
      },
      {
        "name": "Vetala",
        "origin": "Hindu",
        "appearance": "A vampiric entity inhabiting corpses, often bat-like in face or sprouting membranous wings.",
        "attacks": [
          {
            "name": "Corpse Possession",
            "damage": "None",
            "effect": "Vetala can animate a nearby corpse as a zombie ally. The zombie acts on Vetala’s initiative and remains animated until destroyed."
          },
          {
            "name": "Life Drain",
            "damage": "3d6 necrotic",
            "effect": "On a hit, target must make DC 14 Constitution save or lose 1 level of Exhaustion (Vetala gains temporary HP equal to damage dealt)."
          }
        ]
      }
    ]
  },
  {
    "category": "Birds",
    "creatures": [
      {
        "name": "Ababil",
        "origin": "Islamic",
        "appearance": "A miraculous flock of small birds with swift wings and beaks that can carry tiny stones of divine energy.",
        "attacks": [
          {
            "name": "Divine Pebble Drop",
            "damage": "2d6 radiant",
            "effect": "A hail of tiny stones from above. Creatures in a 10-foot radius must make DC 13 Dexterity save or take full damage and be dazzled (disadvantage on next attack)."
          }
        ]
      },
      {
        "name": "Adarna",
        "origin": "Philippine",
        "appearance": "A radiant bird with multicolored plumage that shifts hues with each of its songs.",
        "attacks": [
          {
            "name": "Slumber Song",
            "damage": "None",
            "effect": "All creatures within 20 feet must make DC 15 Wisdom save or fall asleep for 1 minute or until damaged."
          },
          {
            "name": "Petrifying Note",
            "damage": "None",
            "effect": "One target that failed the Slumber Song save must now make a DC 15 Constitution save or turn to stone for 1 hour."
          }
        ]
      },
      {
        "name": "Avalerion",
        "origin": "English",
        "appearance": "A rare, graceful bird with pure white feathers and a golden beak, said to only exist in pairs.",
        "attacks": [
          {
            "name": "Wing Buffet",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must make a DC 12 Strength save or be knocked back 5 feet."
          },
          {
            "name": "Healing Cry",
            "damage": "None",
            "effect": "Avalerion emits a soothing call. Allies within 30 feet regain 2d6 hit points and remove one level of Exhaustion."
          }
        ]
      },
      {
        "name": "Alicanto",
        "origin": "Chilean",
        "appearance": "A bird with luminescent feathers shimmering gold and silver. Its eyes glow in the dark.",
        "attacks": [
          {
            "name": "Dazzle Strike",
            "damage": "2d8 radiant",
            "effect": "On a hit, target must make DC 14 Wisdom save or be blinded until the end of its next turn."
          },
          {
            "name": "Ore Pecks",
            "damage": "3d4 piercing",
            "effect": "If the target is wearing metal armor, Alicanto deals an additional 1d4 damage as it pecks at the metal hungrily."
          }
        ]
      },
      {
        "name": "Anqa",
        "origin": "Arabian",
        "appearance": "A large, mysterious female bird with majestic plumage of fiery reds and oranges, often wreathed in warm winds.",
        "attacks": [
          {
            "name": "Tempest Wings",
            "damage": "3d6 bludgeoning",
            "effect": "A gust of hot wind in a 15-foot cone. Targets must make DC 14 Strength save or be knocked prone."
          },
          {
            "name": "Sunfire Beak",
            "damage": "3d8 fire",
            "effect": "On a hit, target must succeed on DC 15 Dexterity save or catch fire (1d6 fire damage per round until extinguished)."
          }
        ]
      }
    ]
  },
  {
    "category": "Birds (continued)",
    "creatures": [
      {
        "name": "Anzû",
        "origin": "Mesopotamian",
        "appearance": "A massive lion-headed eagle with enormous wings that crackle with elemental energy.",
        "attacks": [
          {
            "name": "Thunderous Screech",
            "damage": "3d8 thunder",
            "effect": "All creatures in a 30-foot cone must make a DC 16 Constitution save or be deafened for 1 minute."
          },
          {
            "name": "Lion’s Talons",
            "damage": "4d6 slashing",
            "effect": "On a hit, target must succeed on DC 15 Strength save or be knocked prone."
          }
        ]
      },
      {
        "name": "Bare-fronted Hoodwink",
        "origin": "Cryptid",
        "appearance": "A nearly invisible bird, faintly outlined against the air, with a hooded crest.",
        "attacks": [
          {
            "name": "Phantom Peck",
            "damage": "2d6 psychic",
            "effect": "On a hit, target must make a DC 13 Wisdom save or be unable to perceive the Hoodwink until it attacks again."
          }
        ]
      }
    ]
  },
  {
    "category": "Bird People",
    "creatures": [
      {
        "name": "Alkonost",
        "origin": "Slavic",
        "appearance": "A beautiful woman’s head and torso with the body of a brightly colored bird. Its voice is enchanting.",
        "attacks": [
          {
            "name": "Melodic Lullaby",
            "damage": "None",
            "effect": "All creatures within 30 feet must make a DC 15 Wisdom save or fall asleep for 1 minute or until they take damage."
          },
          {
            "name": "Taloned Grasp",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must make DC 14 Dexterity save or be grappled (escape DC 14)."
          }
        ]
      },
      {
        "name": "Gumyōchō",
        "origin": "Yōkai",
        "appearance": "A two-headed bird with human-like faces, one on each head, whispering secrets.",
        "attacks": [
          {
            "name": "Twin Screech",
            "damage": "2d8 thunder",
            "effect": "Creatures in a 20-foot cone must make a DC 14 Constitution save or be stunned until the end of the Gumyōchō’s next turn."
          },
          {
            "name": "Doubled Insight",
            "damage": "None",
            "effect": "As a bonus action, the Gumyōchō grants itself advantage on the next attack roll by reading the opponent’s moves with both heads."
          }
        ]
      },
      {
        "name": "Harpy",
        "origin": "Greek",
        "appearance": "A fierce, winged woman with sharp talons and a shrill voice, often accompanied by foul winds.",
        "attacks": [
          {
            "name": "Harpy’s Song",
            "damage": "None",
            "effect": "All humanoids within 30 feet must make a DC 14 Wisdom save or be charmed, moving closer to the Harpy."
          },
          {
            "name": "Rending Talons",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must succeed on DC 13 Strength save or drop one held item."
          }
        ]
      },
      {
        "name": "Horus",
        "origin": "Ancient Egyptian",
        "appearance": "A deity with a falcon’s head and a human body, radiating divine authority.",
        "attacks": [
          {
            "name": "Solar Gaze",
            "damage": "3d8 radiant",
            "effect": "On a hit, target makes DC 15 Constitution save or be blinded for 1 round."
          },
          {
            "name": "Falcon Strike",
            "damage": "3d6 slashing",
            "effect": "On a hit, Horus may immediately fly up to half its speed without provoking opportunity attacks."
          }
        ]
      },
      {
        "name": "Inmyeonjo",
        "origin": "Korean",
        "appearance": "A crane-like bird with a serene human face, often depicted in ancient murals.",
        "attacks": [
          {
            "name": "Tranquil Call",
            "damage": "None",
            "effect": "Creatures within 20 feet must make DC 14 Wisdom save or be calmed, unwilling to attack for 1 round."
          },
          {
            "name": "Beak Jab",
            "damage": "2d6 piercing",
            "effect": "On a hit, the target’s next attack roll is made at disadvantage as they are unsettled by the strange visage."
          }
        ]
      },
      {
        "name": "Kalavinka",
        "origin": "Buddhist",
        "appearance": "A celestial being with a human head and a bird’s torso and tail, known for its heavenly voice.",
        "attacks": [
          {
            "name": "Heavenly Choir",
            "damage": "2d10 psychic",
            "effect": "All creatures in a 30-foot radius must succeed on DC 15 Wisdom save or be incapacitated by blissful visions for 1 round."
          },
          {
            "name": "Soothing Wing",
            "damage": "None",
            "effect": "Heals an ally within 10 feet for 3d6 hit points as feathers glow with healing light."
          }
        ]
      },
      {
        "name": "Karura",
        "origin": "Japanese",
        "appearance": "A divine creature with a human torso and an eagle’s head, often wreathed in fire.",
        "attacks": [
          {
            "name": "Flame Gust",
            "damage": "3d8 fire",
            "effect": "A 15-foot cone of fire. Targets must make DC 14 Dexterity save or catch fire, taking 1d6 fire damage at start of their turns until extinguished."
          },
          {
            "name": "Skyborne Dive",
            "damage": "3d6 slashing",
            "effect": "Karura swoops down. On a hit, target must make DC 15 Strength save or be knocked prone."
          }
        ]
      },
      {
        "name": "Kinnara",
        "origin": "Buddhist",
        "appearance": "Half-bird, half-human celestial musicians with gentle features and lute-like instruments.",
        "attacks": [
          {
            "name": "Harmonic Strike",
            "damage": "2d8 thunder",
            "effect": "On a hit, target must make DC 14 Wisdom save or have disadvantage on attack rolls until the end of its next turn due to disorienting harmony."
          },
          {
            "name": "Serenity Chord",
            "damage": "None",
            "effect": "Allies within 30 feet gain advantage on their next saving throw as calming music steadies their minds."
          }
        ]
      },
      {
        "name": "Siren",
        "origin": "Greek",
        "appearance": "Bird-women with enchanting voices, beautiful yet deadly, often perched on crags near the sea.",
        "attacks": [
          {
            "name": "Enthralling Song",
            "damage": "None",
            "effect": "Each humanoid within 60 feet must make DC 15 Wisdom save or be charmed, moving closer to the Siren each turn."
          },
          {
            "name": "Razor Claws",
            "damage": "3d6 slashing",
            "effect": "On a hit, if the target is charmed, the Siren deals an additional 1d6 psychic damage."
          }
        ]
      },
      {
        "name": "Swan Maiden",
        "origin": "Multicultural",
        "appearance": "A woman who can don a swan skin to become a graceful white swan.",
        "attacks": [
          {
            "name": "Wing Buffet",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must make DC 13 Dexterity save or be knocked prone."
          },
          {
            "name": "Lunar Grace",
            "damage": "None",
            "effect": "Swan Maiden may cast a minor healing spell (2d8+2 HP) on herself or an ally once per short rest."
          }
        ]
      }
    ]
  },
  {
    "category": "Other Notable Birds",
    "creatures": [
      {
        "name": "Caladrius",
        "origin": "Roman",
        "appearance": "A pure white bird said to cure diseases by drawing them into itself.",
        "attacks": [
          {
            "name": "Purifying Gaze",
            "damage": "None",
            "effect": "One creature within 30 feet is cured of one disease or poisoned condition. Caladrius takes 2d6 necrotic damage as it absorbs the malady."
          },
          {
            "name": "Beak Peck",
            "damage": "2d6 piercing",
            "effect": "On a hit, the target must make DC 12 Constitution save or be stunned for one round, surprised by the sudden assault."
          }
        ]
      },
      {
        "name": "Chalkydri",
        "origin": "Jewish",
        "appearance": "Heavenly sun-creatures, half-bird, half-angelic, with brightly burning feathers.",
        "attacks": [
          {
            "name": "Solar Flare",
            "damage": "4d6 radiant",
            "effect": "A 20-foot cone of searing light. Targets must make DC 15 Constitution save or be blinded for 1 minute (repeat save end of turn)."
          },
          {
            "name": "Healing Hymn",
            "damage": "None",
            "effect": "All allies within 30 feet regain 2d8 hit points and gain advantage on their next saving throw."
          }
        ]
      },
      {
        "name": "Chamrosh",
        "origin": "Persian",
        "appearance": "A creature with the body of a dog and the head and wings of a bird, guardian of the mountain of all birds.",
        "attacks": [
          {
            "name": "Aerial Pounce",
            "damage": "3d6 slashing",
            "effect": "Chamrosh leaps from above. On a hit, target must make DC 14 Strength save or be knocked prone."
          },
          {
            "name": "Guardian’s Cry",
            "damage": "None",
            "effect": "All allied birds in 30 feet gain +2 to AC and saving throws for the next round."
          }
        ]
      },
      {
        "name": "Cinnamon Bird",
        "origin": "Greek",
        "appearance": "A rare, fragrant bird that builds nests from cinnamon sticks, smelling sweet and spiced.",
        "attacks": [
          {
            "name": "Spice Gust",
            "damage": "2d6 fire + 2d6 poison",
            "effect": "A 15-foot cone of cinnamon dust. Targets must make DC 14 Constitution save or cough uncontrollably, losing their reaction until next turn."
          },
          {
            "name": "Nest Barrage",
            "damage": "3d4 bludgeoning",
            "effect": "Flings cinnamon sticks at a target. On a hit, target has disadvantage on Wisdom (Perception) checks due to stinging eyes and nose."
          }
        ]
      },
      {
        "name": "Devil Bird",
        "origin": "Sri Lankan",
        "appearance": "A dark, owl-like bird with glowing red eyes and a piercing, human-like scream.",
        "attacks": [
          {
            "name": "Death Omen Shriek",
            "damage": "3d8 psychic",
            "effect": "All creatures within 30 feet must make DC 15 Wisdom save or be frightened for 1 minute."
          },
          {
            "name": "Taloned Rake",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must make DC 14 Constitution save or be stunned until the start of the Devil Bird’s next turn."
          }
        ]
      },
      {
        "name": "Gagana",
        "origin": "Russian",
        "appearance": "A miraculous bird with an iron beak and copper claws, rumored to dwell in distant lands.",
        "attacks": [
          {
            "name": "Iron Peck",
            "damage": "3d8 piercing",
            "effect": "On a hit, target’s armor takes a permanent -1 to AC if it’s made of metal, as the iron beak dents it."
          },
          {
            "name": "Copper Claw Rend",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must make DC 14 Strength save or be grappled, taking 1d6 slashing at the start of each turn while grappled."
          }
        ]
      },
      {
        "name": "Gandabherunda",
        "origin": "Hindu",
        "appearance": "A monstrous two-headed bird of immense size, associated with thunder and protection.",
        "attacks": [
          {
            "name": "Double-Beak Strike",
            "damage": "4d6 piercing",
            "effect": "Roll to hit twice against the same target (one for each head). If both hits land, target is knocked prone."
          },
          {
            "name": "Thunder Wing",
            "damage": "3d8 thunder",
            "effect": "Beating its wings, it creates a shockwave. All creatures in 20 feet must make DC 16 Constitution save or be stunned until end of their next turn."
          }
        ]
      },
      {
        "name": "Gamayun",
        "origin": "Slavic",
        "appearance": "A prophetic bird with a woman’s head, bringing knowledge and warnings.",
        "attacks": [
          {
            "name": "Voice of Fate",
            "damage": "None",
            "effect": "One creature within 30 feet must make DC 15 Wisdom save or be compelled to speak a secret they know aloud."
          },
          {
            "name": "Foresight Peck",
            "damage": "2d6 piercing",
            "effect": "On a hit, Gamayun predicts the target’s next move. The target has disadvantage on its next attack roll."
          }
        ]
      },
      {
        "name": "Garuda",
        "origin": "Hindu",
        "appearance": "A colossal eagle-like being, often depicted as the mount of Vishnu, radiant and swift.",
        "attacks": [
          {
            "name": "Divine Talons",
            "damage": "4d8 radiant",
            "effect": "On a hit, target must make DC 16 Wisdom save or be blinded by the holy light for 1 round."
          },
          {
            "name": "Gale Wing",
            "damage": "3d6 bludgeoning",
            "effect": "Garuda creates a powerful gust. All creatures in 20 feet make DC 15 Strength save or be pushed 15 feet away."
          }
        ]
      },
      {
        "name": "Hakawai",
        "origin": "Māori",
        "appearance": "A nocturnal, elusive bird rarely seen, known more by its eerie calls.",
        "attacks": [
          {
            "name": "Echoing Cry",
            "damage": "2d8 psychic",
            "effect": "Targets in a 30-foot radius make DC 14 Wisdom save or have disadvantage on Perception checks for 1 minute."
          },
          {
            "name": "Silent Talon",
            "damage": "2d6 slashing",
            "effect": "On a hit, target must make DC 12 Wisdom save or be surprised (no reactions) until end of its next turn."
          }
        ]
      },
      {
        "name": "Hudhud",
        "origin": "Islamic",
        "appearance": "A hoopoe bird with a distinctive crown of feathers, known for carrying messages to prophets.",
        "attacks": [
          {
            "name": "Message of Truth",
            "damage": "None",
            "effect": "Forces one target within 30 feet to make DC 14 Wisdom save or be compelled to tell the truth for 1 minute."
          },
          {
            "name": "Beak Strike",
            "damage": "2d4 piercing",
            "effect": "On a hit, target must succeed on DC 13 Dexterity save or drop a held object."
          }
        ]
      },
      {
        "name": "Huginn and Muninn",
        "origin": "Norse",
        "appearance": "Two ravens perched together, one representing thought and the other memory.",
        "attacks": [
          {
            "name": "Thought’s Peck (Huginn)",
            "damage": "2d6 psychic",
            "effect": "On a hit, target must make DC 14 Intelligence save or lose its next reaction as its mind is muddled."
          },
          {
            "name": "Memory’s Claw (Muninn)",
            "damage": "2d6 psychic",
            "effect": "On a hit, target must succeed on DC 14 Wisdom save or forget one prepared spell (or one known ability) until its next rest."
          }
        ]
      },
      {
        "name": "Itsumade",
        "origin": "Japanese",
        "appearance": "A monstrous bird with a human face and snake-like neck, often seen at night over disaster areas.",
        "attacks": [
          {
            "name": "Wailing Cry",
            "damage": "3d6 necrotic",
            "effect": "All creatures in 20 feet make DC 15 Wisdom save or be frightened for 1 minute."
          },
          {
            "name": "Serpentine Peck",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must make DC 15 Constitution save or take an additional 1d6 poison damage each round for 3 rounds."
          }
        ]
      },
      {
        "name": "Jingwei",
        "origin": "Chinese",
        "appearance": "A small bird determined to fill the sea with twigs and stones, symbol of perseverance.",
        "attacks": [
          {
            "name": "Pebble Rain",
            "damage": "2d4 bludgeoning",
            "effect": "A flurry of small stones. On a hit, target must make DC 12 Strength save or be knocked prone."
          },
          {
            "name": "Stubborn Will",
            "damage": "None",
            "effect": "Jingwei grants itself advantage on its next attack or saving throw as it never gives up."
          }
        ]
      },
      {
        "name": "Lamassu",
        "origin": "Mesopotamian",
        "appearance": "A protective deity with a human head, body of a bull or lion, and eagle’s wings.",
        "attacks": [
          {
            "name": "Guardian’s Aegis",
            "damage": "None",
            "effect": "All allies within 10 feet gain +2 AC for 1 minute."
          },
          {
            "name": "Winged Charge",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target makes DC 15 Strength save or is pushed 10 feet and knocked prone."
          }
        ]
      },
      {
        "name": "Luan",
        "origin": "Chinese",
        "appearance": "A majestic, mythical bird adorned with a shield-like chest plate, trampling snakes underfoot.",
        "attacks": [
          {
            "name": "Shielded Peck",
            "damage": "2d8 piercing",
            "effect": "On a hit, Luan gains +2 to AC until the start of its next turn."
          },
          {
            "name": "Snake Stomp",
            "damage": "2d6 bludgeoning",
            "effect": "If the target is reptilian or serpent-like, the attack deals an extra 2d6 damage."
          }
        ]
      },
      {
        "name": "Minokawa",
        "origin": "Philippine",
        "appearance": "A giant dragon-like bird that can devour the sun or moon, with metallic feathers.",
        "attacks": [
          {
            "name": "Eclipse Bite",
            "damage": "4d8 piercing",
            "effect": "On a hit, target must make DC 16 Constitution save or be blinded for 1 minute."
          },
          {
            "name": "Metallic Wing Slash",
            "damage": "3d8 slashing",
            "effect": "On a hit, target’s armor is rent. If it’s non-magical armor, its AC bonus decreases by 1 (permanently)."
          }
        ]
      },
      {
        "name": "Nachtkrapp",
        "origin": "German folklore",
        "appearance": "A dark, raven-like bird of the night, known to snatch misbehaving children.",
        "attacks": [
          {
            "name": "Childsnare Clutch",
            "damage": "2d8 slashing",
            "effect": "On a hit against a Small or smaller target, DC 14 Strength save or be grappled and carried aloft."
          },
          {
            "name": "Night’s Cry",
            "damage": "2d6 psychic",
            "effect": "All creatures in a 10-foot radius must make DC 13 Wisdom save or be frightened until end of their next turn."
          }
        ]
      },
      {
        "name": "Nine-headed Bird",
        "origin": "Chinese",
        "appearance": "A totemic bird with nine heads, each shrieking in discordant harmony.",
        "attacks": [
          {
            "name": "Ninefold Screech",
            "damage": "4d6 thunder",
            "effect": "Targets in a 20-foot radius must make DC 15 Constitution save or be stunned until the end of their next turn."
          },
          {
            "name": "Multi-Peck",
            "damage": "3d8 piercing",
            "effect": "Roll 1d10; on a roll of 9 or 10, an additional head pecks for an extra 1d8 piercing damage."
          }
        ]
      }
    ]
  },
  {
    "category": "Chickens",
    "creatures": [
      {
        "name": "Alectryon",
        "origin": "Greek",
        "appearance": "A rooster transformed from a careless soldier, its feathers bearing subtle hints of armor plating.",
        "attacks": [
          {
            "name": "Dawn Crow",
            "damage": "None",
            "effect": "All enemies within 30 feet must make a DC 13 Wisdom save or be blinded by sudden morning light until the end of their next turn."
          },
          {
            "name": "Spur Strike",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must make a DC 12 Dexterity save or drop one held weapon as they flinch."
          }
        ]
      },
      {
        "name": "Basan",
        "origin": "Japanese",
        "appearance": "A fire-breathing chicken with brilliantly colored plumage and glowing eyes.",
        "attacks": [
          {
            "name": "Ember Breath",
            "damage": "2d8 fire",
            "effect": "A 15-foot cone of embers. Targets must make DC 14 Dexterity save or catch fire, taking 1d6 fire damage each turn until extinguished."
          },
          {
            "name": "Fiery Peck",
            "damage": "2d6 fire",
            "effect": "On a hit, target must make a DC 13 Constitution save or have disadvantage on attack rolls until the start of Basan’s next turn due to searing pain."
          }
        ]
      },
      {
        "name": "Cockatrice",
        "origin": "European folklore",
        "appearance": "A small draconic creature with the head of a rooster and the body of a serpent-like dragon.",
        "attacks": [
          {
            "name": "Petrifying Gaze",
            "damage": "None",
            "effect": "One target within 30 feet must make DC 14 Constitution save or begin turning to stone, restrained for 1 round. A failed save on the next turn fully petrifies the target."
          },
          {
            "name": "Venom Peck",
            "damage": "2d8 poison",
            "effect": "On a hit, target must make DC 13 Constitution save or be poisoned for 1 minute."
          }
        ]
      },
      {
        "name": "Gallic Rooster",
        "origin": "Symbolic (France)",
        "appearance": "A proud rooster with red, white, and blue plumage and a regal bearing.",
        "attacks": [
          {
            "name": "Patriotic Cry",
            "damage": "None",
            "effect": "All allies within 20 feet gain +1 to attack rolls and saving throws for 1 minute."
          },
          {
            "name": "Beak Jab",
            "damage": "2d4 piercing",
            "effect": "On a hit, target must succeed on DC 12 Wisdom save or lose their reaction until the end of their next turn."
          }
        ]
      },
      {
        "name": "Gullinkambi",
        "origin": "Norse",
        "appearance": "A bright red rooster perched in Valhalla, herald of cosmic events.",
        "attacks": [
          {
            "name": "Ragnarok Crow",
            "damage": "3d8 thunder",
            "effect": "All creatures within 30 feet must make DC 15 Constitution save or be deafened for 1 minute."
          },
          {
            "name": "Valiant Peck",
            "damage": "2d6 radiant",
            "effect": "On a hit, if the target is evil-aligned (GM’s discretion), Gullinkambi deals an extra 1d6 radiant damage."
          }
        ]
      },
      {
        "name": "Rooster of Barcelos",
        "origin": "Portuguese",
        "appearance": "A carved rooster statue brought to life, brightly painted and carrying a hint of divine justice.",
        "attacks": [
          {
            "name": "Innocence Call",
            "damage": "None",
            "effect": "Forces one creature within 30 feet to make DC 14 Charisma save or reveal one of its crimes or misdeeds aloud."
          },
          {
            "name": "Stony Peck",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, the target is partially petrified, reducing its movement by half until the end of its next turn."
          }
        ]
      },
      {
        "name": "Sarimanok",
        "origin": "Maranao (Philippines)",
        "appearance": "A legendary chicken with colorful, ornate plumage and decorative streamers, symbol of fortune.",
        "attacks": [
          {
            "name": "Fortune’s Wing",
            "damage": "None",
            "effect": "One ally within 30 feet gains advantage on its next attack or saving throw as luck swirls around them."
          },
          {
            "name": "Decorative Peck",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must make DC 13 Intelligence save or be distracted by the vivid colors, granting the Sarimanok advantage on its next attack."
          }
        ]
      },
      {
        "name": "Víðópnir",
        "origin": "Norse",
        "appearance": "A rooster perched atop Yggdrasil, shining like gold, spreading knowledge of the nine worlds.",
        "attacks": [
          {
            "name": "World-Tree Cry",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 15 Wisdom save or be overcome by cosmic insight, stunned for 1 round."
          },
          {
            "name": "Golden Spur",
            "damage": "3d6 radiant",
            "effect": "On a hit, target is outlined in golden light, granting advantage to all attacks against it until the end of Víðópnir’s next turn."
          }
        ]
      }
    ]
  },
  {
    "category": "Eagles",
    "creatures": [
      {
        "name": "Aethon",
        "origin": "Greek",
        "appearance": "An eagle that torments Prometheus, massive, with fiery eyes and iron-like talons.",
        "attacks": [
          {
            "name": "Liver Rend",
            "damage": "3d8 slashing + 2d6 necrotic",
            "effect": "On a hit, target must make DC 15 Constitution save or be weakened, dealing -1d4 less damage on its attacks for 1 minute."
          },
          {
            "name": "Beak of Eternity",
            "damage": "4d6 piercing",
            "effect": "If the target is immortal or has any regeneration, they lose that feature for 1 round as the eagle’s bite disrupts their essence."
          }
        ]
      },
      {
        "name": "Griffin",
        "origin": "Greek",
        "appearance": "A majestic hybrid with the body of a lion and the head and wings of an eagle.",
        "attacks": [
          {
            "name": "Pouncing Claws",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must succeed on DC 14 Strength save or be knocked prone."
          },
          {
            "name": "Beak Tear",
            "damage": "3d8 piercing",
            "effect": "On a hit, if the target is prone, deal an extra 1d8 damage."
          }
        ]
      },
      {
        "name": "Hippogriff",
        "origin": "French/English",
        "appearance": "Front half of an eagle, hind half of a horse, noble and swift.",
        "attacks": [
          {
            "name": "Aerial Strike",
            "damage": "2d8 slashing",
            "effect": "Hippogriff can swoop down from flight. If it moves at least 20 feet straight toward the target, deal an extra 1d8 damage."
          },
          {
            "name": "Beak Snap",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must make DC 12 Strength save or drop one held item."
          }
        ]
      },
      {
        "name": "Hræsvelgr",
        "origin": "Norse",
        "appearance": "A giant eagle-shaped jötunn perched at the end of the world, creating winds with its wings.",
        "attacks": [
          {
            "name": "World-Wind",
            "damage": "4d8 thunder",
            "effect": "All creatures in a 30-foot cone must make DC 16 Strength save or be pushed 20 feet and knocked prone."
          },
          {
            "name": "Beak of the Horizon",
            "damage": "4d6 piercing",
            "effect": "On a hit, target must make DC 15 Wisdom save or be disoriented, losing its next bonus action."
          }
        ]
      },
      {
        "name": "Poukai",
        "origin": "Māori",
        "appearance": "A monstrous predatory bird, large enough to carry off humans, likely based on extinct giant eagles.",
        "attacks": [
          {
            "name": "Raking Talons",
            "damage": "4d6 slashing",
            "effect": "On a hit, if target is Medium or smaller, must make DC 15 Strength save or be grappled."
          },
          {
            "name": "Swooping Snatch",
            "damage": "None",
            "effect": "If grappling a target, Poukai may fly half its speed upward. The target takes falling damage if released mid-air."
          }
        ]
      },
      {
        "name": "Shahbaz",
        "origin": "Persian",
        "appearance": "A noble eagle that guided the ancient Iranian peoples, feathers glinting like steel.",
        "attacks": [
          {
            "name": "Guiding Wing",
            "damage": "2d8 slashing",
            "effect": "On a hit, one ally within 30 feet gains advantage on their next attack as Shahbaz directs their aim."
          },
          {
            "name": "Steel Feather Flurry",
            "damage": "3d6 piercing",
            "effect": "Shahbaz flutters its feathers aggressively. Creatures in a 10-foot radius must make DC 14 Dexterity save or take full damage."
          }
        ]
      },
      {
        "name": "Triple-headed Eagle",
        "origin": "Multi-cultural",
        "appearance": "An eagle with three heads, each with piercing eyes of a different color.",
        "attacks": [
          {
            "name": "Triple Beak Bite",
            "damage": "3d8 piercing",
            "effect": "Roll to hit once; on success, deal damage three times (one for each head)."
          },
          {
            "name": "Tri-scream",
            "damage": "3d6 psychic",
            "effect": "All creatures in 20 feet must make DC 15 Wisdom save or be stunned for 1 round from the overwhelming cacophony."
          }
        ]
      },
      {
        "name": "Wuchowsen",
        "origin": "Abenaki",
        "appearance": "A giant eagle who lives atop a mountain and governs one of the four winds.",
        "attacks": [
          {
            "name": "Wind Gust",
            "damage": "2d8 thunder",
            "effect": "A 15-foot cone of wind. Targets failing a DC 14 Strength save are pushed 10 feet away."
          },
          {
            "name": "Tempest Dive",
            "damage": "3d6 slashing",
            "effect": "On a hit, the target must make DC 13 Dexterity save or be knocked prone as the wind swirls violently."
          }
        ]
      },
      {
        "name": "Ziz",
        "origin": "Jewish",
        "appearance": "A gigantic griffin-like bird that can block out the sun with its wings.",
        "attacks": [
          {
            "name": "Sunshadow Wing",
            "damage": "3d6 necrotic",
            "effect": "A 30-foot radius is darkened. Enemies in the darkness must make DC 15 Wisdom save or suffer disadvantage on all attacks for 1 minute."
          },
          {
            "name": "Titanic Claw",
            "damage": "4d8 slashing",
            "effect": "On a hit, if target is Large or smaller, it must succeed DC 16 Strength save or be grappled. Grappled target takes 1d8 slashing each turn."
          }
        ]
      },
      {
        "name": "Zu",
        "origin": "Mesopotamian",
        "appearance": "A divine lion-headed eagle that guards sacred items.",
        "attacks": [
          {
            "name": "Sacred Shriek",
            "damage": "3d8 radiant",
            "effect": "Creatures in 20 feet must make DC 15 Charisma save or be unable to speak lies for 1 minute."
          },
          {
            "name": "Lion’s Grasp",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must succeed on DC 14 Dexterity save or drop one magical item as Zu tries to seize it."
          }
        ]
      }
    ]
  },
  {
    "category": "Owls",
    "creatures": [
      {
        "name": "Nyctimene",
        "origin": "Roman",
        "appearance": "A woman transformed into an owl by Minerva, plumage dark and eyes glowing faintly.",
        "attacks": [
          {
            "name": "Silent Glide",
            "damage": "None",
            "effect": "Nyctimene becomes invisible until she attacks. Next attack deals +1d6 psychic damage from surprise."
          },
          {
            "name": "Cursed Talons",
            "damage": "2d8 necrotic",
            "effect": "On a hit, target must make DC 14 Wisdom save or have their maximum HP reduced by amount of necrotic damage dealt until next long rest."
          }
        ]
      },
      {
        "name": "Owlman",
        "origin": "English",
        "appearance": "A humanoid owl with large, glowing red eyes and silent wings.",
        "attacks": [
          {
            "name": "Fearsome Gaze",
            "damage": "2d8 psychic",
            "effect": "A target within 30 feet must make DC 15 Wisdom save or be frightened for 1 minute."
          },
          {
            "name": "Razor Talons",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must make DC 14 Dexterity save or lose 10 feet of movement as they struggle with deep cuts."
          }
        ]
      },
      {
        "name": "Sirin",
        "origin": "Slavic",
        "appearance": "A bird with a woman’s head, often resembling an owl, known for luring men to their demise with beautiful songs.",
        "attacks": [
          {
            "name": "Enthralling Hymn",
            "damage": "None",
            "effect": "All humanoids within 60 feet must make DC 15 Wisdom save or become charmed, moving closer to Sirin each turn."
          },
          {
            "name": "Rending Talons",
            "damage": "3d6 slashing",
            "effect": "If the target is charmed, Sirin deals an extra 1d6 psychic damage."
          }
        ]
      },
      {
        "name": "Strix",
        "origin": "Greek",
        "appearance": "A monstrous, vampiric owl that feeds on human flesh and blood.",
        "attacks": [
          {
            "name": "Blood Drain",
            "damage": "3d8 necrotic",
            "effect": "On a hit, target makes DC 15 Constitution save or be drained of 1 Hit Die (or 2d6 extra necrotic if no HD). Strix regains HP equal to half damage dealt."
          },
          {
            "name": "Wing Buffet",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must make DC 13 Strength save or be knocked prone."
          }
        ]
      }
    ]
  },
  {
    "category": "Carnivorans",
    "sub-category": "Bears",
    "creatures": [
      {
        "name": "Bugbear",
        "origin": "Celtic",
        "appearance": "A hulking, goblinoid bear-like creature with coarse fur, long limbs, and a menacing grin.",
        "attacks": [
          {
            "name": "Mauling Claws",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must make DC 14 Strength save or be knocked prone as the Bugbear lunges forward with brute strength."
          },
          {
            "name": "Fearsome Growl",
            "damage": "None",
            "effect": "All creatures within 20 feet must make a DC 14 Wisdom save or be frightened for 1 minute. Creatures can repeat the save at the end of their turns."
          }
        ]
      },
      {
        "name": "Callisto",
        "origin": "Greek",
        "appearance": "A celestial bear, once a nymph, shimmering with starlight in her fur.",
        "attacks": [
          {
            "name": "Celestial Swipe",
            "damage": "3d8 radiant",
            "effect": "On a hit, target must make DC 15 Constitution save or be blinded by a flash of starlight until the end of its next turn."
          },
          {
            "name": "Ursa’s Embrace",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, Callisto grapples the target (escape DC 14). While grappled, target takes 1d8 radiant damage at the start of its turn due to cosmic energy."
          }
        ]
      }
    ]
  },
  {
    "category": "Carnivorans",
    "sub-category": "Canines",
    "creatures": [
      {
        "name": "Adlet",
        "origin": "Inuit",
        "appearance": "A humanoid figure with canine legs and features, often clad in furs, half-dog, half-human.",
        "attacks": [
          {
            "name": "Savage Bite",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must make DC 13 Constitution save or contract a mild curse causing disadvantage on Dexterity checks for 1 hour."
          },
          {
            "name": "Feral Howl",
            "damage": "None",
            "effect": "Allies within 30 feet gain advantage on their next attack roll as the howl emboldens them."
          }
        ]
      },
      {
        "name": "Amarok",
        "origin": "Inuit",
        "appearance": "A giant lone wolf that hunts solitary travelers at night, with thick grey fur and glowing eyes.",
        "attacks": [
          {
            "name": "Midnight Maul",
            "damage": "4d6 slashing",
            "effect": "On a hit, if it is nighttime or in darkness, Amarok deals an extra 1d6 cold damage."
          },
          {
            "name": "Lone Stalker",
            "damage": "None",
            "effect": "If Amarok is the only attacker targeting a single creature, its next attack against that creature has advantage, representing its predatory focus."
          }
        ]
      },
      {
        "name": "Anubis",
        "origin": "Egyptian",
        "appearance": "A deity with the head of a jackal and a human body, wearing regal, ancient attire.",
        "attacks": [
          {
            "name": "Judgment Gaze",
            "damage": "3d8 necrotic",
            "effect": "On a hit, target must make DC 15 Charisma save or be frightened and unable to tell a lie for 1 minute."
          },
          {
            "name": "Embalming Strike",
            "damage": "2d8 necrotic",
            "effect": "On a hit, target must make DC 14 Constitution save or have disadvantage on death saves until the end of Anubis’s next turn."
          }
        ]
      },
      {
        "name": "Aralez",
        "origin": "Armenian",
        "appearance": "A benevolent dog-like spirit with healing saliva and ghostly, shimmering fur.",
        "attacks": [
          {
            "name": "Healing Lick",
            "damage": "None",
            "effect": "Restores 3d8 hit points to an ally or stabilizes a dying creature. If used offensively (very rare), can disorient undead (DC 14 Wis save or undead is stunned 1 round)."
          },
          {
            "name": "Bark of Courage",
            "damage": "None",
            "effect": "All allies within 20 feet gain advantage on saving throws against fear for 1 minute."
          }
        ]
      },
      {
        "name": "Asena",
        "origin": "Turkic",
        "appearance": "A mythical she-wolf with silver fur and piercing yellow eyes, often a progenitor figure.",
        "attacks": [
          {
            "name": "Lunar Bite",
            "damage": "3d6 piercing",
            "effect": "If under moonlight, deals an extra 1d4 radiant damage."
          },
          {
            "name": "Pack Mother’s Cry",
            "damage": "None",
            "effect": "Summons 1d4 wolf spirits who fight alongside Asena for 1 minute."
          }
        ]
      },
      {
        "name": "Axehandle hound",
        "origin": "North American lumberjack folklore",
        "appearance": "A dog-like creature with a stout body shaped like an axe-handle, tough and gnarled.",
        "attacks": [
          {
            "name": "Handle Slam",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, target must make DC 13 Strength save or be knocked prone."
          },
          {
            "name": "Timber Howl",
            "damage": "None",
            "effect": "Creatures within 30 feet must succeed DC 13 Wisdom save or be frightened for 1 round, imagining the crashing of trees."
          }
        ]
      },
      {
        "name": "Black dog (Barghest/Black Shuck)",
        "origin": "British",
        "appearance": "A large, spectral black dog with glowing red eyes, often seen as an omen of death.",
        "attacks": [
          {
            "name": "Spectral Bite",
            "damage": "3d8 necrotic",
            "effect": "On a hit, target must make DC 14 Charisma save or become frightened and lose 5 hit points at the start of each turn for 3 turns as fear drains their life."
          },
          {
            "name": "Harbinger’s Howl",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 15 Wisdom save or be frightened. Those who fail by 5 or more also lose 1 Hit Die permanently (returned after a long rest)."
          }
        ]
      },
      {
        "name": "Beast of Gévaudan",
        "origin": "French",
        "appearance": "A massive wolf-like beast rumored to be impervious to normal weapons, with bristling fur and fiery eyes.",
        "attacks": [
          {
            "name": "Savage Rend",
            "damage": "4d6 slashing",
            "effect": "On a hit, if the weapon used against it in the last turn was non-magical, the Beast takes half damage from that attack (passive trait)."
          },
          {
            "name": "Bloodcurdling Snarl",
            "damage": "None",
            "effect": "All creatures within 15 feet must succeed on DC 15 Wisdom save or lose their reaction and have disadvantage on their next attack due to terror."
          }
        ]
      },
      {
        "name": "Carbuncle (Chilote, small dog form)",
        "origin": "Chilote",
        "appearance": "A small luminescent dog-like creature with a glowing gem embedded in its forehead.",
        "attacks": [
          {
            "name": "Gem Beam",
            "damage": "2d8 radiant",
            "effect": "On a hit, target must make DC 13 Dexterity save or be blinded until the end of their next turn."
          },
          {
            "name": "Enlightening Howl",
            "damage": "None",
            "effect": "Allies within 20 feet gain +1 to attack rolls and saving throws for 1 minute as the radiant energy emboldens them."
          }
        ]
      },
      {
        "name": "Cerberus",
        "origin": "Greek/Roman",
        "appearance": "A giant, three-headed dog guarding the gates of the Underworld, each head snarling independently.",
        "attacks": [
          {
            "name": "Triple Bite",
            "damage": "3d8 piercing",
            "effect": "Roll once to hit; on success, deal 3d8 damage. Target must make DC 15 Strength save or be knocked prone."
          },
          {
            "name": "Underworld Breath",
            "damage": "4d6 necrotic",
            "effect": "A 15-foot cone of miasma. Targets failing DC 15 Constitution save are also frightened for 1 round."
          }
        ]
      },
      {
        "name": "Chupacabra",
        "origin": "Latin American",
        "appearance": "A reptilian or canine creature with spines down its back, known for draining blood from livestock.",
        "attacks": [
          {
            "name": "Blood Drain",
            "damage": "3d6 necrotic",
            "effect": "On a hit, target makes DC 14 Constitution save or lose 1d4 hit points at the start of each of its turns for 3 turns. Chupacabra regains half that amount as temporary HP."
          },
          {
            "name": "Leaping Strike",
            "damage": "2d8 piercing",
            "effect": "If Chupacabra moved at least 20 feet toward the target, target must succeed on DC 14 Strength save or be grappled."
          }
        ]
      },
      {
        "name": "Cu Sith",
        "origin": "Scottish/Irish",
        "appearance": "A large green fairy dog with a long braided tail, harbinger of death.",
        "attacks": [
          {
            "name": "Fey Bite",
            "damage": "3d6 psychic",
            "effect": "On a hit, target must make DC 14 Wisdom save or be charmed by Cu Sith, compelled to follow it for 1 minute."
          },
          {
            "name": "Deathly Bay",
            "damage": "None",
            "effect": "Creatures within 30 feet must make DC 15 Wisdom save or be frightened and lose 1 Hit Die (or take 2d6 necrotic if no Hit Dice) due to the unnatural howl."
          }
        ]
      },
      {
        "name": "Crocotta",
        "origin": "India/Ethiopia (Roman accounts)",
        "appearance": "A dog-wolf hybrid with hyena-like features and the ability to mimic human voices.",
        "attacks": [
          {
            "name": "Mimicry Lure",
            "damage": "None",
            "effect": "Forces a DC 14 Wisdom save. On fail, target approaches Crocotta’s position, losing their reaction as they’re distracted, granting Crocotta advantage on its next attack."
          },
          {
            "name": "Hyena Maw",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must succeed on DC 14 Strength save or drop one held item as the Crocotta’s powerful jaws jostle it."
          }
        ]
      },
      {
        "name": "Cynocephaly",
        "origin": "Various",
        "appearance": "A humanoid figure with the head of a dog or jackal, often tribal and warlike.",
        "attacks": [
          {
            "name": "Spear Thrust",
            "damage": "2d8 piercing",
            "effect": "On a hit, target must make DC 13 Dexterity save or be disarmed of a shield if they carry one."
          },
          {
            "name": "Howling Rally",
            "damage": "None",
            "effect": "All Cynocephali allies within 30 feet gain advantage on their next attack roll."
          }
        ]
      },
      {
        "name": "Dogs of Actaeon",
        "origin": "Greek",
        "appearance": "A pack of hunting dogs that turned against their master, swift and relentless.",
        "attacks": [
          {
            "name": "Pack Tactics",
            "damage": "Varies",
            "effect": "If two or more Dogs of Actaeon are adjacent to the same target, each gains advantage on attack rolls against that target."
          },
          {
            "name": "Hamstring Bite",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must succeed DC 13 Strength save or have movement halved for 1 minute."
          }
        ]
      },
      {
        "name": "Fenrir",
        "origin": "Norse",
        "appearance": "A colossal wolf destined to devour gods, with massive jaws and chains dangling from its limbs.",
        "attacks": [
          {
            "name": "World-Fang Bite",
            "damage": "6d8 piercing",
            "effect": "On a hit, target must make DC 18 Strength save or be swallowed whole. While swallowed, target is blinded, restrained, and takes 3d8 acid damage at start of Fenrir’s turns."
          },
          {
            "name": "Shacklesnap",
            "damage": "4d6 force",
            "effect": "Fenrir snaps its chains, creating a shockwave. All creatures in 20 feet must make DC 16 Dexterity save or be knocked prone."
          }
        ]
      },
      {
        "name": "Gelert",
        "origin": "Welsh",
        "appearance": "A loyal hound spirit known for its protective nature, glowing faintly in moonlight.",
        "attacks": [
          {
            "name": "Guardian’s Bite",
            "damage": "3d6 radiant",
            "effect": "On a hit, Gelert may choose one ally within 5 feet of the target. That ally gains 2d6 temporary HP."
          },
          {
            "name": "Loyal Bark",
            "damage": "None",
            "effect": "Allies within 20 feet have advantage on saving throws against fear and charm for 1 minute."
          }
        ]
      },
      {
        "name": "Hellhound",
        "origin": "Worldwide",
        "appearance": "A large black hound with glowing red eyes, smoke curling from its nostrils.",
        "attacks": [
          {
            "name": "Infernal Breath",
            "damage": "4d6 fire",
            "effect": "A 15-foot cone of flames. Targets must make DC 14 Dexterity save or catch fire, taking 1d6 fire damage at start of their turn."
          },
          {
            "name": "Fiery Bite",
            "damage": "3d6 fire",
            "effect": "On a hit, target must make DC 14 Wisdom save or be frightened for 1 round."
          }
        ]
      },
      {
        "name": "Huli jing / Kitsune / Kumiho",
        "origin": "Chinese/Japanese/Korean",
        "appearance": "A fox spirit with multiple tails, cunning eyes, often in human guise.",
        "attacks": [
          {
            "name": "Illusory Glamour",
            "damage": "None",
            "effect": "Forces a DC 15 Wisdom save. On fail, target is charmed and sees the fox spirit as a trusted friend for 1 minute."
          },
          {
            "name": "Foxfire Bolt",
            "damage": "3d6 fire",
            "effect": "On a hit, target must make DC 14 Intelligence save or have disadvantage on their next spell attack or saving throw against spells."
          }
        ]
      },
      {
        "name": "Huodou",
        "origin": "Chinese",
        "appearance": "A large black dog that can breathe fire, with eyes that glow like embers.",
        "attacks": [
          {
            "name": "Flame Maw",
            "damage": "3d6 fire",
            "effect": "On a hit, target must succeed DC 13 Constitution save or be burned, taking 1d6 fire damage at the start of their turn for 3 turns."
          },
          {
            "name": "Cinder Bark",
            "damage": "None",
            "effect": "Creates a 10-foot radius of smoke. All creatures inside must make DC 13 Constitution save or be blinded until they exit the smoke."
          }
        ]
      },
      {
        "name": "Kludde",
        "origin": "Belgium",
        "appearance": "A demonic canine with bat wings, a bird’s beak, and bear claws, eyes glowing, swift and cunning.",
        "attacks": [
          {
            "name": "Multi-Claw Rend",
            "damage": "4d6 slashing",
            "effect": "On a hit, target must make DC 15 Dexterity save or lose its next reaction due to the vicious assault."
          },
          {
            "name": "Shapeshift Terror",
            "damage": "None",
            "effect": "Kludde changes shape (wolf, bat, bird), forcing a DC 14 Wisdom save from witnesses. On fail, they are frightened for 1 round."
          }
        ]
      },
      {
        "name": "Orthrus",
        "origin": "Greek",
        "appearance": "A two-headed dog, sibling of Cerberus, fierce and vigilant.",
        "attacks": [
          {
            "name": "Double Bite",
            "damage": "3d8 piercing",
            "effect": "If both heads hit the same target, target must succeed on DC 14 Strength save or be grappled."
          },
          {
            "name": "Guarding Snarl",
            "damage": "None",
            "effect": "Until Orthrus’s next turn, attacks against Orthrus have disadvantage, as it weaves its two heads menacingly."
          }
        ]
      },
      {
        "name": "Penghou",
        "origin": "Chinese",
        "appearance": "A tree spirit resembling a black dog formed from a tree’s essence, wood-like fur and sappy breath.",
        "attacks": [
          {
            "name": "Sappy Bite",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, target must make DC 13 Strength save or be restrained by sticky sap. Escape DC 13 Strength."
          },
          {
            "name": "Bark Shield",
            "damage": "None",
            "effect": "Penghou hardens its bark-like fur, gaining +2 AC until the start of its next turn."
          }
        ]
      },
      {
        "name": "Psoglav",
        "origin": "Bosnian",
        "appearance": "A humanoid creature with a dog’s head, a single eye, and iron teeth, standing on horse’s legs.",
        "attacks": [
          {
            "name": "Iron Bite",
            "damage": "3d8 piercing",
            "effect": "On a hit, target makes DC 14 Constitution save or take an additional 1d6 necrotic damage as the iron corrodes their flesh."
          },
          {
            "name": "Cyclopean Glare",
            "damage": "2d6 psychic",
            "effect": "One creature within 30 feet must make DC 14 Wisdom save or be stunned until the end of Psoglav’s next turn."
          }
        ]
      },
      {
        "name": "Salawa",
        "origin": "Egyptian (Typhonian)",
        "appearance": "A slender, jackal-like animal associated with the god Set, with elongated limbs and a narrow head.",
        "attacks": [
          {
            "name": "Typhon’s Bite",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must succeed DC 14 Wisdom save or have disadvantage on Perception checks for 1 minute due to the unsettling aura."
          },
          {
            "name": "Desert Mirage",
            "damage": "None",
            "effect": "Creates illusory duplicates (as per Mirror Image spell) of itself for 1 minute."
          }
        ]
      },
      {
        "name": "Sigbin",
        "origin": "Philippines",
        "appearance": "A strange dog-like creature with a goat-like head, walking backwards, sucking blood from victims.",
        "attacks": [
          {
            "name": "Backwards Kick",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, target must make DC 13 Dexterity save or be knocked prone."
          },
          {
            "name": "Blood Siphon",
            "damage": "3d6 necrotic",
            "effect": "On a hit, target must make DC 14 Constitution save or lose 1d4 hit points at the start of each turn (for 3 turns), Sigbin regains half as temporary HP."
          }
        ]
      },
      {
        "name": "Sky Fox",
        "origin": "Chinese",
        "appearance": "A celestial nine-tailed fox with golden fur, revered for wisdom and longevity.",
        "attacks": [
          {
            "name": "Celestial Flame",
            "damage": "3d8 fire",
            "effect": "On a hit, target must make DC 15 Intelligence save or be unable to cast spells above cantrip level for 1 round, as mystical flames disrupt thought."
          },
          {
            "name": "Wisdom’s Gaze",
            "damage": "None",
            "effect": "Sky Fox grants an ally advantage on all Intelligence and Wisdom checks for 1 minute."
          }
        ]
      },
      {
        "name": "Shug Monkey",
        "origin": "Britain",
        "appearance": "A dog-monkey hybrid with mischievous eyes, black fur, and a prehensile tail.",
        "attacks": [
          {
            "name": "Grasping Tail",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must make DC 13 Strength save or be grappled. While grappled, Shug Monkey can’t use its tail on another target."
          },
          {
            "name": "Mocking Chatter",
            "damage": "None",
            "effect": "Forces DC 14 Charisma save. On fail, target has disadvantage on attack rolls until the start of its next turn due to distraction."
          }
        ]
      },
      {
        "name": "Tanuki",
        "origin": "Japanese",
        "appearance": "A Japanese raccoon dog known for shape-changing, trickery, and a jovial demeanor.",
        "attacks": [
          {
            "name": "Illusory Form",
            "damage": "None",
            "effect": "Tanuki assumes the appearance of a humanoid or beast. Creatures must make DC 14 Intelligence save or believe the illusion and have disadvantage on attacks against the Tanuki for 1 minute."
          },
          {
            "name": "Sake Smash",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, target must make DC 13 Strength save or drop one carried object as Tanuki bashes them with a sake bottle."
          }
        ]
      },
      {
        "name": "Tulikettu (Firefox)",
        "origin": "Finnish",
        "appearance": "A fox with flaming fur, whose capture is said to bring great fortune.",
        "attacks": [
          {
            "name": "Flame Dash",
            "damage": "2d6 fire",
            "effect": "Tulikettu moves through a creature’s space. That creature must make DC 13 Dexterity save or catch fire (1d6 fire damage per turn until extinguished)."
          },
          {
            "name": "Aurora Pounce",
            "damage": "3d6 radiant",
            "effect": "On a hit, target must succeed on DC 14 Charisma save or be enchanted by the foxfire’s glow, granting Tulikettu advantage on attacks against it for 1 round."
          }
        ]
      },
      {
        "name": "Vǎrkolak (Vukodlak)",
        "origin": "Slavic",
        "appearance": "An undead vampire werewolf, gaunt and slavering, patches of fur missing, eyes glowing unnaturally.",
        "attacks": [
          {
            "name": "Infected Claw",
            "damage": "3d6 slashing + 2d4 necrotic",
            "effect": "On a hit, DC 15 Constitution save or contract lycanthropy (GM’s discretion)."
          },
          {
            "name": "Hungering Howl",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 14 Wisdom save or be frightened for 1 minute. If a creature fails by 5 or more, it is also cursed to lose 1 HD until cured by magic."
          }
        ]
      },
      {
        "name": "Werewolf",
        "origin": "Worldwide",
        "appearance": "A humanoid wolf, standing upright, ferocious and strong, cursed to transform by the full moon.",
        "attacks": [
          {
            "name": "Claw Swipe",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must make DC 13 Constitution save or be cursed with werewolf lycanthropy (if setting allows)."
          },
          {
            "name": "Bestial Leap",
            "damage": "None",
            "effect": "Werewolf leaps up to 20 feet. If it lands adjacent to a foe, it makes one free Bite attack at advantage."
          }
        ]
      }
    ]
  },
  {
    "category": "Carnivorans",
    "sub-category": "Felines",
    "creatures": [
      {
        "name": "Bael",
        "origin": "Demonology",
        "appearance": "A demon king depicted with three heads: a man, a toad, and a cat. The cat’s head is often snarling.",
        "attacks": [
          {
            "name": "Triple-Voiced Command",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 15 Wisdom save or become charmed for 1 minute, hearing conflicting whispers from three heads."
          },
          {
            "name": "Cat’s Claw",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must succeed on DC 14 Wisdom save or be cursed with mild paranoia (disadvantage on Insight checks) for 1 hour."
          }
        ]
      },
      {
        "name": "Ball-tailed Cat",
        "origin": "North American folklore",
        "appearance": "A cougar-like feline with a spiked ball at the end of its tail used like a mace.",
        "attacks": [
          {
            "name": "Tail Smash",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target must make DC 14 Strength save or be knocked prone."
          },
          {
            "name": "Spiked Whip",
            "damage": "2d8 piercing",
            "effect": "If it hits the same target twice in the same turn, that target bleeds (1d4 damage at start of each turn until healed)."
          }
        ]
      },
      {
        "name": "Cactus Cat",
        "origin": "North American folklore",
        "appearance": "A bobcat-like feline with thorny fur and sharp bone spurs on its front legs. Sometimes said to become intoxicated by cactus sap.",
        "attacks": [
          {
            "name": "Spine Rake",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must make DC 13 Constitution save or suffer 1d4 poison damage for 3 rounds due to cactus sap on spines."
          },
          {
            "name": "Thorny Cry",
            "damage": "None",
            "effect": "A shriek that forces DC 13 Wisdom save. On fail, target is distracted, granting the Cactus Cat advantage on its next attack against them."
          }
        ]
      },
      {
        "name": "Canaima",
        "origin": "Mexico (related concept)",
        "appearance": "A were-jaguar or shapechanger. A humanoid jaguar form with rippling muscles and a predatory glare.",
        "attacks": [
          {
            "name": "Jaguar Strike",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must make DC 14 Dexterity save or be knocked prone."
          },
          {
            "name": "Predator’s Pounce",
            "damage": "None",
            "effect": "Canaima leaps up to 20 feet as a bonus action. Its next melee attack this turn has advantage."
          }
        ]
      },
      {
        "name": "Cat-sìth",
        "origin": "Celtic",
        "appearance": "A large black cat with a white spot on its chest, said to steal souls from the newly dead.",
        "attacks": [
          {
            "name": "Soul Steal",
            "damage": "3d8 necrotic",
            "effect": "On a hit, if target is at 0 HP, it cannot be stabilized by normal means for 1 minute. If target is conscious, they must make DC 15 Charisma save or be frightened for 1 round."
          },
          {
            "name": "Shadow Prowl",
            "damage": "None",
            "effect": "Cat-sìth becomes invisible in dim light or darkness until it attacks. Its first attack out of invisibility deals +1d6 damage."
          }
        ]
      },
      {
        "name": "Cath Palug",
        "origin": "Welsh",
        "appearance": "A monstrous cat so large and fierce it was said to kill many warriors, fur dark and matted.",
        "attacks": [
          {
            "name": "Mighty Pounce",
            "damage": "4d6 slashing",
            "effect": "On a hit, target must make DC 15 Strength save or be grappled. While grappled, Cath Palug’s bite attacks against the target have advantage."
          },
          {
            "name": "Fearsome Yowl",
            "damage": "None",
            "effect": "All creatures within 30 feet make DC 15 Wisdom save or be frightened for 1 minute. Save ends at end of their turn."
          }
        ]
      },
      {
        "name": "Carbuncle (cat form)",
        "origin": "Chilote",
        "appearance": "A cat with a glowing gemstone on its chin, luminescent fur, and eerie greenish-red light.",
        "attacks": [
          {
            "name": "Gem Flash",
            "damage": "2d8 radiant",
            "effect": "On a hit, target must make DC 13 Wisdom save or be blinded until end of their next turn."
          },
          {
            "name": "Enigma Purr",
            "damage": "None",
            "effect": "All creatures within 15 feet must make DC 14 Wisdom save or have disadvantage on their next attack due to sudden confusion."
          }
        ]
      },
      {
        "name": "Demon Cat",
        "origin": "North American (Washington D.C. folklore)",
        "appearance": "A spectral cat that appears larger than normal, eyes glowing red, often an omen of doom.",
        "attacks": [
          {
            "name": "Ethereal Claw",
            "damage": "3d6 necrotic",
            "effect": "On a hit, target must make DC 14 Wisdom save or be frightened for 1 minute."
          },
          {
            "name": "Ominous Hiss",
            "damage": "None",
            "effect": "All creatures within 20 feet must succeed DC 14 Charisma save or have disadvantage on saving throws until the end of Demon Cat’s next turn."
          }
        ]
      },
      {
        "name": "Kaibyō (Cat Yōkai)",
        "origin": "Japanese",
        "appearance": "Any of various supernatural cats, often with split tails or eerie fires, cunning and mystical.",
        "attacks": [
          {
            "name": "Phantom Swipe",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must make DC 13 Wisdom save or see illusory duplicates of Kaibyō, imposing disadvantage on the target’s next attack."
          },
          {
            "name": "Will-o’-Whisker",
            "damage": "2d6 fire",
            "effect": "A ghostly flame dances at the end of Kaibyō’s whiskers. On a hit, target takes ongoing 1d6 fire damage (DC 13 Dexterity to extinguish)."
          }
        ]
      },
      {
        "name": "Bakeneko",
        "origin": "Japanese",
        "appearance": "A cat Yōkai that can walk on hind legs, speak human language, and sometimes have two tails.",
        "attacks": [
          {
            "name": "Cursed Bite",
            "damage": "3d6 necrotic",
            "effect": "On a hit, target must make DC 14 Charisma save or be cursed, losing 1d4 from all saving throws until a short rest."
          },
          {
            "name": "Illusionary Disguise",
            "damage": "None",
            "effect": "Bakeneko assumes the form of a humanoid. DC 15 Intelligence (Investigation) to see through. While disguised, its next attack deals +1d6 psychic damage."
          }
        ]
      },
      {
        "name": "Kasha",
        "origin": "Japanese",
        "appearance": "A cat-like demon that steals corpses, often wreathed in hellish flames.",
        "attacks": [
          {
            "name": "Corpse Claw",
            "damage": "3d6 slashing",
            "effect": "On a hit against a dead or unconscious creature, Kasha can drag them away at half speed. If it holds a corpse, Kasha gains +2 AC from fearsome display."
          },
          {
            "name": "Hellfire Swipe",
            "damage": "3d8 fire",
            "effect": "On a hit, target must make DC 15 Dexterity save or catch fire (1d6 fire damage per round until extinguished)."
          }
        ]
      },
      {
        "name": "Nekomata",
        "origin": "Japanese",
        "appearance": "A two-tailed cat Yōkai, often old and wise, capable of necromancy and manipulating the dead.",
        "attacks": [
          {
            "name": "Necro Tail Lash",
            "damage": "2d8 necrotic",
            "effect": "On a hit, target must succeed DC 14 Constitution save or lose one death saving throw if at 0 HP, or take an additional 2d6 necrotic if conscious."
          },
          {
            "name": "Raise Corpse",
            "damage": "None",
            "effect": "Nekomata animates one nearby corpse as a zombie under its control for 1 minute."
          }
        ]
      },
      {
        "name": "Nue",
        "origin": "Japanese",
        "appearance": "A chimera with a monkey’s face, a tanuki’s body, a tiger’s limbs, and a serpent tail. Often considered feline due to the tiger part.",
        "attacks": [
          {
            "name": "Chimeric Strike",
            "damage": "4d6 slashing",
            "effect": "On a hit, roll 1d4: (1) Monkey Face: target charmed; (2) Tanuki Body: target confused; (3) Tiger Claws: extra 1d6 damage; (4) Snake Tail: poison (DC 15 Con)."
          },
          {
            "name": "Nightmare Mist",
            "damage": "2d8 psychic",
            "effect": "A 20-foot cloud. Targets inside make DC 15 Wisdom save or suffer disadvantage on all attacks until they leave the cloud."
          }
        ]
      },
      {
        "name": "Panther",
        "origin": "Worldwide folklore",
        "appearance": "A sleek black feline, sometimes mythical, larger and more cunning than normal panthers.",
        "attacks": [
          {
            "name": "Ambush Leap",
            "damage": "3d6 slashing",
            "effect": "If Panther attacked from stealth, target must make DC 13 Wisdom save or be frightened for 1 round."
          },
          {
            "name": "Terrifying Roar",
            "damage": "None",
            "effect": "All enemies within 20 feet make DC 14 Wisdom save or have disadvantage on their next attack roll."
          }
        ]
      },
      {
        "name": "Pard",
        "origin": "Medieval bestiaries",
        "appearance": "A swift, spotted cat-like creature known for incredible speed and a venomous bite.",
        "attacks": [
          {
            "name": "Venom Bite",
            "damage": "3d6 poison",
            "effect": "On a hit, target must make DC 14 Constitution save or be poisoned for 1 minute."
          },
          {
            "name": "Blurred Sprint",
            "damage": "None",
            "effect": "Pard can take the Dash action as a bonus action, and until the end of its turn, attacks against it have disadvantage."
          }
        ]
      },
      {
        "name": "Phantom Cat / Alien Big Cat",
        "origin": "Modern cryptids",
        "appearance": "A large, elusive feline that fades into shadows, rumored but rarely confirmed.",
        "attacks": [
          {
            "name": "Ghostly Claw",
            "damage": "2d8 necrotic",
            "effect": "On a hit, target must make DC 14 Wisdom save or be unable to perceive the Phantom Cat for 1 round."
          },
          {
            "name": "Silent Stalk",
            "damage": "None",
            "effect": "Phantom Cat becomes invisible if in dim light or darkness until it attacks or enters bright light."
          }
        ]
      },
      {
        "name": "Underwater Panther",
        "origin": "Native American (Great Lakes region)",
        "appearance": "A powerful feline with reptilian features and horns, dwelling underwater. Sometimes associated with storms.",
        "attacks": [
          {
            "name": "Drowning Clutch",
            "damage": "3d6 slashing",
            "effect": "If near water, on a hit target must make DC 14 Strength save or be pulled underwater, starting to drown."
          },
          {
            "name": "Storm Roar",
            "damage": "3d6 thunder",
            "effect": "A 20-foot radius shockwave. Targets must make DC 15 Constitution save or be deafened and pushed 10 feet."
          }
        ]
      },
      {
        "name": "Wampus cat",
        "origin": "American folklore",
        "appearance": "A cat-like creature with six legs, long tail, said to have once been a cursed human. Associated with Southern Appalachia.",
        "attacks": [
          {
            "name": "Hexed Claw",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must succeed on DC 14 Charisma save or be cursed, taking -1d4 penalty on all attack rolls for 1 minute."
          },
          {
            "name": "Mournful Yowl",
            "damage": "None",
            "effect": "All enemies within 30 feet must make DC 14 Wisdom save or be frightened until they spend an action to steel their resolve."
          }
        ]
      },
      {
        "name": "White Tiger",
        "origin": "Chinese",
        "appearance": "A majestic, divine tiger that guards the West, with pure white fur and a regal demeanor.",
        "attacks": [
          {
            "name": "Celestial Claw",
            "damage": "3d8 radiant",
            "effect": "On a hit, target must make DC 15 Wisdom save or be blinded by brilliant light for 1 round."
          },
          {
            "name": "Warding Roar",
            "damage": "None",
            "effect": "All allies within 20 feet gain +2 to AC for 1 minute as the White Tiger’s protective aura envelops them."
          }
        ]
      },
      {
        "name": "Winged cat",
        "origin": "Various",
        "appearance": "A domestic cat with small, feathery wings, agile in flight.",
        "attacks": [
          {
            "name": "Aerial Pounce",
            "damage": "2d6 slashing",
            "effect": "If attacking from above, target must make DC 12 Dexterity save or be knocked prone."
          },
          {
            "name": "Distracting Flutter",
            "damage": "None",
            "effect": "Winged cat flutters around a target’s head. That target has disadvantage on its next attack roll as it swats at the annoyance."
          }
        ]
      }
    ]
  },
  {
    "category": "Carnivorans",
    "sub-category": "Lions",
    "creatures": [
      {
        "name": "Arimanius",
        "origin": "Greek (Hellenistic mystery religions)",
        "appearance": "A minor lion-headed deity, often associated with Aion or Chronos, bearing a regal mane and cosmic symbols.",
        "attacks": [
          {
            "name": "Chrono Claw",
            "damage": "3d8 radiant",
            "effect": "On a hit, the target must succeed on a DC 15 Wisdom save or lose its next bonus action, as time seems to slow for them."
          },
          {
            "name": "Cosmic Roar",
            "damage": "3d8 psychic",
            "effect": "All creatures within 20 feet make a DC 15 Intelligence save or be stunned until the end of Arimanius’s next turn."
          }
        ]
      },
      {
        "name": "Ammit",
        "origin": "Egyptian",
        "appearance": "A demoness with the forequarters of a lion, the hindquarters of a hippopotamus, and the head of a crocodile. Known as the devourer of the dead.",
        "attacks": [
          {
            "name": "Devouring Maw",
            "damage": "4d8 piercing",
            "effect": "On a hit against a creature at 0 HP or under a death effect, Ammit immediately kills and devours it. Otherwise, target must make DC 16 Strength save or be grappled."
          },
          {
            "name": "Judgmental Glare",
            "damage": "2d8 necrotic",
            "effect": "One target that Ammit can see within 30 feet must make DC 15 Charisma save or be frightened and unable to heal for 1 minute."
          }
        ]
      },
      {
        "name": "Barong",
        "origin": "Balinese",
        "appearance": "A benevolent king of spirits taking the shape of a lion-like creature, adorned with rich fabrics and gold.",
        "attacks": [
          {
            "name": "Protective Roar",
            "damage": "None",
            "effect": "All allies within 30 feet gain advantage on saving throws against curses and fear for 1 minute."
          },
          {
            "name": "Spirit Claw",
            "damage": "3d6 radiant",
            "effect": "On a hit, target must succeed on DC 14 Wisdom save or have disadvantage on attack rolls against Barong’s allies until the end of its next turn."
          }
        ]
      },
      {
        "name": "Beast of the First Kingdom",
        "origin": "Christian apocrypha",
        "appearance": "A lion with eagle’s wings, representing the first great empire seen in prophetic visions.",
        "attacks": [
          {
            "name": "Winged Maul",
            "damage": "3d8 slashing",
            "effect": "On a hit, if the Beast moved at least 10 feet before attacking, it deals an extra 1d6 slashing damage."
          },
          {
            "name": "Prophetic Roar",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 15 Wisdom save or be overwhelmed by visions, giving them disadvantage on their next attack roll."
          }
        ]
      },
      {
        "name": "Brunswick Lion",
        "origin": "German",
        "appearance": "A legendary lion statue brought to life, symbol of loyalty and bravery, carved from stone or metal.",
        "attacks": [
          {
            "name": "Stony Bite",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, target must succeed on DC 14 Strength save or be knocked prone by the lion’s solid jaws."
          },
          {
            "name": "Roar of Loyalty",
            "damage": "None",
            "effect": "All allies within 20 feet gain +2 to AC for 1 round as the Brunswick Lion’s presence inspires steadfast defense."
          }
        ]
      },
      {
        "name": "Chimera",
        "origin": "Greek",
        "appearance": "A lion’s body with a goat’s head emerging from its back and a serpent for a tail, breathing fire from the lion head.",
        "attacks": [
          {
            "name": "Triple Strike",
            "damage": "Lion head: 2d8 piercing, Goat head: 2d6 bludgeoning (ram), Serpent tail: 2d6 poison",
            "effect": "On a successful multiattack, if all three hits land on the same target, that target must make a DC 15 Constitution save or be stunned until the end of its next turn."
          },
          {
            "name": "Flame Breath",
            "damage": "4d6 fire",
            "effect": "A 15-foot cone of fire. Targets must make DC 14 Dexterity save or take full damage, half on success."
          }
        ]
      },
      {
        "name": "Chinese guardian lions",
        "origin": "Chinese",
        "appearance": "Stone lions placed in pairs as guardians, often ornate and stylized.",
        "attacks": [
          {
            "name": "Stone Bite",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, target must make DC 13 Strength save or be grappled by the lion’s stone jaws."
          },
          {
            "name": "Guardian’s Aura",
            "damage": "None",
            "effect": "Allies within 15 feet cannot be frightened or charmed while within this aura."
          }
        ]
      },
      {
        "name": "Komainu (Shinto)",
        "origin": "Japanese",
        "appearance": "Similar to Chinese guardian lions, these temple guardians often come in pairs, one open-mouthed, one closed.",
        "attacks": [
          {
            "name": "Temple Fang",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must succeed DC 14 Wisdom save or be marked. Marked targets grant advantage to Komainu’s ally attacks for 1 minute."
          },
          {
            "name": "Purifying Roar",
            "damage": "None",
            "effect": "All allies within 30 feet are cured of one minor curse or magical fear effect."
          }
        ]
      },
      {
        "name": "Shisa (Ryukyuan)",
        "origin": "Ryukyuan",
        "appearance": "A cross between a lion and a dog, statues come to life to protect homes.",
        "attacks": [
          {
            "name": "Ward Bite",
            "damage": "2d8 piercing",
            "effect": "On a hit, target must make DC 13 Charisma save or be unable to teleport or become invisible for 1 minute."
          },
          {
            "name": "Protective Howl",
            "damage": "None",
            "effect": "Allies within 20 feet gain +1 to all saving throws for 1 minute."
          }
        ]
      },
      {
        "name": "Sin-you (Japanese)",
        "appearance": "A one-horned Chinese/Japanese lion that judges guilt and innocence.",
        "attacks": [
          {
            "name": "Judgment Horn",
            "damage": "3d6 piercing",
            "effect": "On a hit, if target has committed a recent crime (GM discretion), Sin-you deals an extra 2d6 psychic damage."
          },
          {
            "name": "Truthsnarl",
            "damage": "None",
            "effect": "One creature within 30 feet must make DC 15 Wisdom save or be compelled to speak only truth for 1 minute."
          }
        ]
      },
      {
        "name": "Xiezhi (Chinese)",
        "appearance": "A one-horned creature often depicted as a goat-lion hybrid symbolizing justice and law.",
        "attacks": [
          {
            "name": "Horn of Justice",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must make DC 15 Charisma save or be unable to lie for 1 hour."
          },
          {
            "name": "Lawkeeper’s Gaze",
            "damage": "2d6 psychic",
            "effect": "On a hit, target must make DC 14 Intelligence save or be unable to cast enchantment spells for 10 minutes."
          }
        ]
      },
      {
        "name": "Dawon",
        "origin": "Hindu/Tibetan",
        "appearance": "A sacred tiger or lion used as a mount by the goddess Durga, decorated with divine ornaments.",
        "attacks": [
          {
            "name": "Divine Claw",
            "damage": "3d8 radiant",
            "effect": "On a hit, target must make DC 15 Wisdom save or become blinded by holy light for 1 round."
          },
          {
            "name": "Guardian Leap",
            "damage": "None",
            "effect": "Dawon leaps next to an ally as a bonus action, granting that ally advantage on their next saving throw."
          }
        ]
      },
      {
        "name": "Egyptian lion gods",
        "origin": "Egyptian",
        "appearance": "Various lioness or lion-headed gods and goddesses representing warfare, healing, and protection.",
        "attacks": [
          {
            "name": "Divine Maul",
            "damage": "4d6 radiant",
            "effect": "On a hit, target must make DC 16 Wisdom save or be charmed with reverent awe for 1 minute."
          },
          {
            "name": "Blazing Eye",
            "damage": "3d6 fire",
            "effect": "A line of fire 30 feet long, DC 15 Dexterity save or take full damage. Targets failing the save also lose their next reaction."
          }
        ]
      },
      {
        "name": "Maahes",
        "origin": "Egyptian",
        "appearance": "A specific Egyptian lion-headed god, associated with war and weather, wearing regal attire.",
        "attacks": [
          {
            "name": "Razor Claw Storm",
            "damage": "4d6 slashing",
            "effect": "On a hit, Maahes may make an immediate second claw attack at disadvantage. If it hits again, target bleeds (1d4 damage per turn until healed)."
          },
          {
            "name": "Thunderous Roar",
            "damage": "3d8 thunder",
            "effect": "A 20-foot radius blast of sound. Targets must make DC 16 Constitution save or be stunned for 1 round."
          }
        ]
      },
      {
        "name": "Sekhmet",
        "origin": "Egyptian",
        "appearance": "A lioness-headed warrior goddess, powerful and fearsome, often associated with the sun’s scorching heat.",
        "attacks": [
          {
            "name": "Sun Flare",
            "damage": "4d8 fire",
            "effect": "A 15-foot cone of intense heat. Targets must make DC 16 Dexterity save or be blinded for 1 round."
          },
          {
            "name": "Warrior’s Bite",
            "damage": "3d6 slashing + 3d6 radiant",
            "effect": "On a hit, target must make DC 16 Strength save or drop all carried weapons due to overwhelming pain and fear."
          }
        ]
      },
      {
        "name": "Taweret",
        "origin": "Egyptian",
        "appearance": "A hippopotamus-headed goddess with lion paws and a crocodile tail, protector of childbirth.",
        "attacks": [
          {
            "name": "Protective Swipe",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, an ally within 5 feet of Taweret gains 2d8 temporary HP."
          },
          {
            "name": "Amniotic Flood",
            "damage": "2d8 water (bludgeoning)",
            "effect": "A 10-foot radius of conjured water. Targets must make DC 14 Strength save or be knocked prone."
          }
        ]
      },
      {
        "name": "Tutu",
        "origin": "Egyptian",
        "appearance": "A protective deity with a composite form: lion body, human head, hawk and crocodile heads projecting from the body, serpent tail.",
        "attacks": [
          {
            "name": "Chimera’s Fury",
            "damage": "Roll 1d4: (1) Hawk bite 3d6 slashing, (2) Crocodile snap 3d6 piercing, (3) Serpent sting 3d6 poison, (4) Lion claw 3d6 radiant",
            "effect": "On a hit, target must make DC 16 Charisma save or be dazed (no reactions) for 1 round."
          },
          {
            "name": "Warding Presence",
            "damage": "None",
            "effect": "All allies within 20 feet gain advantage on saving throws vs fear and charm for 1 minute."
          }
        ]
      },
      {
        "name": "Griffin",
        "origin": "European",
        "appearance": "Body of a lion with the head and wings of an eagle, guardian of treasures.",
        "attacks": [
          {
            "name": "Lion’s Claw",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must make DC 14 Strength save or be knocked prone."
          },
          {
            "name": "Eagle’s Beak",
            "damage": "3d8 piercing",
            "effect": "On a hit, if the target is prone, deal an extra 1d8 damage."
          }
        ]
      },
      {
        "name": "Lamassu",
        "origin": "Mesopotamian",
        "appearance": "A protective deity with a human head, the body of a lion or bull, and eagle wings.",
        "attacks": [
          {
            "name": "Celestial Paw",
            "damage": "3d6 radiant",
            "effect": "On a hit, target must succeed DC 15 Wisdom save or be charmed for 1 round by the lamassu’s divine presence."
          },
          {
            "name": "Wing Shield",
            "damage": "None",
            "effect": "Lamassu shields allies behind its wings. Allies within 10 feet gain +2 AC for 1 round."
          }
        ]
      },
      {
        "name": "Manticore",
        "origin": "Persian/Greek",
        "appearance": "A lion with a human-like face and a scorpion or dragon-like tail loaded with poisonous spines.",
        "attacks": [
          {
            "name": "Poison Spines",
            "damage": "3d6 poison",
            "effect": "Ranged 50/100 feet. On a hit, target must make DC 15 Constitution save or be poisoned for 1 minute."
          },
          {
            "name": "Lion’s Lunge",
            "damage": "3d8 slashing",
            "effect": "On a hit, if Manticore moved at least 20 feet straight toward the target, the attack deals an additional 1d6 damage."
          }
        ]
      },
      {
        "name": "Manussiha",
        "origin": "Burmese",
        "appearance": "A statue-like being with a human head and two lion hindquarters, symbolizing protection and watchfulness.",
        "attacks": [
          {
            "name": "Protective Stance",
            "damage": "None",
            "effect": "Allies within 10 feet cannot be surprised and have advantage on Initiative rolls."
          },
          {
            "name": "Goading Claw",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must make DC 14 Charisma save or be compelled to attack Manussiha next turn if able."
          }
        ]
      },
      {
        "name": "Merlion",
        "origin": "Singaporean",
        "appearance": "A creature with a lion’s head and a fish’s body, associated with maritime guardianship.",
        "attacks": [
          {
            "name": "Tidal Roar",
            "damage": "3d8 cold",
            "effect": "A 15-foot cone of seawater. Targets must make DC 14 Strength save or be pushed 10 feet and knocked prone."
          },
          {
            "name": "Frosted Fang",
            "damage": "2d8 piercing + 2d6 cold",
            "effect": "On a hit, target must make DC 14 Constitution save or have movement halved for 1 round."
          }
        ]
      },
      {
        "name": "Narasimha",
        "origin": "Hindu",
        "appearance": "A half-lion, half-man avatar of Vishnu, known for destroying evil and protecting devotees.",
        "attacks": [
          {
            "name": "Avatar’s Claw",
            "damage": "4d6 radiant",
            "effect": "On a hit, target must succeed DC 16 Wisdom save or be paralyzed with awe for 1 round."
          },
          {
            "name": "Divine Roar",
            "damage": "3d8 thunder",
            "effect": "All enemies in 20 feet make DC 15 Charisma save or drop any weapons they hold as faith-shaking fear overcomes them."
          }
        ]
      },
      {
        "name": "Nian",
        "origin": "Chinese",
        "appearance": "A beast with a lion-like body and canine face, sometimes reptilian features, warded off by New Year festivities.",
        "attacks": [
          {
            "name": "Frightful Lunge",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must make DC 14 Wisdom save or be frightened for 1 minute. Target may repeat the save at end of each turn."
          },
          {
            "name": "Firecracker Fear",
            "damage": "None",
            "effect": "If bright light or loud noise is present (firecrackers, etc.), Nian has disadvantage on attacks. Otherwise, Nian can roar, forcing DC 14 Wisdom save to frighten targets."
          }
        ]
      }
    ]
  },
  {
    "category": "Carnivorans",
    "sub-category": "Hyenas",
    "creatures": [
      {
        "name": "Werehyena",
        "origin": "Various African & Arabian folklore",
        "appearance": "A humanoid that can transform into a hyena-like form, often associated with cunning cruelty.",
        "attacks": [
          {
            "name": "Savage Bite",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must make DC 14 Constitution save or contract a werehyena curse (GM’s discretion)."
          },
          {
            "name": "Cackling Dread",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 14 Wisdom save or be frightened for 1 minute, hearing the werehyena’s unearthly laughter."
          }
        ]
      },
      {
        "name": "Kishi",
        "origin": "Angolan (African) folklore",
        "appearance": "A demon with two faces: a handsome human face at the front and a hyena’s face at the back of its head, hidden by long hair.",
        "attacks": [
          {
            "name": "Double-Faced Ambush",
            "damage": "3d6 slashing",
            "effect": "If Kishi attacks a charmed or unaware target, deal an extra 1d6 psychic damage as the target’s mind reels at the reveal of the second face."
          },
          {
            "name": "Hyena Maw (Rear Face)",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must succeed DC 15 Wisdom save or be charmed by the human face if they see it next turn, conflicted by the dual nature."
          }
        ]
      }
    ]
  },
  {
    "category": "Carnivorans",
    "sub-category": "Musteloids, Mongoose, Civets, etc.",
    "creatures": [
      {
        "name": "Azeban",
        "origin": "Abenaki",
        "appearance": "A raccoon trickster spirit, small and nimble with intelligent eyes and a mischievous grin.",
        "attacks": [
          {
            "name": "Trickster’s Swipe",
            "damage": "2d6 slashing",
            "effect": "On a hit, target must make DC 13 Intelligence save or be confused (as Confusion spell) for 1 round as Azeban chitters mockingly."
          },
          {
            "name": "Bait and Switch",
            "damage": "None",
            "effect": "Azeban distracts a target within 15 feet. That target has disadvantage on its next attack roll as it chases the illusion of stolen treats."
          }
        ]
      },
      {
        "name": "Gef",
        "origin": "Isle of Man folklore",
        "appearance": "A talking mongoose, small and furry, often unseen but heard, known for trickery and gossip.",
        "attacks": [
          {
            "name": "Ventriloquist Whisper",
            "damage": "None",
            "effect": "Forces DC 14 Charisma save. On fail, target is distracted, granting advantage to Gef’s allies’ next attacks against that target."
          },
          {
            "name": "Nipping Bite",
            "damage": "1d6 piercing",
            "effect": "On a hit, target must succeed DC 12 Wisdom save or spend its next action searching fruitlessly for Gef, who can Hide as a bonus action."
          }
        ]
      },
      {
        "name": "Ichneumon",
        "origin": "Greek bestiary",
        "appearance": "A mongoose-like creature known for battling snakes and dragons, nimble and fierce.",
        "attacks": [
          {
            "name": "Serpent Slayer",
            "damage": "2d8 piercing",
            "effect": "On a hit against a reptilian or draconic creature, Ichneumon deals an extra 1d8 damage."
          },
          {
            "name": "Swift Dodge",
            "damage": "None",
            "effect": "As a reaction when attacked, Ichneumon gains +2 AC against that attack. On success, it can move 10 feet without provoking opportunity attacks."
          }
        ]
      },
      {
        "name": "Kamaitachi",
        "origin": "Japanese",
        "appearance": "Weasel-like yōkai riding on winds, invisible slashing claws, often appearing as a trio.",
        "attacks": [
          {
            "name": "Wind Slash",
            "damage": "2d8 slashing",
            "effect": "Ranged 30 feet. Targets must make DC 14 Dexterity save or be knocked prone by sudden gusts."
          },
          {
            "name": "Trio Ambush",
            "damage": "Varies",
            "effect": "If three Kamaitachi work together, their combined attack deals an extra 2d8 slashing and leaves the target bleeding (1d4 damage at start of each turn until healed)."
          }
        ]
      },
      {
        "name": "Kushtaka",
        "origin": "Tlingit",
        "appearance": "A shapeshifting “land otter man” capable of mimicking human cries to lure victims.",
        "attacks": [
          {
            "name": "Luring Cry",
            "damage": "None",
            "effect": "One humanoid within 60 feet must make DC 15 Wisdom save or be charmed, approaching Kushtaka’s location, losing their reaction this round."
          },
          {
            "name": "Otter Claw",
            "damage": "2d6 slashing",
            "effect": "On a hit, target must make DC 13 Dexterity save or drop a held item as slick otter fur confuses their grip."
          }
        ]
      },
      {
        "name": "Mujina",
        "origin": "Japanese",
        "appearance": "A shapeshifting badger or raccoon dog that can disguise itself as a human with a smooth, featureless face.",
        "attacks": [
          {
            "name": "Faceless Terror",
            "damage": "None",
            "effect": "One target within 30 feet must make DC 14 Wisdom save or be frightened for 1 minute, seeing the Mujina’s blank visage."
          },
          {
            "name": "Bite and Vanish",
            "damage": "2d6 piercing",
            "effect": "On a hit, Mujina can immediately take the Hide action as a bonus action."
          }
        ]
      },
      {
        "name": "Ramidreju",
        "origin": "Spanish folklore",
        "appearance": "A long, weasel-like creature with green fur, born every hundred years from a weasel’s womb. Its fur and body have healing properties.",
        "attacks": [
          {
            "name": "Fur of Remedy",
            "damage": "None",
            "effect": "As an action, Ramidreju can heal an ally for 3d8 hit points. If used offensively, touching an undead deals 3d8 radiant damage instead."
          },
          {
            "name": "Nimble Dart",
            "damage": "2d4 piercing",
            "effect": "On a hit, target must make DC 13 Constitution save or lose its next reaction as the Ramidreju’s unexpected speed disorients."
          }
        ]
      },
      {
        "name": "Raijū",
        "origin": "Japanese",
        "appearance": "A thunder beast, often weasel or cat-like, made of lightning or wrapped in crackling electricity.",
        "attacks": [
          {
            "name": "Lightning Pounce",
            "damage": "3d8 lightning",
            "effect": "On a hit, target must make DC 15 Constitution save or be stunned for 1 round as electricity surges through their body."
          },
          {
            "name": "Thunder Roll",
            "damage": "2d6 thunder",
            "effect": "A 20-foot radius boom. Targets must make DC 14 Strength save or be knocked prone."
          }
        ]
      }
    ]
  },
  {
    "category": "Procyonids and Related Creatures",
    "creatures": [
      {
        "name": "Azeban (detailed above)",
        "note": "Already described under musteloids for convenience."
      }
    ]
  },
  {
    "category": "Fish",
    "creatures": [
      {
        "name": "Mermaid / Merman",
        "origin": "Worldwide",
        "appearance": "Humanoid upper body with a fish tail. Graceful, alluring, and often magical.",
        "attacks": [
          {
            "name": "Siren Song",
            "damage": "None",
            "effect": "All humanoids within 60 feet must make DC 15 Wisdom save or be charmed, moving toward the mermaid/merman."
          },
          {
            "name": "Trident Jab",
            "damage": "2d6 piercing",
            "effect": "On a hit, if underwater, target must succeed DC 13 Strength save or be pushed 5 feet and start suffocating if they can’t breathe water."
          }
        ]
      },
      {
        "name": "Water spirit (Undine)",
        "origin": "Worldwide, Paracelsus",
        "appearance": "A graceful water elemental in humanoid form, skin shimmering like water’s surface.",
        "attacks": [
          {
            "name": "Drenching Embrace",
            "damage": "2d8 bludgeoning (water force)",
            "effect": "On a hit, target must make DC 14 Strength save or be grappled. While grappled, they start suffocating if they cannot breathe water."
          },
          {
            "name": "Hydroblast",
            "damage": "3d6 cold",
            "effect": "A 30-foot line of high-pressure water. Targets must make DC 14 Dexterity save or be knocked prone and pushed 10 feet."
          }
        ]
      },
      {
        "name": "Abaia",
        "origin": "Melanesian",
        "appearance": "A giant eel-like fish that guards its lake fiercely, black and shimmering.",
        "attacks": [
          {
            "name": "Whirlpool Tail",
            "damage": "3d8 bludgeoning",
            "effect": "A 15-foot radius whirlpool forms. Targets inside must make DC 15 Strength save or be pulled 10 feet toward the Abaia and knocked prone."
          },
          {
            "name": "Lightning Scales",
            "damage": "3d6 lightning",
            "effect": "On a hit, if in water, lightning spreads. All creatures within 10 feet must make DC 14 Dexterity save or take half damage."
          }
        ]
      },
      {
        "name": "Gurangatch",
        "origin": "Australian Aboriginal",
        "appearance": "A giant eel-like creature with amphibious traits, said to carve out rivers.",
        "attacks": [
          {
            "name": "Quicksand Swirl",
            "damage": "2d8 bludgeoning",
            "effect": "A 10-foot radius of soft mud forms. Targets inside must make DC 14 Strength save or be restrained by mud."
          },
          {
            "name": "Crushing Maw",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must succeed DC 15 Strength save or be grappled in its powerful jaws."
          }
        ]
      },
      {
        "name": "Hippocamp",
        "origin": "Greek",
        "appearance": "A horse with a fish’s tail, already described above in aquatic mammals section, but can appear under fish due to its tail.",
        "note": "See previous entry under aquatic mammals for stats."
      },
      {
        "name": "Ika-Roa",
        "origin": "Māori",
        "appearance": "A giant cosmic fish or eel that created the Milky Way, shimmering with starlight.",
        "attacks": [
          {
            "name": "Starlight Torrent",
            "damage": "3d8 radiant",
            "effect": "A 20-foot radius surge of luminous water. Targets must make DC 15 Constitution save or be blinded for 1 round."
          },
          {
            "name": "Cosmic Current",
            "damage": "None",
            "effect": "Ika-Roa alters currents. Until the end of its next turn, all creatures swimming within 30 feet move at half speed."
          }
        ]
      },
      {
        "name": "Il Belliegha",
        "origin": "Maltese",
        "appearance": "An eel-like monster with a frog’s tongue and a hand at the tip of its tail, lurks in wells.",
        "attacks": [
          {
            "name": "Tadpole Tongue",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must make DC 13 Strength save or be pulled 10 feet closer."
          },
          {
            "name": "Hand Grab",
            "damage": "2d8 bludgeoning",
            "effect": "A hand at its tail attempts to grab a victim. On a hit, target is grappled (escape DC 14). While grappled, target takes 1d6 damage each turn."
          }
        ]
      },
      {
        "name": "Isonade",
        "origin": "Japanese",
        "appearance": "A huge shark-like monster with barbed fins, dwelling deep in the ocean.",
        "attacks": [
          {
            "name": "Fin Slash",
            "damage": "4d6 slashing",
            "effect": "On a hit, if the target is on a boat, the boat takes equal damage. If in water, target must make DC 15 Strength save or be pulled underwater."
          },
          {
            "name": "Wave Crash",
            "damage": "3d8 bludgeoning",
            "effect": "Isonade slams the surface, creating a 20-foot radius wave. Targets must make DC 14 Dexterity save or be knocked prone and pushed 10 feet."
          }
        ]
      },
      {
        "name": "Namazu",
        "origin": "Japanese",
        "appearance": "A giant catfish said to cause earthquakes when it thrashes underground.",
        "attacks": [
          {
            "name": "Earthshaker Tail",
            "damage": "4d6 bludgeoning",
            "effect": "A 30-foot radius quake. All creatures on the ground must make DC 15 Dexterity save or be knocked prone."
          },
          {
            "name": "Mud Spit",
            "damage": "2d8 bludgeoning",
            "effect": "A glob of mud. On a hit, target must make DC 14 Strength save or be restrained by thick mud until they use an action to free themselves."
          }
        ]
      },
      {
        "name": "Ningyo",
        "origin": "Japanese",
        "appearance": "A fish-human hybrid, smaller than a mermaid, considered an omen of longevity or disaster.",
        "attacks": [
          {
            "name": "Song of Fortune",
            "damage": "None",
            "effect": "One creature within 30 feet must make DC 14 Wisdom save. On success, gain +2 to next saving throw. On fail, disadvantage on next saving throw."
          },
          {
            "name": "Iridescent Scales",
            "damage": "2d6 radiant",
            "effect": "On a hit, target must make DC 13 Constitution save or be charmed for 1 round by Ningyo’s shimmering beauty."
          }
        ]
      },
      {
        "name": "Kun (Peng)",
        "origin": "Chinese",
        "appearance": "A giant fish that transforms into the Peng bird. As Kun, it’s enormous, dark-scaled, and wise.",
        "attacks": [
          {
            "name": "Whale-like Maw",
            "damage": "4d8 piercing",
            "effect": "On a hit, target must make DC 16 Strength save or be swallowed whole. Swallowed target is blinded, restrained, and takes 2d8 acid damage each turn."
          },
          {
            "name": "Transform (Peng)",
            "damage": "None",
            "effect": "As an action, Kun transforms into Peng, a giant bird form. In Peng form, it gains flight and different attacks (see Peng in birds section)."
          }
        ]
      },
      {
        "name": "Salmon of Wisdom",
        "origin": "Irish",
        "appearance": "An ordinary-looking salmon said to contain all the world’s knowledge.",
        "attacks": [
          {
            "name": "Scales of Insight",
            "damage": "None",
            "effect": "One ally who eats a scale gains advantage on all Intelligence checks for 1 hour. Offensively, if forced, can blind a foe with shimmering scales (DC 13 Con save or blinded 1 round)."
          },
          {
            "name": "Slippery Escape",
            "damage": "None",
            "effect": "Salmon can take the Disengage action as a bonus action and move through enemies’ spaces without provoking opportunity attacks."
          }
        ]
      },
      {
        "name": "Shachihoko",
        "origin": "Japanese",
        "appearance": "A creature with the head of a tiger and the body of a carp. Often used as a roof ornament to ward off fire.",
        "attacks": [
          {
            "name": "Tiger Bite",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must make DC 15 Strength save or drop one held item, startled by the sudden ferocity."
          },
          {
            "name": "Rain Summon",
            "damage": "None",
            "effect": "Shachihoko summons rain in a 30-foot radius. The area becomes difficult terrain for non-aquatic creatures, and fire-based attacks deal half damage for 1 minute."
          }
        ]
      }
    ]
  },
  {
    "category": "Insectivores",
    "creatures": [
      {
        "name": "Lavellan",
        "origin": "Scottish",
        "appearance": "A mythological water shrew-like creature, larger than a rat, with toxic fur that can harm livestock from a distance.",
        "attacks": [
          {
            "name": "Toxic Aura",
            "damage": "2d6 poison",
            "effect": "All creatures within 10 feet must make a DC 13 Constitution save or be poisoned for 1 minute. Poisoned creatures take 1d4 poison damage at the start of their turns."
          },
          {
            "name": "Venomous Bite",
            "damage": "2d8 poison",
            "effect": "On a hit, target must succeed on a DC 14 Constitution save or have disadvantage on Strength and Dexterity checks for 1 hour."
          }
        ]
      }
    ]
  },
  {
    "category": "Marsupials",
    "creatures": [
      {
        "name": "Drop Bear",
        "origin": "Australian folklore",
        "appearance": "A large, vicious, carnivorous koala-like creature that ambushes prey from above.",
        "attacks": [
          {
            "name": "Drop Ambush",
            "damage": "3d6 bludgeoning",
            "effect": "If the Drop Bear is hidden in a tree, it can drop onto a target below. On a hit, target must make DC 14 Strength save or be knocked prone."
          },
          {
            "name": "Razor Claws",
            "damage": "2d8 slashing",
            "effect": "On a hit, target must make DC 13 Constitution save or bleed (1d4 damage at the start of each turn until healed)."
          }
        ]
      },
      {
        "name": "Bunyip",
        "origin": "Australian Aboriginal",
        "appearance": "A water-dwelling creature, its form varies but often a mix of seals, dogs, and waterfowl features. Haunts billabongs and swamps.",
        "attacks": [
          {
            "name": "Aquatic Lunge",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must make DC 14 Strength save or be dragged 10 feet into the water."
          },
          {
            "name": "Dreadful Bellow",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 14 Wisdom save or be frightened for 1 minute. Creatures can repeat the save at the end of their turns."
          }
        ]
      }
    ]
  },
  {
    "category": "Molluscs",
    "creatures": [
      {
        "name": "Akkorokamui",
        "origin": "Ainu, Japanese",
        "appearance": "A giant octopus or squid-like being with crimson skin and enormous size, sometimes glowing.",
        "attacks": [
          {
            "name": "Tentacle Crush",
            "damage": "4d6 bludgeoning",
            "effect": "On a hit, target is grappled (escape DC 15). While grappled, target takes 2d6 bludgeoning at the start of its turn."
          },
          {
            "name": "Ink Cloud",
            "damage": "None",
            "effect": "A 20-foot radius ink cloud forces DC 14 Constitution save or creatures are blinded until they leave the cloud. Akkorokamui can move freely within."
          }
        ]
      },
      {
        "name": "Carbuncle (bivalve form)",
        "origin": "Chilote",
        "appearance": "A luminescent clam-like creature with a gemstone glow inside its shell.",
        "attacks": [
          {
            "name": "Pearl Snap",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must succeed DC 13 Dexterity save or drop a random carried item as the shell snaps shut loudly."
          },
          {
            "name": "Radiant Gleam",
            "damage": "2d8 radiant",
            "effect": "A flash of light forces DC 14 Wisdom save. On fail, target is blinded for 1 round and has disadvantage on Perception checks."
          }
        ]
      },
      {
        "name": "Lou Carcolh",
        "origin": "French",
        "appearance": "A giant snail with hairy tentacles and a massive shell, lurking in caves and tunnels.",
        "attacks": [
          {
            "name": "Tentacle Grab",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, target is grappled (escape DC 14). While grappled, target takes 1d6 acid damage per turn as Carcolh’s slime begins to dissolve clothes and gear."
          },
          {
            "name": "Slime Trail",
            "damage": "None",
            "effect": "A 10-foot path behind the Carcolh becomes difficult terrain. Creatures entering it must make DC 13 Dexterity save or fall prone."
          }
        ]
      },
      {
        "name": "Kraken",
        "origin": "Worldwide",
        "appearance": "A colossal squid-like sea monster with enormous tentacles, often capable of sinking ships.",
        "attacks": [
          {
            "name": "Crushing Tentacle",
            "damage": "4d8 bludgeoning",
            "effect": "On a hit, target is grappled (escape DC 18). Grappled targets take 2d8 bludgeoning each round."
          },
          {
            "name": "Lightning Storm",
            "damage": "4d10 lightning",
            "effect": "A 20-foot radius storm centered on a point in water. Targets make DC 16 Dexterity save or take full damage, half on success."
          }
        ]
      },
      {
        "name": "Shen",
        "origin": "Chinese",
        "appearance": "A clam-dragon hybrid that creates illusions and mirages. A giant clam with draconic features.",
        "attacks": [
          {
            "name": "Illusory Mirage",
            "damage": "None",
            "effect": "Forces all creatures within 60 feet to make DC 15 Intelligence save or see illusory landmasses or threats, imposing disadvantage on attack rolls for 1 minute."
          },
          {
            "name": "Shell Slam",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target must make DC 14 Strength save or be knocked prone as the massive shell snaps shut."
          }
        ]
      }
    ]
  },
  {
    "category": "Primates",
    "creatures": [
      {
        "name": "Agropelter",
        "origin": "North American lumberjack folklore",
        "appearance": "A wiry, ape-like creature dwelling in hollow trees, flinging branches at passersby.",
        "attacks": [
          {
            "name": "Branch Fling",
            "damage": "2d8 bludgeoning",
            "effect": "Ranged attack 30/60 ft. On a hit, target must make DC 13 Dexterity save or be knocked prone."
          },
          {
            "name": "Hollow Hide",
            "damage": "None",
            "effect": "Agropelter can Hide as a bonus action while in trees. Its first attack out of hiding is at advantage."
          }
        ]
      },
      {
        "name": "Bigfoot (Sasquatch)",
        "origin": "North American",
        "appearance": "A large, bipedal ape-like humanoid covered in thick fur, elusive and strong.",
        "attacks": [
          {
            "name": "Powerful Slam",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, target must make DC 14 Strength save or be pushed 10 feet."
          },
          {
            "name": "Rock Throw",
            "damage": "2d8 bludgeoning",
            "effect": "Ranged 30/60 ft. On a hit, target must make DC 13 Dexterity save or be knocked prone as the rock strikes with force."
          }
        ]
      },
      {
        "name": "Hibagon (Hinagon)",
        "origin": "Japan",
        "appearance": "A smaller bigfoot-like creature, ape-like, with a foul smell and sometimes red-brown fur.",
        "attacks": [
          {
            "name": "Fetid Claw",
            "damage": "2d6 slashing + 1d6 poison",
            "effect": "On a hit, DC 13 Constitution save or be poisoned for 1 round due to noxious odor."
          },
          {
            "name": "Muddy Throw",
            "damage": "None",
            "effect": "Hibagon throws mud in a 15-foot cone. Targets make DC 12 Dexterity save or be blinded until they use an action to clear their eyes."
          }
        ]
      },
      {
        "name": "Jué yuán",
        "origin": "Chinese/Japanese",
        "appearance": "A blue-furred, man-sized rhesus monkey that abducts human women. Agile and cunning.",
        "attacks": [
          {
            "name": "Grappling Grab",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must make DC 14 Strength save or be grappled. Jué yuán focuses on kidnapping its target."
          },
          {
            "name": "Shrill Screech",
            "damage": "None",
            "effect": "All within 20 feet make DC 13 Wisdom save or be frightened for 1 round."
          }
        ]
      },
      {
        "name": "Satori",
        "origin": "Japanese",
        "appearance": "A mind-reading ape or monkey that can speak and reveal a traveler’s thoughts.",
        "attacks": [
          {
            "name": "Mindread Lunge",
            "damage": "2d8 psychic",
            "effect": "On a hit, target must make DC 14 Charisma save or have disadvantage on their next saving throw as Satori anticipates their moves."
          },
          {
            "name": "Echoed Thoughts",
            "damage": "None",
            "effect": "Force one target within 30 feet to make DC 15 Wisdom save or lose its next bonus action, overwhelmed by hearing its own thoughts aloud."
          }
        ]
      },
      {
        "name": "Shōjō",
        "origin": "Japanese",
        "appearance": "A red-furred, sea-dwelling ape, fond of alcohol and mischief.",
        "attacks": [
          {
            "name": "Drunken Fist",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, target must make DC 13 Dexterity save or be knocked prone as Shōjō fights with unpredictable drunken style."
          },
          {
            "name": "Sake Splash",
            "damage": "2d6 poison",
            "effect": "A 15-foot cone of fermented sake spray. Targets fail DC 14 Constitution save or be poisoned for 1 minute, giggling uncontrollably."
          }
        ]
      },
      {
        "name": "Shug Monkey",
        "origin": "Britain",
        "appearance": "A monkey-dog hybrid already described under canines. (See previous entry.)"
      },
      {
        "name": "Sun Wukong",
        "origin": "Chinese",
        "appearance": "A powerful monkey king born from a stone egg, wielding a magic staff and gifted with many abilities.",
        "attacks": [
          {
            "name": "Ruyi Jingu Bang Strike",
            "damage": "4d6 bludgeoning",
            "effect": "On a hit, target must make DC 16 Strength save or be pushed 10 feet. Sun Wukong can change the staff’s size at will."
          },
          {
            "name": "72 Transformations",
            "damage": "None",
            "effect": "Sun Wukong takes the form of a beast or object (as Polymorph, self-only). His next attack after reverting deals +1d8 damage."
          }
        ]
      },
      {
        "name": "Vanara",
        "origin": "Indian/Hindu",
        "appearance": "Humanoid apes or monkeys, intelligent and often virtuous, allies of heroes.",
        "attacks": [
          {
            "name": "Staff Whirl",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, if there is an ally adjacent to the target, that ally may make an immediate melee attack as a reaction."
          },
          {
            "name": "Chattering Rally",
            "damage": "None",
            "effect": "All Vanara allies within 30 feet gain advantage on their next attack roll as they are inspired by communal chatter."
          }
        ]
      },
      {
        "name": "Yeren",
        "origin": "Chinese",
        "appearance": "A hominid-like creature, similar to Bigfoot, hairy and elusive, living in mountainous forests.",
        "attacks": [
          {
            "name": "Rock Bash",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, target must make DC 14 Constitution save or be staggered, losing their next reaction."
          },
          {
            "name": "Forest Blend",
            "damage": "None",
            "effect": "Yeren camouflages in forest terrain. It gains advantage on Stealth checks and its first attack out of hiding deals +1d6 damage."
          }
        ]
      },
      {
        "name": "Yeti",
        "origin": "Himalayas (Nepal, Tibet)",
        "appearance": "A large ape-like humanoid adapted to cold climates, white fur, and fierce strength.",
        "attacks": [
          {
            "name": "Chilling Claw",
            "damage": "3d6 slashing + 2d6 cold",
            "effect": "On a hit, target must make DC 15 Constitution save or have its speed halved due to numbing frost for 1 round."
          },
          {
            "name": "Ice Roar",
            "damage": "None",
            "effect": "All creatures within 30 feet must make DC 14 Wisdom save or be frightened, seeing visions of blizzards and avalanches."
          }
        ]
      },
      {
        "name": "Yowie",
        "origin": "Australian",
        "appearance": "A hominid cryptid similar to a Bigfoot, with large feet, wild hair, and strong build.",
        "attacks": [
          {
            "name": "Ground Pound",
            "damage": "3d8 bludgeoning",
            "effect": "A 10-foot radius quake. Targets must make DC 14 Dexterity save or fall prone."
          },
          {
            "name": "Intimidating Howl",
            "damage": "None",
            "effect": "Forces DC 14 Charisma save. On fail, target is too shaken to take the Attack action on its next turn (can still move or cast spells)."
          }
        ]
      }
    ]
  },
  {
    "category": "Rabbits and hares",
    "creatures": [
      {
        "name": "Al-Mi'raj",
        "origin": "Arabian",
        "appearance": "A cute yellow rabbit with a single, spiraling unicorn horn on its forehead.",
        "attacks": [
          {
            "name": "Horn Gore",
            "damage": "2d8 piercing",
            "effect": "On a hit, target must make DC 13 Constitution save or be stunned for 1 round, surprised by the rabbit’s fierce attack."
          },
          {
            "name": "Hop Dodge",
            "damage": "None",
            "effect": "Al-Mi'raj can use its reaction to move 10 feet away without provoking opportunity attacks."
          }
        ]
      },
      {
        "name": "Jackalope",
        "origin": "North American folklore",
        "appearance": "A jackrabbit with antelope horns, quick and tricky.",
        "attacks": [
          {
            "name": "Horned Leap",
            "damage": "2d6 piercing",
            "effect": "If Jackalope moves at least 20 feet before attacking, it deals an extra 1d6 damage and target must make DC 13 Strength save or fall prone."
          },
          {
            "name": "Mimic Voice",
            "damage": "None",
            "effect": "Forces DC 14 Wisdom save. On fail, target is distracted, granting Jackalope advantage on its next attack."
          }
        ]
      },
      {
        "name": "Moon Rabbit",
        "origin": "Chinese",
        "appearance": "A white rabbit that dwells on the moon, associated with making elixirs of immortality.",
        "attacks": [
          {
            "name": "Celestial Powder",
            "damage": "None",
            "effect": "Heals an ally for 2d8 hit points, or if used offensively, blinds a foe with glowing dust (DC 14 Dex save or blinded 1 round)."
          },
          {
            "name": "Moonlit Hop",
            "damage": "None",
            "effect": "Moon Rabbit can teleport up to 20 feet in moonlight. Next attack it makes deals +1d4 radiant damage."
          }
        ]
      },
      {
        "name": "Skvader",
        "origin": "Swedish",
        "appearance": "A hybrid between a hare and a wood grouse, having wings and hindparts of a hare.",
        "attacks": [
          {
            "name": "Wing Slap",
            "damage": "2d4 bludgeoning",
            "effect": "On a hit, target must make DC 12 Strength save or drop a held object as it fumbles from the unexpected strike."
          },
          {
            "name": "Aerial Scamper",
            "damage": "None",
            "effect": "Skvader flies 10 feet upward, forcing attackers to make ranged attacks or climb to engage. Its next attack has advantage."
          }
        ]
      },
      {
        "name": "Wisakedjak (Whiskeyjack, Rabbit Trickster)",
        "origin": "Native American",
        "appearance": "A rabbit trickster spirit, clever and mischievous.",
        "attacks": [
          {
            "name": "Illusory Decoy",
            "damage": "None",
            "effect": "Forces DC 14 Intelligence save. On fail, target attacks an illusory duplicate, wasting its attack this turn."
          },
          {
            "name": "Thumping Kick",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, target must make DC 13 Dexterity save or be knocked prone as the rabbit’s powerful hind legs strike."
          }
        ]
      },
      {
        "name": "Wolpertinger",
        "origin": "German",
        "appearance": "A horned rabbit with wings and sometimes fangs, a whimsical chimera.",
        "attacks": [
          {
            "name": "Winged Charge",
            "damage": "2d8 slashing",
            "effect": "On a hit, if Wolpertinger flew at least 10 feet, target must make DC 13 Strength save or be knocked prone."
          },
          {
            "name": "Confusing Presence",
            "damage": "None",
            "effect": "All creatures within 20 feet make DC 14 Wisdom save or have disadvantage on their next Perception check, puzzled by the bizarre creature."
          }
        ]
      }
    ]
  },
  {
    "category": "Reptiles, Limbed",
    "creatures": [
      {
        "name": "Agoa",
        "origin": "American (fabricated from West Virginian lore)",
        "appearance": "A turtle-like monster with a thick shell, gnarled features, and slimy moss growing on its back.",
        "attacks": [
          {
            "name": "Shell Slam",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, the target must make a DC 14 Strength save or be knocked prone. If prone, Agoa may move over the target, dealing 1d8 bludgeoning damage."
          },
          {
            "name": "Mossy Snap",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must succeed on a DC 13 Constitution save or have disadvantage on attack rolls for 1 round due to mossy, foul-tasting bite."
          }
        ]
      },
      {
        "name": "Ammut",
        "origin": "Egyptian",
        "appearance": "Also known as Ammit (already covered under Lions). Her reptilian portion can be emphasized: crocodilian jaws, lion’s forepart, hippo’s rear. (See lion entry for attacks.)"
      },
      {
        "name": "Bakunawa",
        "origin": "Philippines",
        "appearance": "A serpent-like dragon with a mouth large enough to swallow the moon, shimmering scales, and whisker-like tendrils.",
        "attacks": [
          {
            "name": "Lunar Maw",
            "damage": "4d8 piercing",
            "effect": "On a hit, target must make DC 15 Strength save or be swallowed if Medium or smaller. Swallowed creatures take 2d8 acid damage at the start of each of Bakunawa’s turns."
          },
          {
            "name": "Moon Eclipse",
            "damage": "3d10 necrotic",
            "effect": "A 20-foot radius darkness centered on Bakunawa. Targets inside must make DC 16 Wisdom save or be frightened until they leave the area."
          }
        ]
      },
      {
        "name": "Basilisk",
        "origin": "European",
        "appearance": "A small reptilian monster with a crown-like crest, capable of killing with its gaze.",
        "attacks": [
          {
            "name": "Petrifying Gaze",
            "damage": "None",
            "effect": "A creature that starts its turn within 30 feet and can see Basilisk’s eyes must make DC 13 Constitution save or begin turning to stone. On a failed save at the start of its next turn, it’s fully petrified."
          },
          {
            "name": "Venomous Bite",
            "damage": "2d8 poison",
            "effect": "On a hit, target must make DC 13 Constitution save or be poisoned for 1 minute. While poisoned, target’s speed is halved."
          }
        ]
      },
      {
        "name": "Black Tortoise",
        "origin": "Chinese",
        "appearance": "A tortoise entwined with a serpent, representing the north and winter, often depicted with mystical patterns on its shell.",
        "attacks": [
          {
            "name": "Icy Shell Bash",
            "damage": "3d6 cold + 2d6 bludgeoning",
            "effect": "On a hit, target must make DC 15 Constitution save or have its speed halved for 1 minute due to numbing cold."
          },
          {
            "name": "Serpent Strike",
            "damage": "3d8 poison",
            "effect": "On a hit, target must succeed DC 15 Constitution save or be poisoned for 1 minute. The poison deals 1d6 damage each turn until cured."
          }
        ]
      },
      {
        "name": "Cipactli",
        "origin": "Aztec",
        "appearance": "A monstrous crocodilian-fish-toad hybrid with countless mouths along its body, forever hungry.",
        "attacks": [
          {
            "name": "Many-Mouthed Maw",
            "damage": "4d6 piercing",
            "effect": "On a hit, roll a d4. On a 4, the target takes an additional 2d6 piercing damage as multiple mouths latch on simultaneously."
          },
          {
            "name": "Devour Earth",
            "damage": "None",
            "effect": "Cipactli gnaws at the ground, creating difficult terrain in a 20-foot radius. Creatures moving through it must make DC 14 Dexterity save or fall prone."
          }
        ]
      },
      {
        "name": "Dragon",
        "origin": "Worldwide",
        "appearance": "A large reptilian creature, often winged, with various breath weapons depending on type. (Too many variants to list all; choose a general example.)",
        "attacks": [
          {
            "name": "Fire Breath (Red Dragon example)",
            "damage": "6d10 fire",
            "effect": "A 30-foot cone. Targets make DC 16 Dexterity save or take full damage, half on success."
          },
          {
            "name": "Draconic Bite",
            "damage": "4d8 piercing",
            "effect": "On a hit, target must make DC 15 Strength save or be knocked prone by the dragon’s massive jaws."
          }
        ]
      },
      {
        "name": "Dungavenhooter",
        "origin": "American lumberjack folklore",
        "appearance": "A crocodile-like beast with no mouth, huge nostrils, and uses its tail to vaporize victims into inhalable mist.",
        "attacks": [
          {
            "name": "Tail Pound",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target must make DC 14 Constitution save or be knocked unconscious for 1 round as their breath is knocked out."
          },
          {
            "name": "Vaporize",
            "damage": "None",
            "effect": "If a target is at 0 HP and fails two death saves in Dungavenhooter’s presence, it can vaporize the body to heal 3d8 HP."
          }
        ]
      },
      {
        "name": "Knucker",
        "origin": "English",
        "appearance": "A kind of water-dragon or wyrm dwelling in knuckerholes (water-filled pits). Slimy and serpentine.",
        "attacks": [
          {
            "name": "Watery Coil",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, target is grappled (escape DC 14). While grappled, target takes 1d6 drowning damage each turn if submerged."
          },
          {
            "name": "Acidic Spit",
            "damage": "3d6 acid",
            "effect": "A 20-foot line. Targets must make DC 14 Dexterity save or take full damage and have their armor’s AC reduced by 1 (nonmagical)."
          }
        ]
      },
      {
        "name": "Kurma",
        "origin": "Hindu",
        "appearance": "The tortoise avatar of Vishnu, cosmic and vast, often supports mountains on its back.",
        "attacks": [
          {
            "name": "Shell of Creation",
            "damage": "None",
            "effect": "All allies within 30 feet gain +2 to all saves for 1 minute. If used offensively (rarely), Kurma can slam the ground: DC 15 Strength save or be knocked prone."
          },
          {
            "name": "Divine Snap",
            "damage": "3d8 radiant",
            "effect": "On a hit, target must make DC 15 Wisdom save or be stunned for 1 round by the cosmic authority Kurma represents."
          }
        ]
      },
      {
        "name": "Loch Ness Monster",
        "origin": "Scottish cryptid",
        "appearance": "A plesiosaur-like creature with a long neck, small head, and large body lurking in deep lakes.",
        "attacks": [
          {
            "name": "Neck Lash",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, target must make DC 13 Strength save or be knocked back 5 feet into the water, if near the lake."
          },
          {
            "name": "Silent Dive",
            "damage": "None",
            "effect": "Loch Ness Monster submerges. Next attack made from underwater is at advantage, and on a hit deals +1d6 damage."
          }
        ]
      },
      {
        "name": "Loveland Frog",
        "origin": "Ohio (American cryptid)",
        "appearance": "A small, bipedal frog-like humanoid wielding a wand that sparks faint magical energy.",
        "attacks": [
          {
            "name": "Wand Spark",
            "damage": "2d6 lightning",
            "effect": "On a hit, target must make DC 12 Constitution save or be shocked, losing its next reaction."
          },
          {
            "name": "Sticky Tongue",
            "damage": "2d4 bludgeoning",
            "effect": "On a hit, target must make DC 12 Strength save or be pulled 5 feet closer. If pulled into melee range, Loveland Frog attacks at advantage next turn."
          }
        ]
      },
      {
        "name": "Makara",
        "origin": "Hindu",
        "appearance": "Already covered under Aquatic mammals, but also considered reptilian (see previous entry)."
      },
      {
        "name": "Mokele Mbembe",
        "origin": "African cryptid",
        "appearance": "A large, sauropod-like reptile dwelling in swamps and rivers, shy but strong.",
        "attacks": [
          {
            "name": "Tail Sweep",
            "damage": "3d8 bludgeoning",
            "effect": "A 15-foot cone. Targets must make DC 15 Dexterity save or be knocked prone."
          },
          {
            "name": "Stomp",
            "damage": "4d6 bludgeoning",
            "effect": "On a hit against a prone target, deals an extra 1d6 damage. Target must make DC 14 Constitution save or be stunned for 1 round."
          }
        ]
      },
      {
        "name": "Moʻo",
        "origin": "Hawaiian",
        "appearance": "Shapeshifting lizard spirits, can appear as large black lizards or beautiful women.",
        "attacks": [
          {
            "name": "Illusory Charm",
            "damage": "None",
            "effect": "One target within 30 feet makes DC 15 Wisdom save or is charmed, seeing Moʻo as an ally. While charmed, target won’t attack Moʻo."
          },
          {
            "name": "Lizard Claw",
            "damage": "2d8 slashing",
            "effect": "On a hit, if Moʻo is near water, it can drag the target into water (DC 13 Strength save to resist) for potential drowning."
          }
        ]
      },
      {
        "name": "Morgawr",
        "origin": "Cornish",
        "appearance": "A crocodile-like sea serpent that disrupts fishing, has a long neck and humps.",
        "attacks": [
          {
            "name": "Fisher’s Ruin",
            "damage": "3d6 piercing",
            "effect": "On a hit against a boat or fishing gear, the equipment is destroyed. Against creatures, on a hit, target must make DC 13 Strength save or lose any fishing nets or poles they carry."
          },
          {
            "name": "Hump Crash",
            "damage": "3d8 bludgeoning",
            "effect": "Morgawr rises and falls on the surface, creating waves. Creatures on small boats in a 20-foot radius must make DC 14 Dexterity save or fall overboard."
          }
        ]
      },
      {
        "name": "Mungoon-Gali",
        "origin": "Australian",
        "appearance": "A giant goanna (monitor lizard) often of enormous size, lurking in rocky escarpments.",
        "attacks": [
          {
            "name": "Rending Claw",
            "damage": "3d6 slashing",
            "effect": "On a hit, target must succeed DC 13 Constitution save or be infected with minor venom causing disadvantage on Dexterity checks for 1 hour."
          },
          {
            "name": "Rock Scramble",
            "damage": "None",
            "effect": "Mungoon-Gali climbs swiftly. Gains advantage on next attack if it strikes from higher ground."
          }
        ]
      },
      {
        "name": "Peluda",
        "origin": "French",
        "appearance": "A dragon-like beast with green quills, multiple legs, and a venomous tail, said to cause floods.",
        "attacks": [
          {
            "name": "Poison Quills",
            "damage": "3d6 poison",
            "effect": "30-foot cone of quills. Targets must make DC 15 Dexterity save or be poisoned for 1 minute. Poisoned creatures take 1d4 poison damage each turn."
          },
          {
            "name": "Flood Tail",
            "damage": "3d8 bludgeoning",
            "effect": "If near water, Peluda lashes its tail, causing a sudden wave. Targets in 20-foot radius must make DC 14 Strength save or be knocked prone and pushed 10 feet."
          }
        ]
      },
      {
        "name": "Reptilian humanoids",
        "origin": "Various",
        "appearance": "General category for Lizardfolk, Serpent-Men, etc.",
        "attacks": [
          {
            "name": "Spear Thrust",
            "damage": "2d6 piercing",
            "effect": "On a hit, target must succeed DC 13 Strength save or drop a carried shield."
          },
          {
            "name": "Serpent Bite",
            "damage": "2d6 poison",
            "effect": "On a hit, target must make DC 12 Constitution save or be poisoned for 1 minute."
          }
        ]
      },
      {
        "name": "Sewer alligator",
        "origin": "Urban legends",
        "appearance": "An alligator adapted to sewers, with pale scales and milky eyes.",
        "attacks": [
          {
            "name": "Filthy Bite",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must make DC 13 Constitution save or contract a disease, causing disadvantage on Strength checks for 24 hours."
          },
          {
            "name": "Tail Sweep",
            "damage": "2d8 bludgeoning",
            "effect": "A 10-foot cone. Targets must make DC 12 Dexterity save or fall prone."
          }
        ]
      },
      {
        "name": "Sobek",
        "origin": "Egyptian",
        "appearance": "A crocodile-headed god, muscular human body, wearing a crown and carrying a scepter.",
        "attacks": [
          {
            "name": "Divine Bite",
            "damage": "4d6 radiant + 2d6 piercing",
            "effect": "On a hit, DC 15 Wisdom save or be charmed by Sobek’s overwhelming divinity for 1 round."
          },
          {
            "name": "Nile’s Protection",
            "damage": "None",
            "effect": "Allies within 20 feet gain resistance to fire and poison damage for 1 minute."
          }
        ]
      },
      {
        "name": "Taniwha",
        "origin": "Māori",
        "appearance": "A water-dwelling dragon or serpent with limbs, guardian or monster depending on locale.",
        "attacks": [
          {
            "name": "Guardian’s Maw",
            "damage": "3d8 piercing",
            "effect": "If Taniwha is protecting a specific place or person, it deals an extra 1d8 radiant damage to intruders."
          },
          {
            "name": "Whirlpool Shield",
            "damage": "None",
            "effect": "Creates a swirling current around itself. Ranged attacks against Taniwha are at disadvantage for 1 minute."
          }
        ]
      },
      {
        "name": "Whowie",
        "origin": "Australian",
        "appearance": "A giant, frog-headed goanna with six legs, enormous and slow, lurking in caves.",
        "attacks": [
          {
            "name": "Six-Legged Slam",
            "damage": "4d6 bludgeoning",
            "effect": "On a hit, target must make DC 15 Strength save or be knocked prone beneath its bulk."
          },
          {
            "name": "Acid Tongue",
            "damage": "3d8 acid",
            "effect": "On a hit, DC 14 Dex save or target’s armor/weapons suffer a -1 penalty as acid corrodes them."
          }
        ]
      },
      {
        "name": "Wyvern",
        "origin": "European",
        "appearance": "A two-legged dragon with a barbed tail, smaller than a true dragon, deadly flyer.",
        "attacks": [
          {
            "name": "Venomous Stinger",
            "damage": "3d8 poison",
            "effect": "On a hit, DC 15 Con save or be poisoned for 1 minute, taking 1d6 poison damage each turn."
          },
          {
            "name": "Aerial Drop",
            "damage": "3d6 bludgeoning",
            "effect": "If Wyvern grapples a target, it can fly up and drop them, forcing DC 14 Dexterity save or take falling damage."
          }
        ]
      },
      {
        "name": "Zaratan",
        "origin": "Medieval bestiaries",
        "appearance": "A colossal turtle-like creature, often mistaken for an island.",
        "attacks": [
          {
            "name": "Island Quake",
            "damage": "4d8 bludgeoning",
            "effect": "A 30-foot radius tremor. Targets must make DC 16 Strength save or fall prone. Structures take double damage."
          },
          {
            "name": "Gargantuan Snap",
            "damage": "6d8 piercing",
            "effect": "On a hit, DC 17 Strength save or be swallowed whole. Inside Zaratan’s maw, target takes 3d8 acid damage each turn."
          }
        ]
      }
    ]
  },
  {
    "category": "Reptiles, Serpents, and Worms",
    "creatures": [
      {
        "name": "Alicante",
        "origin": "European",
        "appearance": "A serpent-like creature sometimes associated with brewing milk or odd alchemy, small and elusive.",
        "attacks": [
          {
            "name": "Envenomed Nip",
            "damage": "2d6 poison",
            "effect": "On a hit, DC 12 Constitution save or be poisoned for 1 minute."
          },
          {
            "name": "Slither Away",
            "damage": "None",
            "effect": "Alicante can Disengage as a bonus action and move through spaces as narrow as 1 inch."
          }
        ]
      },
      {
        "name": "Amphisbaena",
        "origin": "Greek",
        "appearance": "A serpent with a head at each end, allowing it to move in both directions.",
        "attacks": [
          {
            "name": "Double Bite",
            "damage": "2d8 poison",
            "effect": "Roll to hit twice (once for each head). If both hits land, target must make DC 14 Con save or be paralyzed 1 round."
          },
          {
            "name": "Circular Coil",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, Amphisbaena coils around a target. Target is grappled (escape DC 13) and takes 1d6 bludgeoning each turn."
          }
        ]
      },
      {
        "name": "Amphithere",
        "origin": "Heraldic",
        "appearance": "A winged serpent with no legs, often depicted with colorful feathers and bat-like wings.",
        "attacks": [
          {
            "name": "Aerial Strike",
            "damage": "3d6 slashing",
            "effect": "If Amphithere attacked from flight, target must make DC 14 Dex save or be knocked prone."
          },
          {
            "name": "Venom Spit",
            "damage": "2d8 poison",
            "effect": "30-foot line. Targets make DC 14 Con save or be blinded for 1 round by stinging venom."
          }
        ]
      },
      {
        "name": "Apep/Apophis",
        "origin": "Egyptian",
        "appearance": "A giant serpent of chaos, huge and terrifying, associated with darkness and the underworld.",
        "attacks": [
          {
            "name": "Cosmic Constriction",
            "damage": "4d8 bludgeoning",
            "effect": "On a hit, target is grappled (escape DC 17). While grappled, target takes 2d6 necrotic at the start of each of its turns."
          },
          {
            "name": "Eclipse Breath",
            "damage": "4d10 necrotic",
            "effect": "A 30-foot cone of shadowy energy. Targets make DC 16 Constitution save or be frightened and blinded for 1 minute (save ends each turn)."
          }
        ]
      },
      {
        "name": "Azhi Dahaka",
        "origin": "Persian",
        "appearance": "A monstrous three-headed dragon or snake-like demon, breathing fire and venom.",
        "attacks": [
          {
            "name": "Triple Headed Strike",
            "damage": "3d8 (split as fire, poison, lightning)",
            "effect": "On a hit, target must make DC 16 Con save or suffer disadvantage on saves vs spells for 1 round due to overwhelming elemental energies."
          },
          {
            "name": "World-Corrupting Breath",
            "damage": "4d10 poison",
            "effect": "30-foot cone. Targets failing DC 16 Con save also take 2d6 necrotic damage and are poisoned for 1 minute."
          }
        ]
      },
      {
        "name": "Basilisk (repeated)",
        "note": "Already described above."
      },
      {
        "name": "Bakonawa (repeated)",
        "note": "Already described above in reptiles."
      },
      {
        "name": "Biscione",
        "origin": "Italian heraldry",
        "appearance": "A large serpent devouring a human or child, symbolic and heraldic.",
        "attacks": [
          {
            "name": "Devouring Maw",
            "damage": "3d8 piercing",
            "effect": "On a hit, if target is Small or smaller, DC 15 Strength save or be swallowed. Swallowed creatures take 2d6 acid damage each turn."
          },
          {
            "name": "Heraldic Intimidation",
            "damage": "None",
            "effect": "All creatures within 20 feet must make DC 14 Wisdom save or be frightened for 1 minute."
          }
        ]
      },
      {
        "name": "Cockatrice (repeated)",
        "note": "Already described in chickens section."
      },
      {
        "name": "Dragon (repeated)",
        "note": "General dragons covered above."
      },
      {
        "name": "Drake",
        "origin": "General dragon-kin",
        "appearance": "A smaller, wingless dragon-like creature, tougher scales, and strong bite.",
        "attacks": [
          {
            "name": "Iron Scales",
            "damage": "None",
            "effect": "Drake gains +2 AC this round. If it takes the Dodge action, it can also reflect 1d6 damage back to melee attackers."
          },
          {
            "name": "Savage Bite",
            "damage": "3d8 piercing",
            "effect": "On a hit, DC 14 Strength save or target drops a held weapon as the jaw pressure shocks them."
          }
        ]
      },
      {
        "name": "Echidna (Greek)",
        "appearance": "Mother of monsters, half-woman, half-snake.",
        "attacks": [
          {
            "name": "Poisoned Kiss",
            "damage": "3d6 poison",
            "effect": "On a hit (melee spell attack), target must make DC 15 Con save or be poisoned. While poisoned, target has disadvantage on Strength checks."
          },
          {
            "name": "Spawn Monstrosity",
            "damage": "None",
            "effect": "Once per day, Echidna summons a lesser monster (GM’s choice: a giant snake or lesser drake) under her control for 1 hour."
          }
        ]
      },
      {
        "name": "Fáfnir",
        "origin": "Norse",
        "appearance": "A dwarf turned into a dragon, greed-driven, poison-breathing.",
        "attacks": [
          {
            "name": "Poison Breath",
            "damage": "4d10 poison",
            "effect": "A 30-foot cone. Targets DC 16 Con save or be poisoned for 1 minute and take 1d6 poison damage each turn."
          },
          {
            "name": "Greedy Bite",
            "damage": "3d8 piercing",
            "effect": "On a hit, target must make DC 15 Wisdom save or feel compulsion to drop valuables, distracted by Fáfnir’s aura of greed."
          }
        ]
      },
      {
        "name": "Feathered serpent",
        "origin": "Mesoamerican",
        "appearance": "A serpent with quetzal feathers along its body, often wise and benevolent.",
        "attacks": [
          {
            "name": "Feather Flurry",
            "damage": "3d6 slashing (magical feathers)",
            "effect": "A 20-foot cone of whirling feathers. Targets must make DC 14 Dex save or be blinded for 1 round."
          },
          {
            "name": "Healing Winds",
            "damage": "None",
            "effect": "Feathered serpent can heal an ally within 30 feet for 3d8 HP. Offensively, can choose to withhold healing, causing attacker disadvantage on next attack."
          }
        ]
      },
      {
        "name": "Garafena (Russian)",
        "appearance": "A serpent-like dragon or snake, often poisonous and living near water.",
        "attacks": [
          {
            "name": "Venomous Coil",
            "damage": "2d8 poison",
            "effect": "On a hit, target is grappled (DC 14 escape). Grappled target takes 1d6 poison damage at start of turn."
          },
          {
            "name": "Hissing Fear",
            "damage": "None",
            "effect": "All creatures within 15 feet must make DC 13 Wis save or be frightened until end of next turn."
          }
        ]
      },
      {
        "name": "Gorgon (including Medusa) (Greek)",
        "appearance": "A serpent-haired woman whose gaze turns flesh to stone.",
        "attacks": [
          {
            "name": "Petrifying Gaze",
            "damage": "None",
            "effect": "Each creature starting turn within 30 feet makes DC 14 Con save or start turning to stone. A second failed save fully petrifies."
          },
          {
            "name": "Snake Hair",
            "damage": "2d6 poison",
            "effect": "On a hit, DC 13 Con save or be poisoned for 1 minute. While poisoned, target’s speed is halved."
          }
        ]
      },
      {
        "name": "Hoop snake",
        "origin": "American folklore",
        "appearance": "A snake that bites its tail and rolls like a hoop, chasing prey at high speed.",
        "attacks": [
          {
            "name": "Rolling Charge",
            "damage": "3d6 bludgeoning",
            "effect": "Hoop snake moves up to 60 feet in a straight line. Targets in its path must make DC 13 Dex save or be knocked prone."
          },
          {
            "name": "Venomous Sting",
            "damage": "2d8 poison",
            "effect": "On a hit, DC 14 Con save or be poisoned. While poisoned, target’s Dexterity checks are at disadvantage."
          }
        ]
      },
      {
        "name": "Indus worm",
        "origin": "Near East/Greek historiography",
        "appearance": "A large worm-like serpent said to live in rivers, possibly venomous.",
        "attacks": [
          {
            "name": "Slime Spray",
            "damage": "2d6 acid",
            "effect": "A 15-foot cone of slime. Targets DC 13 Dex save or be restrained by sticky goo until they use an action to free themselves."
          },
          {
            "name": "Boring Bite",
            "damage": "3d6 piercing",
            "effect": "On a hit, target must make DC 14 Strength save or drop one carried shield as the worm’s gnawing disarms them."
          }
        ]
      },
      {
        "name": "Hydra (Greek)",
        "appearance": "A multi-headed serpent. When one head is cut off, two may grow back unless prevented by fire.",
        "attacks": [
          {
            "name": "Multi-Headed Strike",
            "damage": "Each head: 2d6 piercing",
            "effect": "For each head, one attack. If a head is cut off, two grow back next turn unless cauterized. DC 15 Con save to resist poison from any bite."
          },
          {
            "name": "Regenerative Blood",
            "damage": "None",
            "effect": "At end of its turn, Hydra regains 2d6 HP per head alive. If fire damage was dealt this turn, no regeneration occurs."
          }
        ]
      },
      {
        "name": "Jaculus/Jaculi",
        "origin": "Medieval bestiaries",
        "appearance": "A small winged serpent that darts from trees to impale prey.",
        "attacks": [
          {
            "name": "Tree Dart",
            "damage": "2d8 piercing",
            "effect": "If Jaculus attacks from hiding in a tree, target makes DC 13 Wis save or be surprised and can’t react this round."
          },
          {
            "name": "Rapid Retreat",
            "damage": "None",
            "effect": "After attacking, Jaculus can move half its speed without provoking opportunity attacks."
          }
        ]
      },
      {
        "name": "Jasconius/Jasconius",
        "origin": "Early Christian lore",
        "appearance": "A giant fish or whale-like sea monster (sometimes considered serpentine) mistaken for an island.",
        "attacks": [
          {
            "name": "False Island Trap",
            "damage": "None",
            "effect": "Creatures resting on Jasconius must make DC 14 Dex save when it submerges or fall into the ocean, taking 2d6 bludgeoning from waves."
          },
          {
            "name": "Massive Maw",
            "damage": "4d8 piercing",
            "effect": "On a hit, DC 15 Strength save or be swallowed. Inside, target takes 2d8 acid damage each turn."
          }
        ]
      },
      {
        "name": "Jörmungandr",
        "origin": "Norse",
        "appearance": "The Midgard Serpent, enormous, encircling the world, poisonous and colossal.",
        "attacks": [
          {
            "name": "World-Coil Crush",
            "damage": "6d8 bludgeoning",
            "effect": "On a hit, if target is a structure or ship, deal double damage. If creature, DC 17 Str save or grappled, taking 3d6 bludgeoning each turn."
          },
          {
            "name": "Poisonous Breath",
            "damage": "5d10 poison",
            "effect": "A 60-foot cone. Targets DC 17 Con save or be poisoned for 1 minute and blinded for 1 round."
          }
        ]
      },
      {
        "name": "Lamia (serpent form considered, though usually half-woman)",
        "origin": "Greek",
        "appearance": "A half-woman, half-serpent who preys on children’s souls.",
        "attacks": [
          {
            "name": "Soul Drain",
            "damage": "3d8 necrotic",
            "effect": "On a hit, DC 15 Wis save or lose a Hit Die (or take 2d6 extra necrotic if no HD). Lamia regains HP equal to half drained."
          },
          {
            "name": "Serpentine Charm",
            "damage": "None",
            "effect": "One humanoid within 30 feet DC 14 Cha save or be charmed, obeying Lamia’s commands for 1 minute."
          }
        ]
      },
      {
        "name": "Lindworm",
        "origin": "Norse/Germanic",
        "appearance": "A wingless serpent-like dragon with two forelimbs, known for its toxic bite.",
        "attacks": [
          {
            "name": "Toxic Fang",
            "damage": "3d6 poison",
            "effect": "On a hit, DC 14 Con save or be poisoned for 1 minute. While poisoned, target’s speed is halved."
          },
          {
            "name": "Burrowing Rush",
            "damage": "2d8 bludgeoning",
            "effect": "Lindworm can burrow through soft earth. If it emerges under a target, that target must make DC 13 Dex save or be knocked prone."
          }
        ]
      },
      {
        "name": "Madame White Snake",
        "origin": "Chinese",
        "appearance": "A benevolent snake spirit taking the form of a beautiful woman, skilled in magic.",
        "attacks": [
          {
            "name": "Healing Herbs",
            "damage": "None",
            "effect": "Heals an ally for 3d8 HP. Offensively, can cast a charm: DC 15 Wis save or target is charmed for 1 minute."
          },
          {
            "name": "Serpentine Strike",
            "damage": "2d6 piercing +2d6 poison",
            "effect": "On a hit, DC 14 Con save or be poisoned for 1 round."
          }
        ]
      },
      {
        "name": "Meretseger",
        "origin": "Egyptian",
        "appearance": "A cobra-goddess who oversees justice, punishing the wicked.",
        "attacks": [
          {
            "name": "Venomous Judgment",
            "damage": "3d8 poison",
            "effect": "On a hit, if target has committed a recent injustice, DC 15 Cha save or be blinded by guilt for 1 round."
          },
          {
            "name": "Bite of Penance",
            "damage": "3d6 necrotic",
            "effect": "On a hit, target must make DC 15 Wis save or be cursed: disadvantage on attack rolls for 1 minute."
          }
        ]
      },
      {
        "name": "Mongolian Death Worm",
        "origin": "Mongolian cryptid",
        "appearance": "A large, blood-red worm said to spit acid and generate electricity.",
        "attacks": [
          {
            "name": "Acidic Spit",
            "damage": "3d8 acid",
            "effect": "A 20-foot line. DC 14 Dex save or target’s armor takes -1 AC if nonmagical. Creatures also take full damage on fail."
          },
          {
            "name": "Electric Shock",
            "damage": "3d6 lightning",
            "effect": "Melee range. On a hit, DC 14 Con save or stunned until end of Worm’s next turn."
          }
        ]
      },
      {
        "name": "Naga",
        "origin": "Worldwide (Hindu, Buddhist, Southeast Asian)",
        "appearance": "Serpents often with human heads or upper bodies, wise and magical.",
        "attacks": [
          {
            "name": "Spit Venom",
            "damage": "2d8 poison",
            "effect": "30-foot line. DC 14 Con save or poisoned for 1 minute. Poisoned creatures have disadvantage on saving throws."
          },
          {
            "name": "Serpent Spell",
            "damage": "Varies",
            "effect": "Naga can cast one spell (GM’s choice) at will. Often charm person or suggestion. DC based on Naga’s CR (e.g. DC 15)."
          }
        ]
      }
    ]
  },
  {
    "category": "Reptiles, Serpents, and Worms (continued)",
    "creatures": [
      {
        "name": "Níðhöggr",
        "origin": "Norse",
        "appearance": "A colossal serpent or dragon gnawing at the roots of the world tree Yggdrasil, associated with decay and darkness.",
        "attacks": [
          {
            "name": "Root Gnaw",
            "damage": "4d8 necrotic",
            "effect": "On a hit, target must make a DC 16 Constitution save or have disadvantage on saving throws for 1 minute due to soul-gnawing despair."
          },
          {
            "name": "Dark Maw",
            "damage": "4d10 necrotic",
            "effect": "Níðhöggr exhales a cloud of decay in a 30-foot cone. Targets must make DC 16 Wis save or be frightened for 1 minute."
          }
        ]
      },
      {
        "name": "Orm",
        "origin": "Scandinavian",
        "appearance": "A generic term for a serpentine dragon or worm, large and poisonous.",
        "attacks": [
          {
            "name": "Poison Fang",
            "damage": "3d8 poison",
            "effect": "On a hit, DC 14 Con save or be poisoned for 1 minute. While poisoned, target takes 1d4 poison damage each turn."
          },
          {
            "name": "Burrow Ambush",
            "damage": "None",
            "effect": "Orm can burrow underground and surprise attack. On the first attack after emerging, it has advantage."
          }
        ]
      },
      {
        "name": "Ouroboros",
        "origin": "Worldwide symbol",
        "appearance": "A serpent eating its own tail, symbolizing infinity. Might manifest as a cyclical dragon/serpent.",
        "attacks": [
          {
            "name": "Eternal Coil",
            "damage": "3d8 force",
            "effect": "On a hit, target must make DC 15 Wisdom save or become confused (as Confusion spell) for 1 minute, as they glimpse eternity."
          },
          {
            "name": "Time Loop",
            "damage": "None",
            "effect": "Once per short rest, Ouroboros can force a target within 30 feet to repeat its last action on its next turn, as if stuck in a loop (DC 15 Charisma save negates)."
          }
        ]
      },
      {
        "name": "Python",
        "origin": "Greek",
        "appearance": "A serpent slain by Apollo, large and earthbound, associated with oracles and rot.",
        "attacks": [
          {
            "name": "Swampy Breath",
            "damage": "3d6 poison",
            "effect": "A 20-foot cone of miasma. DC 14 Con save or be poisoned and blinded for 1 round."
          },
          {
            "name": "Constriction",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target is grappled (DC 15 Str save). While grappled, target takes 1d8 bludgeoning each turn."
          }
        ]
      },
      {
        "name": "Rainbow serpent",
        "origin": "Australian Aboriginal",
        "appearance": "A great serpent associated with creation, water, and the rainbow, often benevolent but can punish transgressors.",
        "attacks": [
          {
            "name": "Prismatic Spray",
            "damage": "Varies",
            "effect": "A 30-foot cone of rainbow light. Targets roll 1d8 for color (GM chooses effect akin to prismatic spray spell). DC 15 save of appropriate type."
          },
          {
            "name": "Waters of Life",
            "damage": "None",
            "effect": "Heals all allies within 20 feet for 2d8 HP, or if used offensively, creates difficult terrain (muddy water) for enemies."
          }
        ]
      },
      {
        "name": "Sea serpent",
        "origin": "Worldwide",
        "appearance": "A giant serpent dwelling in oceans, long and undulating.",
        "attacks": [
          {
            "name": "Tidal Coil",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, target in water must make DC 14 Str save or be pulled underwater and start drowning."
          },
          {
            "name": "Brine Spit",
            "damage": "3d6 cold",
            "effect": "A 20-foot line of salty water. DC 13 Dex save or be blinded by salt and take full damage."
          }
        ]
      },
      {
        "name": "Tarasque",
        "origin": "French",
        "appearance": "A legendary dragon-like creature with a turtle shell, lion’s head, and scaly tail, huge and formidable.",
        "attacks": [
          {
            "name": "Massive Chomp",
            "damage": "4d8 piercing",
            "effect": "On a hit, DC 16 Strength save or knocked prone. If prone, Tarasque’s next attack against that target deals +1d8 damage."
          },
          {
            "name": "Shell Bash",
            "damage": "4d6 bludgeoning",
            "effect": "A 10-foot radius stomp. Targets DC 15 Dex save or be knocked prone and take full damage."
          }
        ]
      },
      {
        "name": "Tsuchinoko",
        "origin": "Japanese",
        "appearance": "A small, stout snake said to have a mischievous nature and the ability to jump high.",
        "attacks": [
          {
            "name": "Trickster Bite",
            "damage": "2d6 poison",
            "effect": "On a hit, DC 12 Int save or target believes Tsuchinoko has vanished, giving Tsuchinoko advantage on its next attack."
          },
          {
            "name": "High Jump",
            "damage": "None",
            "effect": "Tsuchinoko can leap over creatures. Next melee attack gains +2 to hit from surprise angle."
          }
        ]
      },
      {
        "name": "Typhon",
        "origin": "Greek",
        "appearance": "A monstrous serpentine giant, father of monsters, with a hundred snake heads and terrible power.",
        "attacks": [
          {
            "name": "Hundred Serpent Strike",
            "damage": "6d8 varying (poison, fire, lightning)",
            "effect": "On a hit, target must make DC 18 Con save or be stunned 1 round, overwhelmed by chaotic energies."
          },
          {
            "name": "Storm Roar",
            "damage": "4d10 thunder",
            "effect": "A 60-foot cone of stormy wind. Targets DC 17 Str save or be pushed 20 feet and knocked prone."
          }
        ]
      },
      {
        "name": "Ur",
        "origin": "Germanic/Medieval bestiary",
        "appearance": "A primitive serpent said to dwell in remote areas, possibly huge and slow.",
        "attacks": [
          {
            "name": "Crushing Coil",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, target grappled (DC 14 escape). Grappled targets take 1d6 bludgeoning each turn."
          },
          {
            "name": "Hissing Lull",
            "damage": "None",
            "effect": "Targets within 20 feet DC 13 Wis save or fall asleep for 1 minute, lulled by rhythmic hissing."
          }
        ]
      },
      {
        "name": "Wyvern (repeated)",
        "note": "Already described under Reptiles, Limbed."
      },
      {
        "name": "Yamata no Orochi",
        "origin": "Japanese",
        "appearance": "An eight-headed and eight-tailed giant serpent, massive and fearsome.",
        "attacks": [
          {
            "name": "Eightfold Bite",
            "damage": "8d6 poison (1d6 per head)",
            "effect": "Roll to hit once; on success, deal 8d6. DC 16 Con save or paralyzed 1 round. If a head is cut off, two may grow back after a rest."
          },
          {
            "name": "River Flood",
            "damage": "3d8 bludgeoning",
            "effect": "A surge of water in a 30-foot radius. DC 15 Str save or be swept 20 feet away and knocked prone."
          }
        ]
      },
      {
        "name": "Zilant",
        "origin": "Tatar folklore",
        "appearance": "A winged snake or dragon, sometimes benevolent, perched over cities in legends.",
        "attacks": [
          {
            "name": "Winged Lash",
            "damage": "3d6 slashing",
            "effect": "On a hit, DC 14 Dex save or target is knocked prone by the gust of wings."
          },
          {
            "name": "Protective Aura",
            "damage": "None",
            "effect": "Allies within 20 feet gain resistance to poison and fire for 1 minute, as Zilant’s presence wards them."
          }
        ]
      }
    ]
  },
  {
    "category": "Rodents",
    "creatures": [
      {
        "name": "Afanc",
        "origin": "Welsh",
        "appearance": "A lake-dwelling beaver-like monster, sometimes described with crocodilian features and great strength.",
        "attacks": [
          {
            "name": "Crushing Bite",
            "damage": "3d6 piercing",
            "effect": "On a hit, DC 14 Strength save or be grappled. Grappled targets take 1d6 bludgeoning each turn as Afanc crushes them."
          },
          {
            "name": "Whirlpool Tail",
            "damage": "2d8 bludgeoning",
            "effect": "If in water, Afanc swirls its tail. Creatures in a 15-foot radius DC 14 Strength save or be pulled 10 feet closer and knocked prone."
          }
        ]
      },
      {
        "name": "Ratatoskr",
        "origin": "Norse",
        "appearance": "A giant squirrel that runs along Yggdrasil, messenger between eagle and serpent, clever and sly.",
        "attacks": [
          {
            "name": "Acorn Toss",
            "damage": "1d6 bludgeoning",
            "effect": "Ranged 30/60 ft. On a hit, target must DC 12 Dex save or be distracted, granting Ratatoskr advantage on its next attack."
          },
          {
            "name": "Chittering Insult",
            "damage": "None",
            "effect": "Forces DC 13 Wisdom save. On fail, target is enraged and must spend its next action attacking Ratatoskr if possible."
          }
        ]
      },
      {
        "name": "Rat king",
        "origin": "European folklore",
        "appearance": "Several rats with tails knotted together, moving as one swarm-like entity.",
        "attacks": [
          {
            "name": "Swarm Bite",
            "damage": "3d4 piercing",
            "effect": "Targets attacked by the Rat King swarm must make DC 13 Con save or be diseased, suffering disadvantage on Strength checks for 1 hour."
          },
          {
            "name": "Tangled Tail Trip",
            "damage": "None",
            "effect": "Targets in a 10-foot radius must DC 12 Dex save or be knocked prone by the writhing mass of tails."
          }
        ]
      },
      {
        "name": "Wolpertinger",
        "note": "Already described under Rabbits and hares."
      }
    ]
  },
  {
    "category": "Ungulates",
    "sub-category": "Antelopes and Deer",
    "creatures": [
      {
        "name": "Actaeon",
        "origin": "Greek",
        "appearance": "A hunter turned into a stag. A regal deer-man hybrid or simply a stag with a human’s sorrowful eyes.",
        "attacks": [
          {
            "name": "Antler Gore",
            "damage": "2d8 piercing",
            "effect": "On a hit, DC 13 Strength save or be pushed 10 feet. If Actaeon was once human, may hesitate (50% chance to do half damage)."
          },
          {
            "name": "Cursed Braying",
            "damage": "None",
            "effect": "All creatures within 30 feet DC 14 Wisdom save or be frightened for 1 round as they recall the tragic fate of Actaeon."
          }
        ]
      },
      {
        "name": "Ceryneian Hind",
        "origin": "Greek",
        "appearance": "A large, golden-horned hind sacred to Artemis. Swift, graceful, and magical.",
        "attacks": [
          {
            "name": "Golden Antlers",
            "damage": "2d6 radiant",
            "effect": "On a hit, target must DC 14 Wisdom save or be charmed for 1 round, awed by the hind’s divine beauty."
          },
          {
            "name": "Swift Hooves",
            "damage": "None",
            "effect": "Ceryneian Hind can take the Dash action as a bonus action, and opportunity attacks against it have disadvantage."
          }
        ]
      },
      {
        "name": "Deer Woman",
        "origin": "Native American",
        "appearance": "A spirit with a human female upper body and deer legs, known for luring humans away.",
        "attacks": [
          {
            "name": "Enthralling Gaze",
            "damage": "None",
            "effect": "One humanoid within 30 ft DC 14 Charisma save or be charmed, following Deer Woman away into the wilderness."
          },
          {
            "name": "Hoof Stomp",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 13 Dex save or be knocked prone."
          }
        ]
      },
      {
        "name": "Eikþyrnir",
        "origin": "Norse",
        "appearance": "A stag standing atop Valhalla, antlers dripping dew that forms all rivers.",
        "attacks": [
          {
            "name": "Dew Drop",
            "damage": "None",
            "effect": "Heals allies in a 30-foot radius for 2d8 HP. Offensively, can blind foes with sparkling droplets (DC 14 Con save or blinded 1 round)."
          },
          {
            "name": "Antler Bash",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, target must DC 14 Strength save or be pushed 10 feet and knocked prone."
          }
        ]
      },
      {
        "name": "Goldhorn (Zlatorog)",
        "origin": "Slavic",
        "appearance": "A white chamois or ibex with golden horns that can create healing flowers from its blood.",
        "attacks": [
          {
            "name": "Horn Pierce",
            "damage": "2d8 piercing",
            "effect": "On a hit, DC 14 Con save or take extra 1d4 radiant damage as the horns glow with magic."
          },
          {
            "name": "Healing Bloom",
            "damage": "None",
            "effect": "If Goldhorn is wounded, it can bleed a drop of blood that instantly grows a healing flower. Allies eating it regain 2d8 HP."
          }
        ]
      },
      {
        "name": "Jackalope (repeated)",
        "note": "Already described under Rabbits and hares."
      },
      {
        "name": "Keresh",
        "origin": "Jewish",
        "appearance": "A giant, elusive forest deer believed to be enormous and solitary.",
        "attacks": [
          {
            "name": "Crushing Hoof",
            "damage": "3d8 bludgeoning",
            "effect": "On a hit, DC 15 Strength save or be knocked prone and stunned for 1 round, due to immense size."
          },
          {
            "name": "Forest Aura",
            "damage": "None",
            "effect": "All plants in a 30 ft radius become difficult terrain for enemies only. Allies move unhindered."
          }
        ]
      },
      {
        "name": "Peryton",
        "origin": "Greek via Argentina",
        "appearance": "A stag with bird’s wings, casting a human shadow. Often associated with prophecy and doom.",
        "attacks": [
          {
            "name": "Aerial Gore",
            "damage": "3d6 piercing",
            "effect": "If diving from above, deal extra 1d6 damage and DC 14 Dex save or target drops a held item."
          },
          {
            "name": "Shadow Omen",
            "damage": "None",
            "effect": "Target within 30 ft must DC 15 Wis save or become frightened for 1 minute, seeing a shadow of their own demise."
          }
        ]
      },
      {
        "name": "Qilin",
        "origin": "Chinese",
        "appearance": "A chimera of deer, dragon, and other creatures, benevolent and brings good fortune.",
        "attacks": [
          {
            "name": "Hoof of Harmony",
            "damage": "2d8 radiant",
            "effect": "On a hit, DC 14 Cha save or target’s next attack roll is at disadvantage, calmed by Qilin’s aura."
          },
          {
            "name": "Blessed Mist",
            "damage": "None",
            "effect": "Allies in 20 ft regain 2d8 HP and remove one disease or poison. Offensively, can force evil creatures in area DC 15 Wis save or lose their next bonus action."
          }
        ]
      },
      {
        "name": "Tarand (Parandrus)",
        "origin": "European bestiaries",
        "appearance": "A deer-like creature that can change the color of its fur to blend in, large and elusive.",
        "attacks": [
          {
            "name": "Chameleonic Charge",
            "damage": "2d8 bludgeoning",
            "effect": "Attacks made from hiding or camouflaged status have advantage and deal +1d6 damage."
          },
          {
            "name": "Color Shift",
            "damage": "None",
            "effect": "Tarand becomes effectively invisible in natural terrain (DC 16 Perception to spot). Next attack after shifting is at advantage."
          }
        ]
      },
      {
        "name": "White stag",
        "origin": "Worldwide",
        "appearance": "A white deer of mythical significance, often a symbol of purity or guiding omen.",
        "attacks": [
          {
            "name": "Purifying Horn",
            "damage": "2d6 radiant",
            "effect": "On a hit, DC 13 Wis save or be charmed for 1 minute, unable to harm the stag."
          },
          {
            "name": "Guiding Light",
            "damage": "None",
            "effect": "A soft glow surrounds allies, granting +1 to attack rolls and saving throws for 1 minute."
          }
        ]
      },
      {
        "name": "Xeglun",
        "origin": "Tungusic",
        "appearance": "A celestial elk or deer associated with the heavens, possibly guiding shamans.",
        "attacks": [
          {
            "name": "Starry Antlers",
            "damage": "3d6 radiant",
            "effect": "On a hit, DC 14 Con save or target’s darkvision is negated for 1 minute as starlight blinds their supernatural sight."
          },
          {
            "name": "Celestial Leap",
            "damage": "None",
            "effect": "Xeglun can teleport up to 30 ft in starlight. Next attack after teleportation deals +1d6 radiant damage."
          }
        ]
      }
    ]
  },
  {
    "category": "Ungulates",
    "sub-category": "Bovines",
    "creatures": [
      {
        "name": "Auðumbla",
        "origin": "Norse",
        "appearance": "A primeval cow who licked the ice of Ginnungagap, uncovering the first gods.",
        "attacks": [
          {
            "name": "Icy Lick",
            "damage": "2d8 cold",
            "effect": "On a hit, DC 14 Con save or target’s speed halved due to freezing saliva."
          },
          {
            "name": "Primordial Nourish",
            "damage": "None",
            "effect": "Auðumbla can heal allies for 3d8 HP with her milk. Offensively, can force enemies to DC 15 Wis save or be calmed, unable to attack for 1 round."
          }
        ]
      },
      {
        "name": "Bai Ze",
        "origin": "Chinese",
        "appearance": "A white chimera-like bovine creature with multiple eyes and horns, wise and knowledgeable of all creatures.",
        "attacks": [
          {
            "name": "Multi-Eye Glare",
            "damage": "2d6 psychic",
            "effect": "A 20-ft cone. DC 14 Int save or be stunned 1 round by the overwhelming knowledge."
          },
          {
            "name": "Horn Bash",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, DC 14 Str save or be knocked prone."
          }
        ]
      },
      {
        "name": "Kujata",
        "origin": "Arabic",
        "appearance": "A cosmic bull supporting the earth, with 40,000 eyes, horns, and limbs, immense and celestial.",
        "attacks": [
          {
            "name": "Cosmic Stomp",
            "damage": "6d8 bludgeoning",
            "effect": "A 30-ft radius quake. DC 17 Str save or be knocked prone and deafened 1 round."
          },
          {
            "name": "All-Seeing Gaze",
            "damage": "None",
            "effect": "Forces DC 16 Wis save. On fail, target is overwhelmed by cosmic truths, taking 3d6 psychic damage and disadvantage on next attack."
          }
        ]
      },
      {
        "name": "Bicorn and Chichevache",
        "origin": "Medieval European",
        "appearance": "Bicorn (feeds on kind husbands) is plump and well-fed, Chichevache (feeds on faithful wives) is gaunt and skeletal bovine.",
        "attacks": [
          {
            "name": "Moral Judgement",
            "damage": "3d6 psychic",
            "effect": "On a hit, DC 14 Charisma save or target confesses a moral failing, frightened for 1 round."
          },
          {
            "name": "Gnawing Maw",
            "damage": "2d8 piercing",
            "effect": "On a hit, target must DC 13 Dex save or drop one held item."
          }
        ]
      },
      {
        "name": "Bonnacon",
        "origin": "Medieval Bestiary",
        "appearance": "A bull-like creature with inward-curving horns, that expels flaming dung as a weapon.",
        "attacks": [
          {
            "name": "Flaming Dung Spray",
            "damage": "3d8 fire",
            "effect": "30-ft cone. DC 15 Dex save or catch fire (1d6 fire damage per turn until extinguished)."
          },
          {
            "name": "Hornless Charge",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit after a 20-ft run, DC 14 Str save or be knocked prone."
          }
        ]
      },
      {
        "name": "Hodag",
        "origin": "American (Wisconsin lumberjack folklore)",
        "appearance": "A bull-like creature combined with reptilian features, horned and mean-looking.",
        "attacks": [
          {
            "name": "Horn Gore",
            "damage": "3d6 piercing",
            "effect": "On a hit, DC 14 Con save or be stunned 1 round, shocked by the ferocity."
          },
          {
            "name": "Smoke Snort",
            "damage": "2d6 poison",
            "effect": "A 15-ft cone of foul breath. DC 13 Con save or poisoned until end of next turn."
          }
        ]
      }
    ]
  },
  {
    "category": "Ungulates",
    "sub-category": "Camelids",
    "creatures": [
      {
        "name": "Allocamelus",
        "origin": "Heraldry",
        "appearance": "A legendary creature with the body of a camel and the head of a donkey.",
        "attacks": [
          {
            "name": "Baffling Bray",
            "damage": "None",
            "effect": "All creatures within 20 feet must succeed on a DC 13 Wisdom save or become distracted, granting the Allocamelus advantage on its next attack."
          },
          {
            "name": "Hump Charge",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, DC 14 Strength save or the target is knocked prone by the surprising force of the camelid hybrid."
          }
        ]
      },
      {
        "name": "Heavenly Llama",
        "origin": "Andean/Various",
        "appearance": "A mystical llama often associated with the heavens, its wool shimmering with starlight.",
        "attacks": [
          {
            "name": "Star Flare Spit",
            "damage": "2d6 radiant",
            "effect": "On a hit, DC 14 Constitution save or be blinded for 1 round by the brilliant flash."
          },
          {
            "name": "Celestial Wool",
            "damage": "None",
            "effect": "Heavenly Llama can provide a calming aura; allies within 20 feet gain advantage on Wisdom saves for 1 minute."
          }
        ]
      }
    ]
  },
  {
    "category": "Ungulates",
    "sub-category": "Caprids",
    "creatures": [
      {
        "name": "Amalthea",
        "origin": "Greek",
        "appearance": "The goat that nurtured Zeus, often depicted as a gentle, divine goat with abundant milk.",
        "attacks": [
          {
            "name": "Nurturing Milk",
            "damage": "None",
            "effect": "Allies within 10 feet regain 2d6 HP. Offensively can dazzle a foe (DC 13 Wis save) causing them to lose their next reaction."
          },
          {
            "name": "Horn Jab",
            "damage": "2d6 piercing",
            "effect": "On a hit, DC 12 Strength save or be pushed 5 feet away."
          }
        ]
      },
      {
        "name": "Aries",
        "origin": "Astrology/Greek",
        "appearance": "A celestial ram, often golden-fleeced, representing the zodiac sign.",
        "attacks": [
          {
            "name": "Zodiac Charge",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, if Aries moved 20 ft beforehand, target must DC 14 Dex save or be knocked prone."
          },
          {
            "name": "Starry Fleece",
            "damage": "None",
            "effect": "Allies within 20 feet gain +1 to AC for 1 minute as constellations shimmer in its wool."
          }
        ]
      },
      {
        "name": "Barometz (Vegetable Lamb)",
        "origin": "Medieval bestiary",
        "appearance": "A plant that resembles a lamb, rooted to the earth but able to move slightly.",
        "attacks": [
          {
            "name": "Spore Puff",
            "damage": "2d6 poison",
            "effect": "A 15-foot radius cloud. DC 13 Con save or be poisoned for 1 minute. While poisoned, target sneezes uncontrollably (no reactions)."
          },
          {
            "name": "Root Whip",
            "damage": "2d4 slashing",
            "effect": "On a hit, DC 12 Strength save or the target is restrained by roots until they spend an action to break free."
          }
        ]
      },
      {
        "name": "Capricornus",
        "origin": "Astrology/Greek",
        "appearance": "A mythical sea-goat, half goat and half fish, associated with the zodiac.",
        "attacks": [
          {
            "name": "Marine Horn",
            "damage": "2d8 piercing",
            "effect": "On a hit, if in water, DC 14 Strength save or target is dragged underwater, starting to suffocate if it cannot breathe water."
          },
          {
            "name": "Tidal Blessing",
            "damage": "None",
            "effect": "Allies within 20 feet gain advantage on Dexterity saves for 1 minute, moving gracefully like fish."
          }
        ]
      },
      {
        "name": "Chimera",
        "note": "Already described under Lions."
      },
      {
        "name": "Dahu",
        "origin": "French/Swiss folklore",
        "appearance": "A goat-like animal with legs shorter on one side, adapted to mountain slopes.",
        "attacks": [
          {
            "name": "Sideways Charge",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 12 Dex save or the target is knocked off balance (disadvantage on next attack roll)."
          },
          {
            "name": "Mountain Shuffle",
            "damage": "None",
            "effect": "Dahu can move along sheer cliffs without checks. If it attacks after climbing, deal +1d6 damage on that attack."
          }
        ]
      },
      {
        "name": "Faun",
        "origin": "Roman",
        "appearance": "A human with goat legs, akin to satyrs, playful, music-loving woodland spirits.",
        "attacks": [
          {
            "name": "Panpipe Melody",
            "damage": "None",
            "effect": "All enemies in 30 ft DC 14 Wis save or be charmed, swaying and losing their next reaction."
          },
          {
            "name": "Hoof Kick",
            "damage": "2d4 bludgeoning",
            "effect": "On a hit, DC 12 Strength save or fall prone."
          }
        ]
      },
      {
        "name": "Heiðrún",
        "origin": "Norse",
        "appearance": "A goat in Valhalla whose udders produce mead for the Einherjar.",
        "attacks": [
          {
            "name": "Mead Spray",
            "damage": "None",
            "effect": "Allies within 15 ft regain 1d8 HP and gain advantage on their next attack roll. Enemies caught in it must DC 13 Wis save or be drowsy (disadvantage on next attack)."
          },
          {
            "name": "Divine Horn",
            "damage": "3d6 radiant",
            "effect": "On a hit, DC 14 Con save or blinded by divine light for 1 round."
          }
        ]
      },
      {
        "name": "Khnum",
        "origin": "Egyptian",
        "appearance": "A ram-headed god who fashions humans from clay on a potter’s wheel.",
        "attacks": [
          {
            "name": "Clay Shaping",
            "damage": "None",
            "effect": "Khnum can mold earth within 10 ft. Offensively, can encase a target’s feet in clay (DC 15 Str save or speed halved)."
          },
          {
            "name": "Ram Charge",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, DC 15 Str save or be knocked prone and stunned 1 round due to divine force."
          }
        ]
      },
      {
        "name": "Satyr",
        "origin": "Greek",
        "appearance": "A half-goat, half-man reveler associated with Dionysus, trickery, and merriment.",
        "attacks": [
          {
            "name": "Revelry Pipes",
            "damage": "None",
            "effect": "DC 14 Wis save or enemies become charmed, dancing uncontrollably and losing their next action."
          },
          {
            "name": "Goading Horns",
            "damage": "2d6 piercing",
            "effect": "On a hit, DC 13 Wis save or the target must attack the Satyr next turn if possible, taunted by its mockery."
          }
        ]
      },
      {
        "name": "Sidehill gouger",
        "origin": "American tall tales",
        "appearance": "A goat-like creature adapted to hillsides, legs shorter on one side like the Dahu.",
        "attacks": [
          {
            "name": "Hillside Tackle",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 12 Dex save or rolled down the hill (move 10 ft involuntarily, fall prone)."
          },
          {
            "name": "Gravity Shift",
            "damage": "None",
            "effect": "If fighting on uneven terrain, Gouger can cause enemies to have disadvantage on Acrobatics checks."
          }
        ]
      },
      {
        "name": "Tanngrisnir and Tanngnjóstr",
        "origin": "Norse",
        "appearance": "Thor’s magical goats that pull his chariot, resurrected each day after being eaten.",
        "attacks": [
          {
            "name": "Thunderous Hooves",
            "damage": "3d6 thunder",
            "effect": "A 15-ft cone shockwave. DC 14 Con save or be deafened 1 minute."
          },
          {
            "name": "Rebirth Feast",
            "damage": "None",
            "effect": "If slain, can be resurrected if bones are not broken. Offensively, can distract a target (DC 13 Wis save) causing it to lose next reaction."
          }
        ]
      },
      {
        "name": "Chrysomallos",
        "origin": "Greek",
        "appearance": "A golden-fleeced ram whose wool was sought as the Golden Fleece.",
        "attacks": [
          {
            "name": "Golden Charge",
            "damage": "3d6 radiant",
            "effect": "On a hit, DC 14 Wis save or target is blinded by shimmering fleece 1 round."
          },
          {
            "name": "Wool of Inspiration",
            "damage": "None",
            "effect": "Allies within 20 ft gain +2 on saving throws for 1 minute. Enemies must DC 14 Charisma save or be intimidated, having disadvantage on Intimidation checks."
          }
        ]
      }
    ]
  },
  {
    "category": "Ungulates",
    "sub-category": "Equines",
    "creatures": [
      {
        "name": "Anggitay",
        "origin": "Philippines",
        "appearance": "A creature with the upper body of a beautiful woman and the lower body of a horse, similar to a centaur but exclusively female.",
        "attacks": [
          {
            "name": "Hoof Strike",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, DC 13 Strength save or be knocked prone by the powerful kick."
          },
          {
            "name": "Alluring Song",
            "damage": "None",
            "effect": "One humanoid within 30 ft must make DC 14 Wisdom save or be charmed for 1 minute, drawn by Anggitay’s enchanting voice."
          }
        ]
      },
      {
        "name": "Arion",
        "origin": "Greek",
        "appearance": "An immortal, swift horse capable of human speech, offspring of Poseidon.",
        "attacks": [
          {
            "name": "Lightning Gallop",
            "damage": "2d6 bludgeoning",
            "effect": "If Arion moves 30 ft before attacking, target makes DC 14 Dex save or be knocked prone and stunned 1 round."
          },
          {
            "name": "Divine Neigh",
            "damage": "None",
            "effect": "All allies within 30 ft gain +10 ft movement and advantage on Initiative rolls for 1 minute."
          }
        ]
      },
      {
        "name": "Balius and Xanthus",
        "origin": "Greek",
        "appearance": "Immortal horses of Achilles, offspring of harpies, swift and intelligent.",
        "attacks": [
          {
            "name": "Twin Kick",
            "damage": "3d6 bludgeoning",
            "effect": "If both horses are present, they attack in tandem. On a hit, DC 14 Strength save or target is knocked back 10 ft."
          },
          {
            "name": "Prophetic Whinny",
            "damage": "None",
            "effect": "They can foretell danger. Allies within 20 ft gain +2 on saving throws vs traps or ambushes for 10 minutes."
          }
        ]
      },
      {
        "name": "Buraq",
        "origin": "Islamic",
        "appearance": "A celestial steed from heaven, part mule, part donkey, with wings, who carried prophets.",
        "attacks": [
          {
            "name": "Skybound Kick",
            "damage": "3d6 radiant",
            "effect": "On a hit, DC 15 Con save or be blinded by holy light for 1 round."
          },
          {
            "name": "Celestial Flight",
            "damage": "None",
            "effect": "Buraq can travel great distances instantly (misty step-like ability). Allies within 10 ft can teleport with it once per day."
          }
        ]
      },
      {
        "name": "Centaur",
        "origin": "Greek",
        "appearance": "A creature with the upper body of a human and the lower body of a horse.",
        "attacks": [
          {
            "name": "Hoof Stomp",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 13 Strength save or be knocked prone."
          },
          {
            "name": "Archery Volley",
            "damage": "2d8 piercing",
            "effect": "Ranged attack. If at least two other centaurs are attacking the same target, deal +1d8 damage due to coordinated fire."
          }
        ]
      },
      {
        "name": "Cheval Gauvin",
        "origin": "French/Swiss",
        "appearance": "A horse that tries to kill its rider by galloping into dangerous areas.",
        "attacks": [
          {
            "name": "Lethal Gallop",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, DC 14 Dex save or rider is thrown off, taking fall damage and becoming prone."
          },
          {
            "name": "Deadly Sprint",
            "damage": "None",
            "effect": "If Cheval Gauvin moves more than 40 ft straight toward a target before attacking, it deals +1d6 damage on its next attack."
          }
        ]
      },
      {
        "name": "Cheval Mallet",
        "origin": "French",
        "appearance": "A cursed horse that tempts weary travelers and kidnaps them. Appears as a fine steed, but leads riders to doom.",
        "attacks": [
          {
            "name": "Malevolent Mount",
            "damage": "None",
            "effect": "If a creature mounts it, DC 15 Wis save or become charmed and compelled to ride into dangerous terrain."
          },
          {
            "name": "Nightmare Charge",
            "damage": "3d6 psychic",
            "effect": "On a hit, DC 14 Wis save or be frightened 1 minute as visions of doom fill the target’s mind."
          }
        ]
      },
      {
        "name": "Chiron",
        "origin": "Greek",
        "appearance": "A wise and noble centaur, mentor of heroes, unlike other centaurs known for wisdom and healing arts.",
        "attacks": [
          {
            "name": "Guiding Arrow",
            "damage": "2d8 piercing",
            "effect": "On a hit, an ally of Chiron’s choice gains advantage on their next attack against the same target."
          },
          {
            "name": "Healing Touch",
            "damage": "None",
            "effect": "Chiron can heal a creature for 3d8 HP and remove one poison or disease. Offensively can choose to deal nonlethal damage at will."
          }
        ]
      },
      {
        "name": "Chollima",
        "origin": "Chinese/Korean",
        "appearance": "A winged horse too swift to be mounted by any mortal, symbolic of unattainable speed.",
        "attacks": [
          {
            "name": "Uncatchable Dash",
            "damage": "None",
            "effect": "Chollima can take the Dash action as a bonus action, and opportunity attacks against it have disadvantage."
          },
          {
            "name": "Aerial Buck",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 13 Strength save or target is knocked 10 ft away and if target is airborne, it falls."
          }
        ]
      },
      {
        "name": "Drapé",
        "origin": "France",
        "appearance": "A ghostly horse monster that finds children wandering at night and spirits them away.",
        "attacks": [
          {
            "name": "Spectral Whinny",
            "damage": "2d6 necrotic",
            "effect": "DC 14 Wis save or target is frightened for 1 minute. They hear phantom hoofbeats closing in from all sides."
          },
          {
            "name": "Nightmare Grab",
            "damage": "None",
            "effect": "If attacking a child or a small creature, DC 13 Str save or be grabbed and carried off. Victim is restrained until freed."
          }
        ]
      },
      {
        "name": "Gytrash",
        "origin": "English",
        "appearance": "A shapeshifting spirit usually in the form of a horse, mule, or other animal that guides lost travelers home.",
        "attacks": [
          {
            "name": "Illusory Path",
            "damage": "None",
            "effect": "Enemies in 30 ft must DC 14 Int save or see misleading paths. They have disadvantage on Survival checks for 10 minutes."
          },
          {
            "name": "Kind Guide",
            "damage": "None",
            "effect": "If acting benevolently, allies gain advantage on next Perception or Navigation check. If acting maliciously, can lead a target into ambush (next enemy attack against that target has advantage)."
          }
        ]
      },
      {
        "name": "Haizum",
        "origin": "Islamic",
        "appearance": "The horse of the archangel Gabriel, radiant and swift.",
        "attacks": [
          {
            "name": "Radiant Hoof",
            "damage": "3d6 radiant",
            "effect": "On a hit, DC 15 Con save or blinded by holy light for 1 round."
          },
          {
            "name": "Winged Sprint",
            "damage": "None",
            "effect": "Haizum can Fly at double speed for one turn, and allies who see it gain +1 to their next saving throw."
          }
        ]
      },
      {
        "name": "Hippogriff",
        "origin": "French/English",
        "appearance": "A creature with the front body of an eagle and the hind body of a horse.",
        "attacks": [
          {
            "name": "Beak Strike",
            "damage": "2d8 piercing",
            "effect": "If attacking from above, target DC 13 Dex save or be knocked prone."
          },
          {
            "name": "Hoof Rake",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 13 Strength save or target’s movement is halved next turn."
          }
        ]
      },
      {
        "name": "Ipotane",
        "origin": "Greek",
        "appearance": "A half-horse, half-human creature considered the original centaurs, often more docile.",
        "attacks": [
          {
            "name": "Gentle Hooves",
            "damage": "2d4 bludgeoning",
            "effect": "On a hit, DC 12 Str save or be pushed 5 ft. Less aggressive, often nonlethal."
          },
          {
            "name": "Shared Wisdom",
            "damage": "None",
            "effect": "Allies in 10 ft gain +1 to Int and Wis checks for 1 hour. If used offensively, can force a DC 14 Wis save to distract a foe with philosophical musings (foe loses next reaction)."
          }
        ]
      },
      {
        "name": "Karkadann",
        "origin": "India/Persia",
        "appearance": "A monstrous unicorn-like creature, extremely aggressive, with a horn reputed to neutralize poison.",
        "attacks": [
          {
            "name": "Savage Horn",
            "damage": "3d8 piercing",
            "effect": "On a hit, DC 15 Str save or be lifted and thrown 10 ft, taking 1d6 falling damage."
          },
          {
            "name": "Anti-Poison Aura",
            "damage": "None",
            "effect": "All creatures within 10 ft are immune to poison. If used offensively, can instead force a poison-afflicted enemy to DC 14 Con save or take an extra 2d6 radiant as toxins are violently purged."
          }
        ]
      },
      {
        "name": "Kotobuki",
        "origin": "Japanese",
        "appearance": "A yokai made up of all the Chinese zodiac animals combined, often symbolizing longevity.",
        "attacks": [
          {
            "name": "Zodiac Strike",
            "damage": "4d6 mixed (bludgeoning, slashing, fire, etc.)",
            "effect": "On a hit, roll 1d12 to determine extra effect (GM’s choice, e.g. poison, stun, etc.)."
          },
          {
            "name": "Longevity Blessing",
            "damage": "None",
            "effect": "Allies in 20 ft regain 2d8 HP and gain +1 to all saves for 1 minute. Offensively, can force enemies to age 1 year (no immediate effect unless story-driven)."
          }
        ]
      },
      {
        "name": "Longma",
        "origin": "Chinese",
        "appearance": "A winged horse with dragon scales, symbol of power and nobility.",
        "attacks": [
          {
            "name": "Scaled Hoof",
            "damage": "3d6 slashing",
            "effect": "On a hit, DC 14 Con save or target takes 1d4 bleeding damage each turn until healed."
          },
          {
            "name": "Draconic Flight",
            "damage": "None",
            "effect": "Longma can fly at double speed and all allies seeing its majestic form gain advantage on their next attack roll."
          }
        ]
      },
      {
        "name": "Mankayia",
        "origin": "Kiowa",
        "appearance": "A tornado spirit in the form of a horse, associated with whirlwinds.",
        "attacks": [
          {
            "name": "Whirlwind Kick",
            "damage": "3d6 bludgeoning",
            "effect": "A 15 ft cone gust. DC 14 Str save or be knocked prone and pushed 10 ft."
          },
          {
            "name": "Storm Gallop",
            "damage": "None",
            "effect": "Mankayia moves through enemies’ spaces. Those enemies must DC 14 Dex save or take 2d6 lightning damage from static discharge."
          }
        ]
      },
      {
        "name": "Onocentaur",
        "origin": "Greek",
        "appearance": "A half-human, half-donkey creature, similar to a centaur but donkey-bodied.",
        "attacks": [
          {
            "name": "Donkey Kick",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 12 Str save or target’s speed halved next turn."
          },
          {
            "name": "Braying Taunt",
            "damage": "None",
            "effect": "DC 13 Wis save or target must attack Onocentaur next turn if able, distracted by the obnoxious braying."
          }
        ]
      },
      {
        "name": "Pegasus",
        "origin": "Greek",
        "appearance": "A winged horse, pure white and noble.",
        "attacks": [
          {
            "name": "Wing Buffet",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 13 Dex save or be knocked prone by a gust of wind from its wings."
          },
          {
            "name": "Soaring Grace",
            "damage": "None",
            "effect": "Allies within 20 ft gain advantage on saving throws against fear for 1 minute. If used offensively, can blind a foe with reflected sunlight (DC 14 Con save or blinded 1 round)."
          }
        ]
      },
      {
        "name": "Pooka",
        "origin": "Irish",
        "appearance": "A shape-shifting spirit often appearing as a dark horse with glowing eyes, sometimes beneficial, often mischievous.",
        "attacks": [
          {
            "name": "Illusory Form",
            "damage": "None",
            "effect": "DC 14 Int save or target sees Pooka as a harmless animal and will not attack it unless harmed first."
          },
          {
            "name": "Nightmare Ride",
            "damage": "3d6 psychic",
            "effect": "If a creature mounts it unwillingly, DC 14 Wis save or be frightened, seeing visions of terrible journeys."
          }
        ]
      },
      {
        "name": "Sleipnir",
        "origin": "Norse",
        "appearance": "Odin’s eight-legged horse, fastest of all horses, can travel between worlds.",
        "attacks": [
          {
            "name": "Eight-Legged Stomp",
            "damage": "4d6 bludgeoning",
            "effect": "On a hit, DC 15 Str save or be knocked prone and stunned 1 round, overwhelmed by the flurry of legs."
          },
          {
            "name": "World-Strider",
            "damage": "None",
            "effect": "Sleipnir can teleport up to 100 ft, passing through dimensions. Allies witnessing this gain advantage on their next Arcana check."
          }
        ]
      },
      {
        "name": "Sihuanaba",
        "origin": "Central American",
        "appearance": "A shapeshifting spirit that often appears as a beautiful woman from behind, but with a horse’s face when seen from the front.",
        "attacks": [
          {
            "name": "Horrific Reveal",
            "damage": "2d8 psychic",
            "effect": "One target seeing her true face must DC 14 Wis save or be frightened for 1 minute."
          },
          {
            "name": "Deceptive Allure",
            "damage": "None",
            "effect": "DC 15 Cha save or target is charmed, following her into dangerous terrain. If attacked while charmed, they lose 1 turn in confusion."
          }
        ]
      },
      {
        "name": "Tikbalang",
        "origin": "Philippines",
        "appearance": "A tall, lanky humanoid with the head and limbs of a horse, known for trickery in the forests.",
        "attacks": [
          {
            "name": "Spindly Kick",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, DC 14 Dex save or target’s AC is reduced by 1 next round due to disorientation."
          },
          {
            "name": "Forest Illusion",
            "damage": "None",
            "effect": "DC 15 Int save or target becomes lost, treating all directions as reversed for 10 minutes."
          }
        ]
      },
      {
        "name": "Uchchaihshravas",
        "origin": "Hindu",
        "appearance": "A seven-headed, all-white flying horse, considered the king of horses.",
        "attacks": [
          {
            "name": "Seven-Voiced Neigh",
            "damage": "3d8 thunder",
            "effect": "A 30 ft cone. DC 15 Con save or deafened 1 minute, and lose next reaction."
          },
          {
            "name": "Radiant Flight",
            "damage": "None",
            "effect": "Allies within 30 ft gain +2 on attack rolls for 1 minute as the aura of purity inspires them."
          }
        ]
      },
      {
        "name": "Unicorn",
        "origin": "Worldwide",
        "appearance": "A horse-like creature with a single horn, often symbolizing purity and grace.",
        "attacks": [
          {
            "name": "Horn of Purity",
            "damage": "3d6 radiant",
            "effect": "On a hit, DC 15 Wis save or be charmed (if non-evil). Evil creatures must DC 15 Con save or take extra 2d6 radiant."
          },
          {
            "name": "Healing Touch",
            "damage": "None",
            "effect": "Unicorn can heal a creature for 4d8 HP and remove one curse. Offensively, can choose to blind a foe with a flash of hornlight (DC 14 Con save)."
          }
        ]
      },
      {
        "name": "Winged unicorn",
        "origin": "Various modern/fantasy",
        "appearance": "A unicorn with wings, combining the virtues of Pegasus and Unicorn.",
        "attacks": [
          {
            "name": "Celestial Horn",
            "damage": "3d8 radiant",
            "effect": "On a hit, DC 15 Cha save or target is stunned by overwhelming grace for 1 round."
          },
          {
            "name": "Wings of Mercy",
            "damage": "None",
            "effect": "All allies within 30 ft regain 2d8 HP and remove one level of exhaustion. Enemies must DC 15 Wis save or be unwilling to attack for 1 round."
          }
        ]
      }
    ]
  },
  {
    "category": "Pachyderms",
    "creatures": [
      {
        "name": "Abath",
        "origin": "Unclear/obscure",
        "appearance": "A mythical elephant-like creature, often large with rough dark skin and oversized tusks, possibly a local legend.",
        "attacks": [
          {
            "name": "Tusk Gore",
            "damage": "3d8 piercing",
            "effect": "On a hit, DC 15 Strength save or be knocked prone. If prone, Abath deals +1d6 damage on its next attack against that target."
          },
          {
            "name": "Trampling Charge",
            "damage": "4d6 bludgeoning",
            "effect": "If Abath moves at least 20 ft straight toward a target before attacking, that target DC 15 Dex save or be knocked prone and stunned 1 round due to the force of impact."
          }
        ]
      },
      {
        "name": "Baku",
        "origin": "Japanese",
        "appearance": "A tapir-like dream-eating spirit with an elephant’s trunk, often depicted with a chimera of animal parts.",
        "attacks": [
          {
            "name": "Dream Consumption",
            "damage": "2d8 psychic",
            "effect": "On a hit (melee spell attack), DC 14 Wis save or target falls asleep (as the Sleep spell) for 1 minute. If asleep, Baku can choose to restore 2d8 HP by devouring their nightmares."
          },
          {
            "name": "Trunk Bash",
            "damage": "2d6 bludgeoning",
            "effect": "On a hit, DC 13 Strength save or be knocked back 5 ft. If used on a sleeping target, deals max damage automatically."
          }
        ]
      },
      {
        "name": "Behemoth",
        "origin": "Biblical/Judeo-Christian",
        "appearance": "A colossal land beast, often compared to a massive hippopotamus or elephant, unmovable and strong.",
        "attacks": [
          {
            "name": "Titanic Stomp",
            "damage": "5d8 bludgeoning",
            "effect": "30 ft radius quake. DC 17 Strength save or all creatures fall prone. Structures take double damage."
          },
          {
            "name": "Mighty Bellow",
            "damage": "3d8 thunder",
            "effect": "A 60 ft cone roar. DC 16 Con save or be deafened 1 minute and pushed 10 ft back."
          }
        ]
      },
      {
        "name": "Quugaarpak",
        "origin": "Inuit",
        "appearance": "A mythical underworld creature believed to be the explanation for mammoth remains. A massive tusked beast that tunnels upward but dies upon breathing surface air.",
        "attacks": [
          {
            "name": "Burrow Strike",
            "damage": "4d6 bludgeoning",
            "effect": "On a hit, DC 15 Dex save or target is partially buried in earth, restraining them (escape DC 14)."
          },
          {
            "name": "Underworld Tusk",
            "damage": "3d8 piercing",
            "effect": "On a hit, DC 14 Con save or target’s max HP is reduced by amount equal to half the damage dealt until a long rest."
          }
        ]
      },
      {
        "name": "Taweret",
        "origin": "Egyptian",
        "note": "Already described under Lion category (as a hippo-lion-croc mix)."
      }
    ]
  },
  {
    "category": "Pigs and Boars",
    "creatures": [
      {
        "name": "Calydonian Boar",
        "origin": "Greek",
        "appearance": "A gigantic, savage boar sent by Artemis, with razor-sharp tusks and bristly hide.",
        "attacks": [
          {
            "name": "Tusk Gore",
            "damage": "3d8 slashing",
            "effect": "On a hit, DC 15 Str save or target is knocked prone. Bleeding wound: target takes 1d4 damage at start of each turn until healed."
          },
          {
            "name": "Furious Charge",
            "damage": "4d6 bludgeoning",
            "effect": "If moves 20 ft straight before attack, target DC 14 Dex save or be pushed 10 ft and stunned 1 round."
          }
        ]
      },
      {
        "name": "Erymanthian Boar",
        "origin": "Greek",
        "appearance": "Another colossal boar hunted by Heracles, infamous for its ferocity and strength.",
        "attacks": [
          {
            "name": "Thunderous Snort",
            "damage": "2d8 thunder",
            "effect": "A 15 ft cone. DC 14 Con save or be deafened for 1 minute. Creatures deafened this way have disadvantage on Perception checks."
          },
          {
            "name": "Trample",
            "damage": "4d6 bludgeoning",
            "effect": "On a hit against a prone target, deals double damage. DC 15 Strength save or also grappled under its hooves."
          }
        ]
      },
      {
        "name": "Zhu Bajie",
        "origin": "Chinese (Journey to the West)",
        "appearance": "A half-man, half-pig character, wielding a nine-toothed rake, lazy but strong.",
        "attacks": [
          {
            "name": "Rake Strike",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, DC 14 Dex save or target’s AC is reduced by 1 for 1 round as their armor is dented."
          },
          {
            "name": "Gluttonous Charge",
            "damage": "2d8 slashing",
            "effect": "If Zhu Bajie moved 20 ft before hitting, target DC 13 Wis save or be distracted by his crude taunts, granting Zhu Bajie advantage on next attack."
          }
        ]
      }
    ]
  },
  {
    "category": "Xenarthrans",
    "creatures": [
      {
        "name": "Mapinguari",
        "origin": "Brazilian/Amazonian folklore",
        "appearance": "A giant sloth-like creature with tough skin, a giant mouth on its belly, and foul odor.",
        "attacks": [
          {
            "name": "Belly Maw Bite",
            "damage": "4d6 piercing",
            "effect": "On a hit, DC 15 Str save or be grappled. Grappled targets take 1d6 acid damage each turn inside the maw."
          },
          {
            "name": "Horrid Stench",
            "damage": "2d8 poison",
            "effect": "20 ft radius. DC 14 Con save or be poisoned 1 minute and unable to concentrate on spells due to retching."
          }
        ]
      }
    ]
  },
  {
    "category": "Megafauna",
    "creatures": [
      {
        "name": "Quugaarpak",
        "note": "Already described under Pachyderms as the explanation for mammoth remains."
      }
    ]
  },
  {
    "category": "Giants",
    "creatures": [
      {
        "name": "General Giants",
        "note": "A full list of giants was mentioned but not specifically enumerated in the original text. Giants are humanoids of enormous size from various mythologies. They often have attacks like 'Rock Throw' (2d10 bludgeoning, DC varies) and 'Ground Pound' (3d8 bludgeoning in a radius). Without specific named giants given in the original list, we leave this note."
      }
    ]
  },
  {
    "category": "Artificial creatures",
    "creatures": [
      {
        "name": "Automaton",
        "origin": "Worldwide",
        "appearance": "A self-operating machine, often humanoid, made of metal or wood.",
        "attacks": [
          {
            "name": "Clockwork Strike",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, DC 13 Con save or be stunned 1 round as gears jam the target’s senses."
          },
          {
            "name": "Gearspark Discharge",
            "damage": "2d6 lightning",
            "effect": "Ranged 30 ft. On a hit, DC 12 Dex save or target’s next attack is made at disadvantage due to static shock."
          }
        ]
      },
      {
        "name": "Blodeuwedd",
        "origin": "Welsh",
        "appearance": "A woman formed from flowers. Though artificial in origin, considered fey or magical construct.",
        "attacks": [
          {
            "name": "Floral Embrace",
            "damage": "2d6 poison",
            "effect": "On a hit, DC 14 Con save or target is ensnared in vines, restrained until they break free (DC 14 Str)."
          },
          {
            "name": "Pollen Charm",
            "damage": "None",
            "effect": "DC 15 Wis save or target is charmed for 1 minute, seeing Blodeuwedd as a trusted ally."
          }
        ]
      },
      {
        "name": "Brazen head",
        "origin": "Medieval legends",
        "appearance": "A talking head of brass said to answer any question.",
        "attacks": [
          {
            "name": "Omniscient Utterance",
            "damage": "2d8 psychic",
            "effect": "DC 15 Int save or target is stunned 1 round, overwhelmed by impossible knowledge."
          },
          {
            "name": "Confounding Question",
            "damage": "None",
            "effect": "Target must DC 14 Wis save or be confused (as Confusion spell) for 1d4 rounds."
          }
        ]
      },
      {
        "name": "Doll Woman (Lenape)",
        "origin": "Lenape",
        "appearance": "A lifelike doll spirit, created by magic, can cause mischief if not appeased.",
        "attacks": [
          {
            "name": "Needle Stab",
            "damage": "2d4 piercing",
            "effect": "On a hit, DC 12 Con save or target takes an extra 1d4 necrotic as the doll drains vitality."
          },
          {
            "name": "Spirit Puppetry",
            "damage": "None",
            "effect": "DC 14 Cha save or target is controlled for 1 round, making them use their action as Doll Woman desires."
          }
        ]
      },
      {
        "name": "Frankenstein's monster",
        "origin": "Modern literature (Mary Shelley)",
        "appearance": "A stitched-together humanoid made of corpses, strong and misunderstood.",
        "attacks": [
          {
            "name": "Brutal Slam",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, DC 14 Str save or be knocked prone. If prone, Monster deals +1d6 damage on next attack."
          },
          {
            "name": "Grief-Fueled Rage",
            "damage": "None",
            "effect": "If reduced below half HP, Monster gains advantage on attacks and +2 damage for 1 minute."
          }
        ]
      },
      {
        "name": "Galatea",
        "origin": "Greek",
        "appearance": "An ivory statue carved by Pygmalion, brought to life by Aphrodite.",
        "attacks": [
          {
            "name": "Ivory Strike",
            "damage": "2d8 bludgeoning",
            "effect": "On a hit, DC 13 Dex save or target drops one held item, slipping from their grasp."
          },
          {
            "name": "Loving Gaze",
            "damage": "None",
            "effect": "DC 14 Wis save or be charmed, unable to attack Galatea for 1 minute."
          }
        ]
      },
      {
        "name": "Gingerbread man",
        "origin": "German/European folktales",
        "appearance": "A small, animated cookie in human form, mischievously fast.",
        "attacks": [
          {
            "name": "Crumb Toss",
            "damage": "1d4 bludgeoning",
            "effect": "On a hit, DC 12 Dex save or target is distracted, granting Gingerbread man advantage on next attack."
          },
          {
            "name": "Run, Run!",
            "damage": "None",
            "effect": "Gingerbread man can Disengage and Dash as a bonus action. Enemies must DC 13 Wis save or be too amused to attack it for 1 round."
          }
        ]
      },
      {
        "name": "Golem",
        "origin": "Jewish",
        "appearance": "A humanoid construct of clay or mud animated by holy words.",
        "attacks": [
          {
            "name": "Clay Fist",
            "damage": "3d6 bludgeoning",
            "effect": "On a hit, DC 14 Str save or be grappled and restrained as clay hardens around the target."
          },
          {
            "name": "Earthen Shield",
            "damage": "None",
            "effect": "As a reaction, Golem hardens its body, gaining +2 AC until start of its next turn."
          }
        ]
      },
      {
        "name": "Homunculus",
        "origin": "Alchemy",
        "appearance": "A small humanoid created through alchemical means, diminutive but intelligent.",
        "attacks": [
          {
            "name": "Alchemical Bite",
            "damage": "2d4 acid",
            "effect": "On a hit, DC 12 Con save or target’s armor/weapon takes a -1 penalty as acid corrodes it."
          },
          {
            "name": "Toxic Spit",
            "damage": "2d6 poison",
            "effect": "Ranged 20 ft. DC 13 Con save or poisoned for 1 minute, disadvantage on attack rolls."
          }
        ]
      },
      {
        "name": "Nephele",
        "origin": "Greek",
        "appearance": "A nymph formed from a cloud by Zeus, resembling a goddess but made of mist.",
        "attacks": [
          {
            "name": "Cloud Embrace",
            "damage": "2d6 cold",
            "effect": "On a hit, DC 13 Wis save or target’s vision is obscured, granting disadvantage on Perception checks for 1 minute."
          },
          {
            "name": "Vapor Shift",
            "damage": "None",
            "effect": "Nephele can move through enemies’ spaces, forcing DC 13 Dex save or they lose their reaction as they cough on mist."
          }
        ]
      },
      {
        "name": "Shabti/Ushabti",
        "origin": "Egyptian",
        "appearance": "Clay or wooden figurines placed in tombs, servants in the afterlife brought to life by magic.",
        "attacks": [
          {
            "name": "Clay Blade",
            "damage": "2d6 slashing",
            "effect": "On a hit, DC 12 Strength save or be slowed (speed halved) as clay residue clings to limbs."
          },
          {
            "name": "Servant’s Duty",
            "damage": "None",
            "effect": "Shabti can take damage meant for its master if within 5 ft, reducing that damage by half."
          }
        ]
      },
      {
        "name": "Tokeloshe (Tikoloshe)",
        "origin": "Zulu",
        "appearance": "A small hairy humanoid created by witches, with various magical powers, often mischievous or malevolent.",
        "attacks": [
          {
            "name": "Witch’s Claw",
            "damage": "2d6 necrotic",
            "effect": "On a hit, DC 13 Con save or target takes 1d4 necrotic damage each turn for 3 turns."
          },
          {
            "name": "Nightmare Whisper",
            "damage": "None",
            "effect": "DC 14 Wis save or target is frightened and cannot benefit from long rests that night."
          }
        ]
      },
      {
        "name": "Tilberi",
        "origin": "Icelandic",
        "appearance": "A creation of a witch from a rib and wool, used to steal milk. Small, worm-like or humanoid.",
        "attacks": [
          {
            "name": "Milk Drain",
            "damage": "None",
            "effect": "Target’s rations and stored food spoil instantly. If used on livestock, they produce no milk for a day."
          },
          {
            "name": "Woolen Strangle",
            "damage": "2d4 bludgeoning",
            "effect": "On a hit, DC 12 Str save or be grappled by fibrous strands. Grappled target takes 1d4 bludgeoning each turn."
          }
        ]
      },
      {
        "name": "Tsukumogami",
        "origin": "Japanese",
        "appearance": "Household objects that come to life after 100 years, such as umbrellas, sandals, teapots.",
        "attacks": [
          {
            "name": "Animate Strike",
            "damage": "Varies (2d6 bludgeoning or slashing depending on object)",
            "effect": "On a hit, DC 13 Int save or be surprised as the familiar object attacks, granting Tsukumogami advantage on next attack."
          },
          {
            "name": "Mischief Scatter",
            "damage": "None",
            "effect": "Forces DC 14 Wis save or target drops a held object as the Tsukumogami’s sudden movement startles them."
          }
        ]
      },
      {
        "name": "Tulpa",
        "origin": "Tibetan Buddhism",
        "appearance": "A creature brought to life by meditation and thought-form, can vary widely in form.",
        "attacks": [
          {
            "name": "Mind Echo",
            "damage": "2d6 psychic",
            "effect": "On a hit, DC 14 Wis save or target is stunned 1 round by mental feedback."
          },
          {
            "name": "Thought-Form Shift",
            "damage": "None",
            "effect": "Tulpa changes shape, imposing disadvantage on next attack roll against it as foes misjudge its form."
          }
        ]
      },
      {
        "name": "Tupilaq",
        "origin": "Inuit",
        "appearance": "A small, carved figure brought to life by shamans, often to harm enemies. Bone, wood, sinew.",
        "attacks": [
          {
            "name": "Bone Scrape",
            "damage": "2d8 slashing",
            "effect": "On a hit, DC 14 Con save or contract a curse dealing 1d4 necrotic damage per turn for 3 turns."
          },
          {
            "name": "Dark Fetish",
            "damage": "None",
            "effect": "DC 15 Cha save or target is cursed: disadvantage on saves vs fear and charm for 1 hour."
          }
        ]
      }
    ]
  }
]